[
  {
    "id": "cb68898e-54b6-4209-baf9-d75d09825175",
    "url": "https://finance.yahoo.com/topic/latest-news",
    "original_title": "Yahoo Finance",
    "provided_title": "View More",
    "authors": [],
    "publish_date": null,
    "extraction_date": "2025-03-10T16:54:04.031950",
    "text": "When asked if he's expecting a recession this year, Trump said \"I hate to predict things like that.\"\n\nElon Musk is running his businesses \"with great difficulty\" while working with the Trump administration, the Tesla CEO said on Monday in an interview with Fox Business.  His remarks followed Tesla losing $130 billion in stock market value in a broad selloff on Wall Street that left the electric car maker's shares at their lowest since October.  Tesla's shares slumped 15% to $222.15, weighing heavily on the Nasdaq, which tumbled 4% on fears that the Trump administration's tariffs against major U.S. trading partners could throw the country into a recession.\n\nCommonwealth LNG has seen an increase in interest from prospective buyers since it secured an export license from the administration of U.S. President Donald Trump last month, the project's owner said on Monday.  The U.S. Department of Energy granted an LNG export license to the Commonwealth LNG project in Louisiana in February, the first approval of LNG exports after former President Joe Biden paused them early last year for environmental review.  \"The...approval took a lot of risks off the table for the buyers and that's something we have been waiting for for over two years,\" Ben Dell, Managing Partner of energy management company Kimmeridge, told Reuters on the sidelines of the CERAWeek energy conference in Houston.\n\n(Bloomberg) -- Shares of Michael Saylor’s Strategy fell to nearly halfway below their peak as investors fret about economic headwinds and retreat from cryptocurrency-related bets that initially benefited from Donald Trump’s election win. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because\n\nOracle reported fiscal third-quarter sales that missed analysts’ expectations, but executives said they expect AI-driven growth in the coming fiscal year.\n\nIn keeping with tradition, the Amelia Concours classic car show picked, what else, a sports car with racing heritage as its best in show.\n\nThe federal government is an anti-corporation: It does things the private sector can't. So why is Elon Musk treating it like a bloated company?\n\nThe \"Magnificent Seven\" stocks were at the center of a sell-off in markets on Monday as investors continue to take risk off the table.\n\nTesla shares touched their lowest level since Nov. 4 on Monday.\n\nUS stocks looked set to build on losses of over 2% for the major indexes as March's struggles looked to continue.\n\nThe shift to defense is on.\n\nGoldman Sachs is the latest economic forecasting team to downgrade its outlook as Trump's tariffs are expected to weigh on growth and boost inflation.\n\nDonald Trump's pro-crypto stance is no longer enough to overcome a variety of other macro worries, as the price of bitcoin fell Monday to its lowest level since early November.\n\nAfter months of optimism over the prospect of a US economic \"soft landing,\" more Wall Street watchers are now warning of another possible outcome: stagflation.\n\nTrump's four major economic goals may offer some key benefits. But as Mohamed El-Erian notes, the juice may not be worth the squeeze if the GDP hit is too high.\n\n(Bloomberg) -- Cargill Inc. said the US food industry can’t fully replace seed oils as there aren’t enough alternatives in the market.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Designers Diller Scofidio + RenfroThe world’s largest\n\n(Bloomberg) -- What had been a steady pullback from the US stock market accelerated sharply Monday as investors retreated from virtually every type of risk. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Designers Diller Scofidio + Re\n\nIn keeping with tradition, the Amelia Concours classic car show picked, what else, a sports car with racing heritage as its best in show.\n\nVehicle systems manufacturer Commercial Vehicle Group (NASDAQ:CVGI) reported Q4 CY2024 results exceeding the market’s revenue expectations, but sales fell by 26.8% year on year to $163.3 million. The company expects the full year’s revenue to be around $690 million, close to analysts’ estimates. Its non-GAAP loss of $0.15 per share was significantly below analysts’ consensus estimates.\n\nDendur isn’t a conventional activist, but has privately been pushing for change at the company for years.\n\n(Bloomberg) -- The Bank of Japan will probably wait until the middle of the year before raising interest rates again as it looks to maintain a pace of one hike every six months despite recent market speculation of an earlier move, a former BOJ official said.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on I\n\nBASKING RIDGE, N.J. (AP) — Barnes & Noble Education Inc. BNED) on Monday reported fiscal third-quarter net income of $7.1 million, after reporting a loss in the same period a year earlier. The Basking Ridge, New Jersey-based company said it had profit of 23 cents per share.\n\nThe New Albany, Ohio-based company said it had a loss of $1.15 per share. Losses, adjusted for non-recurring costs and to account for discontinued operations, came to 15 cents per share. The supplier of products for heavy duty trucks posted revenue of $163.3 million in the period, topping Street forecasts.\n\nGRAND CAYMAN, Cayman Islands (AP) — Greenlight Capital Re Ltd. (GLRE) on Monday reported a loss of $27.4 million in its fourth quarter. On a per-share basis, the Grand Cayman, Cayman Islands-based company said it had a loss of 81 cents. The property and casualty reinsurance service provider posted revenue of $141.8 million in the period.\n\nLEXINGTON, Ky. AP) — Ramaco Resources, Inc. METC) on Monday reported profit of $3.9 million in its fourth quarter.\n\n(Bloomberg) -- For months, crypto-loving investors sank billions into leveraged strategies with the hope that Donald Trump would eliminate regulations on their upstart industry and usher in a new world of digital prosperity.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside\n\nSouthern yellow pine futures will begin trading later this month as prices split from those of Canadian lumber.\n\n(Bloomberg) -- Latin American currencies led a broad rout in emerging-markets Monday as traders fled to haven assets on mounting speculation that President Donald Trump’s trade policies may squash US economic growth. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘N\n\nThe federal government is an anti-corporation: It does things the private sector can't. So why is Elon Musk treating it like a bloated company?\n\nThe Warrendale, Pennsylvania-based company said it had profit of 82 cents per share. Earnings, adjusted for amortization costs and non-recurring costs, came to $1.15 per share. The company posted revenue of $143.7 million in the period.\n\n(Bloomberg) -- Oracle Corp. reported a surge in bookings and gave a revenue forecast for the fiscal year beginning in June that topped estimates, fueling confidence that the company is gaining large customers for its cloud infrastructure business.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not\n\nAerospace and defense company Redwire (NYSE:RDW) fell short of the market’s revenue expectations in Q4 CY2024, but sales rose 9.6% year on year to $69.56 million. On the other hand, the company’s full-year revenue guidance of $570 million at the midpoint came in 24.2% above analysts’ estimates. Its GAAP loss of $1.38 per share was significantly below analysts’ consensus estimates.\n\n(Bloomberg) -- The list of companies that have flopped out of the gate when entering public markets has a new king: Venture Global Inc. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Designers Diller Scofidio + RenfroShares of the liq\n\nCHICAGO (Reuters) -Delta Air Lines on Monday slashed its first-quarter profit estimates by half, sending its shares down 14% in aftermarket action, with its CEO saying shortly after that the environment had weakened due to U.S. economic uncertainty.  U.S. consumer and business confidence has weakened in the wake of President Donald Trump's tariffs and threats of additional levies, and raised concerns about higher prices.  The Atlanta Federal Reserve's closely followed GDPNow tracker suggests the economy could shrink in the first three months of the year.\n\nBluesky now allows videos that are up to 3 minutes long, the decentralized social network announced on Monday. The platform launched support for video back in September with a 60-second time limit. With the new expanded time limit, Bluesky is bringing its user experience more in line with its competitors, X (formerly Twitter) and Meta's Threads. X allows nonpaying users to upload videos up to two minutes and 20 second in length, while Threads lets users videos up to five minutes long. The change\n\nHOUSTON (AP) — NCS Multistage Holdings, Inc. NCSM) on Monday reported profit of $3.5 million in its fourth quarter. The Houston-based company said it had profit of $1.32 per share.\n\n(Bloomberg) -- Rite Aid Corp. is in talks with providers of its asset-backed-loan to fully access the facility and implement its turnaround plan, according to people familiar with the matter.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High L\n\nHedge funds reduced their exposure to stocks on Friday at the largest amount in more than two years, according to a Goldman Sachs note released on Monday. The bank added some hedge funds' large moves on Friday could be compared to what was seen in March 2020, during the breakout of the COVID pandemic, and January 2021, when hedge funds were forced to unwind their short positions in the so-called meme stocks, or popular stocks among retail investors.\n\nBuilding systems company Limbach (NASDAQ:LMB) fell short of the market’s revenue expectations in Q4 CY2024, with sales flat year on year at $143.7 million. On the other hand, the company’s full-year revenue guidance of $620 million at the midpoint came in 3.8% above analysts’ estimates. Its non-GAAP profit of $1.15 per share was 49.4% above analysts’ consensus estimates.\n\nWall Street’s stock markets plunged amid fears Donald Trump’s tariff trade war will hammer American growth.\n\nREDWOOD CITY, Calif. AP) — Coherus BioSciences Inc. CHRS) on Monday reported a loss of $50.7 million in its fourth quarter.\n\n(Bloomberg) -- Cryptocurrency prices extended their slide, sending Bitcoin to the lowest level since November, as escalating tariff-war tensions spurred concern about the economy that offset a wave of pro-crypto announcements from President Donald Trump last week.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix I\n\n(Bloomberg) -- Emerge Canada Inc., an investment firm known for selling Toronto-listed versions of Cathie Wood’s popular exchange-traded funds, has allegedly violated securities laws, according to Ontario’s securities regulator.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpIn\n\nMOBILE, Ala. AP) — TruBridge, Inc. TBRG) on Monday reported a loss of $5.7 million in its fourth quarter.\n\nBuilding products company Quanex (NYSE:NX) reported Q4 CY2024 results exceeding the market’s revenue expectations, with sales up 67.3% year on year to $400 million. The company expects the full year’s revenue to be around $1.85 billion, close to analysts’ estimates. Its non-GAAP profit of $0.19 per share was significantly above analysts’ consensus estimates.\n\n(Bloomberg) -- Venezuela will stop receiving deportees from the US in response to President Donald Trump’s decision to revoke Chevron Corp’s license to operate in the South American country. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High L\n\nWork management software maker Asana (NYSE: ASAN) met Wall Street’s revenue expectations in Q4 CY2024, with sales up 10% year on year to $188.3 million. On the other hand, the company’s full-year revenue guidance of $786 million at the midpoint came in 2.1% below analysts’ estimates. Its non-GAAP loss of $0 per share was $0.01 above analysts’ consensus estimates.\n\nHOUSTON (AP) — Quanex Building Products Corp. NX) on Monday reported a loss of $14.9 million in its fiscal first quarter. The Houston-based company said it had a loss of 32 cents per share.\n\nThe company added that the cost savings would mitigate the impact of a potential reduction in revenue and related operating income from the company's Greater China business.  \"Our new fiscal 2025 guidance provides for limited further earnings contribution from China, and assumes a continuation of the macro trends we see today,\" said CFO Ankur Dhingra.  China announced a ban on imports of genetic sequencers from Illumina that took effect from March 4, just minutes after U.S. President Donald Trump's additional 10% tariff on Chinese goods took effect.\n\nCHARLOTTE, N.C. (AP) — Paymentus Holdings Inc. PAY) on Monday reported net income of $13.1 million in its fourth quarter. The Charlotte, North Carolina-based company said it had net income of 10 cents per share.\n\n(Bloomberg) -- Anxiety that tariffs and government firings will torpedo growth in the world’s largest economy extended a three-week stretch of volatility across global markets. American stocks got hammered as Wall Street tempered bullish views while demand for recession havens boosted sovereign bonds.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add Housing\n\nUpscale restaurant company The One Group Hospitality (NASDAQ:STKS) reported Q4 CY2024 results topping the market’s revenue expectations, with sales up 147% year on year to $221.9 million. Revenue guidance for the full year exceeded analysts’ estimates, but next quarter’s guidance of $202.5 million was less impressive, coming in 2.4% below expectations. Its non-GAAP loss of $0.03 per share was significantly below analysts’ consensus estimates.\n\nIf forecasts for Wednesday's official report are correct, inflation likely decelerated slightly in February but remained well over the Federal Reserve's 2% annual rate goal.\n\nHOUSTON (AP) — Flotek Industries Inc. FTK) on Monday reported earnings of $4.4 million in its fourth quarter. The Houston-based company said it had net income of 14 cents per share.\n\n(Bloomberg) -- The selloff in US equities accelerated Monday, with major averages tumbling to their worst day this year, as investors braced for a slowdown in the Amerian economy.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Designer\n\nBROOMFIELD, Colo. AP) — Vail Resorts Inc. MTN) on Monday reported fiscal second-quarter earnings of $245.5 million.\n\n(Bloomberg) -- Tesla Inc. shares plunged to their worst day in more than four years, extending a slide in 2025 amid growing concerns on Wall Street about demand for the company’s electric cars.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High\n\n(Bloomberg) -- A slump in the S&P 500 Index on Monday sent the Cboe Volatility Index a hair away from 30, the level it last reached during the volatility shock in August. Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Designers Diller\n\n(Bloomberg) -- Technology shares suffered their biggest one-day plunge since 2022, as investors ditched longtime market leaders on rising worries the economy is headed for a recession.Most Read from BloombergNJ College to Merge With State School After Financial StressNYC Congestion Pricing Toll Gains Support Among City ResidentsWhere New York City's Zoning Reform Will Add HousingBuffalo’s Billion-Dollar Freeway Fix Is on Ice, But Not Because of TrumpInside the ‘Not Architecture’ of High Line Des\n\nThe Dow Jones Industrial Average dropped 2.1%, and the Nasdaq composite sank 4%. Elon Musk's Tesla fell to one of the market's sharpest losses, as did airlines and other companies that need U.S. shoppers feeling confident enough to spend. Bitcoin fell below $79,000 from more than $100,000 in December.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 2978,
    "summary": "At Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "provided_title": "NYC congestion pricing set to take effect after years of delays",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "provided_title": "Maduro Rival Seeks Biden Talks Before Venezuela’s Inauguration",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "provided_title": "Austrian Chancellor Nehammer Quits as Coalition Talks Fail",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "provided_title": "How low can bond spreads go? Five numbers to watch",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/biden-ban-oil-drilling-over-040842217.html",
    "provided_title": "Biden to ban new oil drilling over vast stretch of US Atlantic, Pacific waters",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/biden-ban-oil-drilling-over-040842217.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "d90c4d4f-cbf6-4743-82ed-ddc9071a7156",
    "url": "https://finance.yahoo.com/news/boeing-ended-difficult-2024-biggest-094501398.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Boeing ended its difficult 2024 as the biggest loser in the Dow Jones index",
    "authors": [
      "Pete Syme  Updated Sun, Jan 5, 2025, 7:25 AM 3 min read"
    ],
    "publish_date": "2025-01-05T13:25:42.000Z",
    "extraction_date": "2025-03-10T16:54:14.656442",
    "text": "Of the 30 companies in the Dow Jones Industrial Average, Boeing's share price fell the most in 2024.\n\nThe planemaker got off to a worrying start with January's Alaska Airlines blowout.\n\nIts new CEO also had to contend with a seven-week strike that contributed to delivery delays.\n\nBoeing's painful 2024 ended with the planemaker ranking as the biggest loser in the Dow Jones Industrial Average.\n\nIts share price dropped 31% last year — the worst of the index's 30 companies, according to Markets Insider data.\n\nThe planemaker was close to avoiding that title as Nike shares fell nearly 30% across the same period. As a whole, the Dow Jones was up 13%, led by Nvidia after its stock more than doubled.\n\nJust days into 2024 it was apparent that it was going to be a testing year for Boeing.\n\nOn January 5, an Alaska Airlines 737 Max lost a door plug in midair. The fact that the plane was delivered 66 days earlier suggested the problem originated with the manufacturer. That was later shown in the National Transportation Safety Board's preliminary report that said the plane left Boeing's factory missing key bolts.\n\nThe incident sparked an overhaul of the company's processes and culture — and a wave of criticism from airline bosses.\n\nRegulators placed Boeing under further scrutiny too. The Federal Aviation Administration limited production of the 737 Max to 38 jets a month. Its administrator, Mike Whitaker, told Reuters last month he expects Boeing to take several months to get up to that number.\n\nIn March, Dave Calhoun stepped down as CEO. He was replaced in August by Kelly Ortberg, an industry veteran who signaled a return to prioritizing engineering over profit.\n\nOrtberg announced plans to be based in Seattle, Boeing's historic home, and visited factories.\n\nStill, the embattled company couldn't stay out of the headlines.\n\nIn September, its Starliner spacecraft returned to Earth uncrewed. The astronauts it took to the International Space Station were supposed to return after eight days, but problems with Starliner meant they are instead set to spend eight months in space.\n\nLater that month, some 30,000 Boeing workers went on strike, hampering production for seven weeks amid tense union negotiations. 737 Max production didn't restart until December.\n\nLate deliveries continued to irritate airline customers. During the strike, Ortberg announced further delays to Boeing's highly anticipated but yet-to-be-certified 777X jet.\n\nThe CEO also said Boeing would lay off 10% of its 170,000 employees.\n\nBoeing's biggest rival, Airbus, has seen its stock rise 14% over the past year.\n\nBank of America analysts estimated that the European planemaker delivered as many as 760 jets thanks to a big end-of-year push — slightly below Airbus' guidance of 770 planes.\n\nAt the end of November, Boeing had delivered less than half that number, at 318 jets.\n\nOrtberg has a plan to help level the playing field, including putting Boeing leaders on factory floors to help change the company's culture.\n\n\"This is a big ship that will take some time to turn, but when it does, it has the capacity to be great again,\" he said in a memo to staff.\n\n\"With the right focus and culture, we can be an iconic company and aerospace leader once again.\"\n\n2025 is set to be a pivotal year for Ortberg's plan to help move the company forward from last year's woes.\n\nNew year, new Boeing?\n\nRead the original article on Business Insider",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 570,
    "summary": "Boeing was set for a troubled year after the Alaska Airlines blowout last January led to heightened scrutiny. A seven-week strike made it even worse.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "befcca3c-c578-4b18-91de-802c02f9a40a",
    "url": "https://finance.yahoo.com/news/hedge-funds-soared-amid-big-164000834.html",
    "original_title": "Yahoo Finance",
    "provided_title": "These hedge funds soared amid big gains for US stocks and the dollar",
    "authors": [
      "Jason Ma   Sat, Jan 4, 2025, 10:40 AM 2 min read"
    ],
    "publish_date": "2025-01-04T16:40:00.000Z",
    "extraction_date": "2025-03-10T16:54:16.776223",
    "text": "Hedge funds scored hefty returns in 2024, when U.S. stocks and the dollar dominated global markets. Despite an election-fueled \"America first\" narrative in the broader market, some diversified funds still notched outsized gains.\n\nTop hedge funds put up big numbers in 2024, which was dominated by U.S. markets that got a jolt from Donald Trump's presidential election victory.\n\nDespite an \"America first\" narrative that helped boost the S&P 500 23% and the U.S. dollar index by about 7% last year, some multi-strategy funds with bets across different asset classes and geographies saw outsized gains.\n\nFor example, Discovery Capital Management soared 52%, a person familiar with the matter said, confirming other reports. The hedge fund declined to comment.\n\nThat builds on top of a 48% surge in 2023, making it one of the best hedge funds on Wall Street that year, according to Bloomberg.\n\nMeanwhile, D.E. Shaw's Oculus, a macro-oriented multi-strategy fund, returned 36.1% in 2024, and the Composite fund, its largest multi-strategy fund, returned 18%, according to a person familiar with the firm’s results. D.E. Shaw declined to comment.\n\nWhile their performance is often compared to the S&P 500's, hedge funds point out that they don't benchmark themselves to the large-cap U.S. stock index and instead seek to hedge against market downside while providing consistent, risk-adjusted gains that aren't necessarily correlated with the S&P 500.\n\nIn addition, hedge funds often employ different strategies across various offerings. Citadel's flagship Wellington multi-strategy fund returned 15.1% in 2024, a person familiar with the matter confirmed, while its Tactical Trading fund returned 22.3%, and its Equities fund scored an 18% gain. Citadel declined to comment.\n\nElsewhere, Millennium Management climbed 15%, according to reports. The hedge fund didn't immediately respond to requests for comment.\n\nWith such gains, those funds were on track to outperform their peers. Through the first 11 months of 2024, hedge funds overall averaged a 10.7% return, according to the latest data from PivotalPath cited by Reuters. That's up from a 5.7% average return in the same period in 2023.\n\nAnd among global hedge funds taking long and short bets on stocks last year, the total weighted average return came in at 12.75%, according to a private Goldman Sachs note that was seen by Reuters.\n\n\"It could be argued that 2024 was the year of the stock picker, with equity hedge funds playing dispersion well and really leaning into creative shorting strategies and a careful use of leverage to drive returns,\" said PivotalPath CEO Jon Caplis told Reuters.\n\nThis story was originally featured on Fortune.com",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 423,
    "summary": "Some multi-strategy funds with bets across different asset classes and geographies saw outsized gains.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "44078d69-d234-4301-b08a-0f431966396c",
    "url": "https://finance.yahoo.com/news/ai-stocks-watch-apple-tv-140000580.html",
    "original_title": "Yahoo Finance",
    "provided_title": "AI stocks to watch, Apple TV tries free, and the Chips Act scramble: Tech roundup",
    "authors": [
      "Quartz   Sat, Jan 4, 2025, 8:00 AM 4 min read"
    ],
    "publish_date": "2025-01-04T14:00:00.000Z",
    "extraction_date": "2025-03-10T16:54:18.880612",
    "text": "kinjavideo-197409\n\nBig Tech stocks could have another big year in 2025.\n\nNvidia (NVDA), Amazon (AMZN), Alphabet (GOOGL), and Apple (AAPL) could continue to be some of the biggest winners of the artificial intelligence-driven stock boom, David Dietze, senior portfolio strategist at Peapack Private Wealth Management, said in the latest episode of Quartz AI Factor, a video series set at the Nasdaq MarketSite.\n\nRead More\n\nApple (AAPL) announced Monday that its video streaming service, Apple TV+, will be free worldwide this upcoming weekend, allowing anyone with an Apple ID to access the platform’s shows.\n\nRead More\n\nBig Tech is spending billions on artificial intelligence as demand grows for computing power and more advanced capabilities.\n\nMicrosoft (MSFT), Meta (META), Google (GOOGL), and Amazon (AMZN) spent a combined $125 billion on investing in and running AI data centers between January and August 2024, according to a JPMorgan (JPM) report citing New Street Research. The research shows both total AI capital expenditures and total data center operating costs, which include “cash operating expenses, software, depreciation, and electricity.”\n\nRead More\n\nApple (AAPL) is giving its Chinese customers a discount on iPhones as it competes with homegrown rivals such as Huawei.\n\nThe iPhone maker is offering a discount of up to 500 Chinese yuan, or $68.50, on its latest iPhone models when customers use “eligible payment methods,” according to the Apple website. The 500 yuan discount applies to the iPhone 16 Pro and iPhone 16 Pro Max, while the iPhone 16 and iPhone 16 Plus will be discounted by 400 yuan during the promotion, which runs from January 4 to 7.\n\nRead More\n\nTech giant Apple (AAPL) has agreed to pay $95 million to settle a proposed cash action lawsuit over allegations that it used its virtual assistant to eavesdrop on iPhone users.\n\nRead More\n\nJust when you thought your toaster couldn’t get any smarter, CES 2025 is about to prove you wrong. The world’s biggest tech show returns to Las Vegas from January 7-10, promising to stuff artificial intelligence into literally everything that has a power button.\n\nRead More\n\nAs the Biden administration prepares to pass power to President-elect Donald Trump, U.S. chipmakers are rushing to finalize federal funding.\n\nIn 2022, President Joe Biden signed the bipartisan CHIPS and Science Act to boost semiconductor manufacturing, research, and development in the U.S. The $280 billion package includes $52 billion in subsidies for chips.\n\nRead More\n\nElon Musk’s Starlink is set to give Ukraine “uninterrupted” service through its satellite network through a partnership with Kyivstar (VEON), the country’s largest mobile operator.\n\nRead More\n\nkinjavideo-197411\n\nDavid Dietze of Peapack Private Wealth Management says capital expenditures are no longer enough and AI companies must deliver tangible cash flows\n\nkinjavideo-197410\n\nDavid Dietze of Peapack Private Wealth Management on the companies powering the AI revolution — and who’s cashing in\n\nFor the latest news, Facebook, Twitter and Instagram.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 477,
    "summary": "Big Tech stocks could have another big year in 2025.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/wall-street-top-banks-just-140000186.html",
    "provided_title": "Wall Street’s Top Banks Just Abandoned a Once Popular Alliance",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/wall-street-top-banks-just-140000186.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "ab415635-12a8-482c-a7bd-2865a9b0e5ec",
    "url": "https://finance.yahoo.com/news/p-global-price-target-lowered-130534578.html",
    "original_title": "Yahoo Finance",
    "provided_title": "S&P Global price target lowered to $580 from $590 at Oppenheimer",
    "authors": [
      "TipRanks   Sat, Jan 4, 2025, 7:05 AM 1 min read"
    ],
    "publish_date": "2025-01-04T13:05:34.000Z",
    "extraction_date": "2025-03-10T16:54:22.704401",
    "text": "Oppenheimer lowered the firm’s price target on S&P Global to $580 from $590 and keeps an Outperform rating on the shares as part of a Q4 earnings preview. The weak Q4 issuance expectation didn’t appear to materialize, and Opco’s proprietary tracker indicates that issuance bettered expectations, the analyst tells investors in a research note. The firm forecast that S&P Global’s and Moody’s Q4 Ratings revenues grew 13% and 22% year-over-year, respectively, higher than the consensus estimates of 11% and 7%. It expects Moody’s Street estimates to rise going into the print. However, for the stocks to work on the print and in 2025, the 2025 guidance and results throughout the year have to exceed investor expectations, contends Oppenheimer.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee Insiders’ Hot Stocks on TipRanks >>\n\nRead More on SPGI:\n\nIs Amgen (NASDAQ:AMGN) a High-Quality Dividend Stock on Sale?\n\nCan Morgan Stanley (NYSE:MS) Stock Run Higher?\n\nMoody’s initiated with a Buy at Citi\n\nS&P Global initiated with a Buy at Citi\n\nMicrosoft’s Financial Strength and Growth Prospects Make It a Strong Buy for Investors",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 213,
    "summary": "Oppenheimer lowered the firm’s price target on S&P Global to $580 from $590 and keeps an Outperform rating on the shares as part of a Q4 earnings preview. The weak Q4 issuance expectation didn’t appear to materialize, and Opco’s proprietary tracker indicates that issuance bettered expectations, the analyst tells investors in a research note. The firm forecast that S&P Global’s and Moody’s Q4 Ratings revenues grew 13% and 22% year-over-year, respectively, higher than the consensus estimates of 11",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "e4b0b2c8-9a4b-4ac6-b396-af799da54bd6",
    "url": "https://finance.yahoo.com/news/tractor-supply-target-adjusted-stock-125515043.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Tractor Supply target adjusted for stock split at Evercore ISI",
    "authors": [
      "TipRanks   Sat, Jan 4, 2025, 6:55 AM 1 min read"
    ],
    "publish_date": "2025-01-04T12:55:15.000Z",
    "extraction_date": "2025-03-10T16:54:24.761156",
    "text": "Evercore ISI lowered the firm’s price target on Tractor Supply (TSCO) to $58 from $290 and keeps an In Line rating on the shares as the firm adjusted its target to reflect the 5-for-1 stock split that occurred on December 20. The firm made no changes to any of its financial assumptions or outlook based on the adjustment to the share count, the analyst noted.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on TSCO:\n\nTractor Supply closes acquistion of Allivet\n\nTractor Supply target adjusted for stock split at Barclays\n\nVOO ETF Update, 12/30/2024\n\nSPY ETF Update, 12/27/2024\n\nSPY ETF Update, 12/24/2024",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 144,
    "summary": "Evercore ISI lowered the firm’s price target on Tractor Supply (TSCO) to $58 from $290 and keeps an In Line rating on the shares as the firm adjusted its target to reflect the 5-for-1 stock split that occurred on December 20. The firm made no changes to any of its financial assumptions or outlook based on the adjustment to the share count, the analyst noted. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommen",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "2ee4e4f0-da26-4b13-979c-4ebdc829e758",
    "url": "https://finance.yahoo.com/m/539777b7-ba2e-3d67-baf5-9b4f269daa4a/jobs-report-fed-minutes-.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Jobs Report, Fed Minutes, Delta Earnings: What to Watch Next Week",
    "authors": [
      "The Wall Street Journal   Fri, Jan 3, 2025, 9:30 AM 1 min read"
    ],
    "publish_date": "2025-01-03T15:30:02.000Z",
    "extraction_date": "2025-03-10T16:54:26.972137",
    "text": "Here's a rundown of some of the key scheduled events and data releases next week: Monday, Jan. 6 Services PMIs: Purchasing managers indexes for services in numerous economies are set to be published by S&P Global.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 36,
    "summary": "Here's a rundown of some of the key scheduled events and data releases next week: Monday, Jan. 6   Services PMIs: Purchasing managers indexes for services in numerous economies are set to be published by S&P Global.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "5f0d1052-390d-462d-8c7a-d78b6bd33cc4",
    "url": "https://finance.yahoo.com/news/q3-earnings-highlights-coupang-nyse-090904592.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Q3 Earnings Highlights: Coupang (NYSE:CPNG) Vs The Rest Of The Online Retail Stocks",
    "authors": [
      "Adam Hejl   Fri, Jan 3, 2025, 3:09 AM 5 min read"
    ],
    "publish_date": "2025-01-03T09:09:04.000Z",
    "extraction_date": "2025-03-10T16:54:28.993406",
    "text": "As the Q3 earnings season wraps, let’s dig into this quarter’s best and worst performers in the online retail industry, including Coupang (NYSE:CPNG) and its peers.\n\nConsumers ever rising demand for convenience, selection, and speed are secular engines underpinning ecommerce adoption. For years prior to Covid, ecommerce penetration as a percentage of overall retail would grow 1-2% annually, but in 2020 adoption accelerated by 5%, reaching 25%, as increased emphasis on convenience drove consumers to structurally buy more online. The surge in buying caused many online retailers to rapidly grow their logistics infrastructures, preparing them for further growth in the years ahead as consumer shopping habits continue to shift online.\n\nThe 6 online retail stocks we track reported a strong Q3. As a group, revenues beat analysts’ consensus estimates by 2.2% while next quarter’s revenue guidance was 0.7% below.\n\nThankfully, share prices of the companies have been resilient as they are up 5.7% on average since the latest earnings results.\n\nFounded in 2010 by Harvard Business School student Bom Kim, Coupang (NYSE:CPNG) is an e-commerce giant often referred to as the \"Amazon of South Korea\".\n\nCoupang reported revenues of $7.87 billion, up 27.2% year on year. This print exceeded analysts’ expectations by 1.4%. Overall, it was a strong quarter for the company with a solid beat of analysts’ EBITDA estimates and solid growth in its buyers.\n\n“This quarter we continued the strong momentum we’ve seen throughout this year, delivering robust growth in revenues and margins,” said Gaurav Anand, CFO of Coupang.\n\nUnsurprisingly, the stock is down 16.5% since reporting and currently trades at $22.45.\n\nWe think Coupang is a good business, but is it a buy today? Read our full report here, it’s free.\n\nKnown for its glass tower car vending machines, Carvana (NYSE:CVNA) provides a convenient automotive shopping experience by offering an online platform for buying and selling used cars.\n\nCarvana reported revenues of $3.66 billion, up 31.8% year on year, outperforming analysts’ expectations by 5.3%. The business had an exceptional quarter with an impressive beat of analysts’ EBITDA estimates.\n\nCarvana achieved the biggest analyst estimates beat and fastest revenue growth among its peers. Although it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 8.5% since reporting. It currently trades at $189.81.\n\nIs now the time to buy Carvana? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 2002 by Niraj Shah, Wayfair (NYSE:W) is a leading online retailer of mass-market home goods in the US, UK, Canada, and Germany.\n\nWayfair reported revenues of $2.88 billion, down 2% year on year, in line with analysts’ expectations. It was a slower quarter as it posted a significant miss of analysts’ number of active customers estimates and a decline in its buyers.\n\nWayfair delivered the weakest performance against analyst estimates and slowest revenue growth in the group. The company reported 21.7 million active buyers, down 2.7% year on year. Interestingly, the stock is up 7.5% since the results and currently trades at $46.06.\n\nRead our full analysis of Wayfair’s results here.\n\nFounded by Ryan Cohen, who later became known for his involvement in GameStop, Chewy (NYSE:CHWY) is an online retailer specializing in pet food, supplies, and healthcare services.\n\nChewy reported revenues of $2.88 billion, up 4.8% year on year. This result beat analysts’ expectations by 0.7%. Overall, it was a very strong quarter as it also recorded a solid beat of analysts’ EBITDA estimates.\n\nThe stock is up 4.2% since reporting and currently trades at $34.99.\n\nRead our full, actionable report on Chewy here, it’s free.\n\nLaunched in 2003 by software engineers Michael Mente and Mike Karanikolas, Revolve (NASDAQ:RVLV) is a fashion retailer leveraging social media and a community of fashion influencers to drive its merchandising strategy.\n\nRevolve reported revenues of $283.1 million, up 9.9% year on year. This number topped analysts’ expectations by 4.4%. It was a very strong quarter as it also produced an impressive beat of analysts’ EBITDA estimates and a narrow beat of analysts’ number of active customers estimates.\n\nThe company reported 2.63 million active buyers, up 4.7% year on year. The stock is up 28.6% since reporting and currently trades at $33.47.\n\nRead our full, actionable report on Revolve here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 899,
    "summary": "As the Q3 earnings season wraps, let’s dig into this quarter’s best and worst performers in the online retail industry, including Coupang (NYSE:CPNG) and its peers.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "65a168e4-787f-4477-a5ae-4f2fbb4b7913",
    "url": "https://finance.yahoo.com/news/unpacking-q3-earnings-hain-celestial-090849049.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Unpacking Q3 Earnings: Hain Celestial (NASDAQ:HAIN) In The Context Of Other Shelf-Stable Food Stocks",
    "authors": [
      "Adam Hejl   Fri, Jan 3, 2025, 3:08 AM 5 min read"
    ],
    "publish_date": "2025-01-03T09:08:49.000Z",
    "extraction_date": "2025-03-10T16:54:31.087122",
    "text": "As the Q3 earnings season comes to a close, it’s time to take stock of this quarter’s best and worst performers in the shelf-stable food industry, including Hain Celestial (NASDAQ:HAIN) and its peers.\n\nAs America industrialized and moved away from an agricultural economy, people faced more demands on their time. Packaged foods emerged as a solution offering convenience to the evolving American family, whether it be canned goods or snacks. Today, Americans seek brands that are high in quality, reliable, and reasonably priced. Furthermore, there's a growing emphasis on health-conscious and sustainable food options. Packaged food stocks are considered resilient investments. People always need to eat, so these companies can enjoy consistent demand as long as they stay on top of changing consumer preferences. The industry spans from multinational corporations to smaller specialized firms and is subject to food safety and labeling regulations.\n\nThe 20 shelf-stable food stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates while next quarter’s revenue guidance was 5.7% below.\n\nWhile some shelf-stable food stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.6% since the latest earnings results.\n\nSold in over 75 countries around the world, Hain Celestial (NASDAQ:HAIN) is a natural and organic food company whose products range from snacks to teas to baby food.\n\nHain Celestial reported revenues of $394.6 million, down 7.2% year on year. This print was in line with analysts’ expectations, but overall, it was a softer quarter for the company with a significant miss of analysts’ adjusted operating income estimates.\n\n“Our performance in the first quarter built upon the momentum from our foundational year by further streamlining our portfolio and operational footprint, enabling us to deliver gross margin expansion,” said Wendy Davidson, Hain Celestial President and CEO.\n\nUnsurprisingly, the stock is down 30.9% since reporting and currently trades at $6.15.\n\nRead our full report on Hain Celestial here, it’s free.\n\nBest known for its portfolio of powerhouse breakfast cereal brands, General Mills (NYSE:GIS) is a packaged foods company that has also made a mark in cereals, baking products, and snacks.\n\nGeneral Mills reported revenues of $5.24 billion, up 2% year on year, outperforming analysts’ expectations by 1.9%. The business had a very strong quarter with a solid beat of analysts’ EBITDA estimates and an impressive beat of analysts’ gross margin estimates.\n\nAlthough it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 3.6% since reporting. It currently trades at $63.54.\n\nIs now the time to buy General Mills? Access our full analysis of the earnings results here, it’s free.\n\nBest known for its SuperPretzel soft pretzels and ICEE frozen drinks, J&J Snack Foods (NASDAQ:JJSF) produces a range of snacks and beverages and distributes them primarily to supermarket and food service customers.\n\nJ&J Snack Foods reported revenues of $426.8 million, down 3.9% year on year, in line with analysts’ expectations. It was a disappointing quarter as it posted a significant miss of analysts’ EBITDA and gross margin estimates.\n\nAs expected, the stock is down 11.3% since the results and currently trades at $153.79.\n\nRead our full analysis of J&J Snack Foods’s results here.\n\nFounded in 1919 as Nebraska Consolidated Mills in Omaha, Nebraska, Conagra Brands today (NYSE:CAG) boasts a diverse portfolio of packaged foods brands that includes everything from whipped cream to jarred pickles to frozen meals.\n\nConagra reported revenues of $3.20 billion, flat year on year. This number topped analysts’ expectations by 1.5%. Taking a step back, it was a mixed quarter as it also produced a solid beat of analysts’ organic revenue estimates but full-year EPS guidance missing analysts’ expectations.\n\nThe stock is up 2% since reporting and currently trades at $27.91.\n\nRead our full, actionable report on Conagra here, it’s free.\n\nFounded in 1895, Post (NYSE:POST) is a packaged food company known for its namesake breakfast cereal and healthier-for-you snacks.\n\nPost reported revenues of $2.01 billion, up 3.3% year on year. This result beat analysts’ expectations by 2.2%. Overall, it was a strong quarter as it also produced an impressive beat of analysts’ EPS estimates and a decent beat of analysts’ adjusted operating income estimates.\n\nThe stock is up 6.9% since reporting and currently trades at $115.36.\n\nRead our full, actionable report on Post here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 915,
    "summary": "As the Q3 earnings season comes to a close, it’s time to take stock of this quarter’s best and worst performers in the shelf-stable food industry, including Hain Celestial (NASDAQ:HAIN) and its peers.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "8b594ea9-9500-48a4-8d06-31431c31b77a",
    "url": "https://finance.yahoo.com/news/industrial-packaging-q3-earnings-international-090822582.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Industrial Packaging Q3 Earnings: International Paper (NYSE:IP) is the Best in the Biz",
    "authors": [
      "Max Juang   Fri, Jan 3, 2025, 3:08 AM 4 min read"
    ],
    "publish_date": "2025-01-03T09:08:22.000Z",
    "extraction_date": "2025-03-10T16:54:33.120878",
    "text": "Let’s dig into the relative performance of International Paper (NYSE:IP) and its peers as we unravel the now-completed Q3 industrial packaging earnings season.\n\nIndustrial packaging companies have built competitive advantages from economies of scale that lead to advantaged purchasing and capital investments that are difficult and expensive to replicate. Recently, eco-friendly packaging and conservation are driving customers preferences and innovation. For example, plastic is not as desirable a material as it once was. Despite being integral to consumer goods ranging from beer to toothpaste to laundry detergent, these companies are still at the whim of the macro, especially consumer health and consumer willingness to spend.\n\nThe 9 industrial packaging stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nAmidst this news, share prices of the companies have had a rough stretch. On average, they are down 6% since the latest earnings results.\n\nEstablished in 1898, International Paper (NYSE:IP) produces containerboard, pulp, paper, and materials used in packaging and printing applications.\n\nInternational Paper reported revenues of $4.69 billion, up 1.6% year on year. This print was in line with analysts’ expectations, and overall, it was an exceptional quarter for the company with an impressive beat of analysts’ EPS and EBITDA estimates.\n\n\"Our third quarter earnings are above our outlook,\" said Chairman and CEO Andy Silvernail.\n\nInterestingly, the stock is up 8.4% since reporting and currently trades at $53.16.\n\nIs now the time to buy International Paper? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1959, Packaging Corporation of America (NYSE: PKG) produces containerboard and corrugated packaging products, also offering displays and protective packaging solutions.\n\nPackaging Corporation of America reported revenues of $2.18 billion, up 12.7% year on year, outperforming analysts’ expectations by 4.4%. The business had an exceptional quarter with a solid beat of analysts’ sales volume estimates and an impressive beat of analysts’ adjusted operating income estimates.\n\nPackaging Corporation of America scored the biggest analyst estimates beat and fastest revenue growth among its peers. The market seems content with the results as the stock is up 4% since reporting. It currently trades at $225.21.\n\nIs now the time to buy Packaging Corporation of America? Access our full analysis of the earnings results here, it’s free.\n\nEstablished in 1987, Silgan Holdings (NYSE:SLGN) is a supplier of rigid packaging for consumer goods products, specializing in metal containers, closures, and plastic packaging.\n\nSilgan Holdings reported revenues of $1.75 billion, down 3.2% year on year, falling short of analysts’ expectations by 4.6%. It was a disappointing quarter as it posted a significant miss of analysts’ adjusted operating income estimates.\n\nSilgan Holdings delivered the weakest performance against analyst estimates in the group. The stock is flat since the results and currently trades at $51.05.\n\nRead our full analysis of Silgan Holdings’s results here.\n\nFounded in 1960, Sealed Air Corporation (NYSE: SEE) specializes in the development and production of protective and food packaging solutions, serving a variety of industries.\n\nSealed Air reported revenues of $1.35 billion, down 2.7% year on year. This print met analysts’ expectations. It was a strong quarter as it also produced a solid beat of analysts’ adjusted operating income estimates and an impressive beat of analysts’ EPS estimates.\n\nThe stock is down 10.2% since reporting and currently trades at $33.29.\n\nRead our full, actionable report on Sealed Air here, it’s free.\n\nFormerly Crown Cork & Seal, Crown Holdings (NYSE:CCK) produces packaging products for consumer marketing companies, including food, beverage, household, and industrial products.\n\nCrown Holdings reported revenues of $3.07 billion, flat year on year. This number was in line with analysts’ expectations. Overall, it was a strong quarter as it also logged a solid beat of analysts’ adjusted operating income estimates and full-year EPS guidance exceeding analysts’ expectations.\n\nThe stock is down 13.5% since reporting and currently trades at $81.21.\n\nRead our full, actionable report on Crown Holdings here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Top 6 Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 841,
    "summary": "Let’s dig into the relative performance of International Paper (NYSE:IP) and its peers as we unravel the now-completed Q3 industrial packaging earnings season.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "7cee99d9-d965-4f56-8d65-1130610b6957",
    "url": "https://finance.yahoo.com/news/specialty-equipment-distributors-stocks-q3-090757503.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Specialty Equipment Distributors Stocks Q3 Earnings: Richardson Electronics (NASDAQ:RELL) Best of the Bunch",
    "authors": [
      "Max Juang   Fri, Jan 3, 2025, 3:07 AM 5 min read"
    ],
    "publish_date": "2025-01-03T09:07:57.000Z",
    "extraction_date": "2025-03-10T16:54:35.299889",
    "text": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how specialty equipment distributors stocks fared in Q3, starting with Richardson Electronics (NASDAQ:RELL).\n\nHistorically, specialty equipment distributors have boasted deep selection and expertise in sometimes narrow areas like single-use packaging or unique lighting equipment. Additionally, the industry has evolved to include more automated industrial equipment and machinery over the last decade, driving efficiencies and enabling valuable data collection. Specialty equipment distributors whose offerings keep up with these trends can take share in a still-fragmented market, but like the broader industrials sector, this space is at the whim of economic cycles that impact the capital spending and manufacturing propelling industry volumes.\n\nThe 10 specialty equipment distributors stocks we track reported a slower Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nWhile some specialty equipment distributors stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.8% since the latest earnings results.\n\nFounded in 1947, Richardson Electronics (NASDAQ:RELL) is a distributor of power grid and microwave tubes as well as consumables related to those products.\n\nRichardson Electronics reported revenues of $53.73 million, up 2.2% year on year. This print exceeded analysts’ expectations by 8.7%. Overall, it was an incredible quarter for the company with a solid beat of analysts’ EPS estimates and an impressive beat of analysts’ EBITDA estimates.\n\n“Our first quarter results are encouraging and benefited from the strategies underway to drive sales growth, improve profitability, and generate positive operating cash flow,” said Edward J. Richardson, Chairman, CEO, and President.\n\nRichardson Electronics scored the biggest analyst estimates beat of the whole group. Unsurprisingly, the stock is up 10.8% since reporting and currently trades at $14.28.\n\nIs now the time to buy Richardson Electronics? Access our full analysis of the earnings results here, it’s free.\n\nFormerly a subsidiary of Hertz Corporation and with a logo that still bears some similarities to its former parent, Herc Holdings (NYSE:HRI) provides equipment rental and related services to a wide range of industries.\n\nHerc reported revenues of $965 million, up 6.3% year on year, outperforming analysts’ expectations by 3.6%. The business had a strong quarter with an impressive beat of analysts’ Equipment rentals revenue estimates and full-year EBITDA guidance slightly topping analysts’ expectations.\n\nThe market seems happy with the results as the stock is up 10.5% since reporting. It currently trades at $187.\n\nIs now the time to buy Herc? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1984, Alta Equipment Group (NYSE:ALTG) is a provider of industrial and construction equipment and services across the Midwest and Northeast United States.\n\nAlta reported revenues of $448.8 million, down 3.7% year on year, falling short of analysts’ expectations by 6.5%. It was a disappointing quarter as it posted and a significant miss of analysts’ adjusted operating income estimates.\n\nAlta delivered the weakest performance against analyst estimates in the group. As expected, the stock is down 18.4% since the results and currently trades at $6.55.\n\nRead our full analysis of Alta’s results here.\n\nFounded in 1980, Titan Machinery (NASDAQ:TITN) is a distributor of agricultural and construction equipment across the United States and Europe.\n\nTitan Machinery reported revenues of $679.8 million, down 2.1% year on year. This number surpassed analysts’ expectations by 0.7%. It was a strong quarter as it also logged a solid beat of analysts’ EBITDA and EPS estimates.\n\nThe stock is down 10.1% since reporting and currently trades at $13.85.\n\nRead our full, actionable report on Titan Machinery here, it’s free.\n\nInspired by a family gas station, Custom Truck One Source (NYSE:CTOS) is a distributor of trucks and heavy equipment.\n\nCustom Truck One Source reported revenues of $447.2 million, up 3% year on year. This result met analysts’ expectations. However, it was a softer quarter as it logged a significant miss of analysts’ adjusted operating income estimates.\n\nCustom Truck One Source pulled off the highest full-year guidance raise among its peers. The stock is up 21.6% since reporting and currently trades at $4.84.\n\nRead our full, actionable report on Custom Truck One Source here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our 9 Best Market-Beating Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 894,
    "summary": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how specialty equipment distributors stocks fared in Q3, starting with Richardson Electronics (NASDAQ:RELL).",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "71362679-4055-49e5-b3c8-e3b99f556cd0",
    "url": "https://finance.yahoo.com/news/lowes-low-buy-sell-hold-090711107.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Lowe's (LOW): Buy, Sell, or Hold Post Q3 Earnings?",
    "authors": [
      "Adam Hejl   Fri, Jan 3, 2025, 3:07 AM 3 min read"
    ],
    "publish_date": "2025-01-03T09:07:11.000Z",
    "extraction_date": "2025-03-10T16:54:37.332391",
    "text": "Lowe’s 16.7% return over the past six months has outpaced the S&P 500 by 10.4%, and its stock price has climbed to $248.99 per share. This performance may have investors wondering how to approach the situation.\n\nIs now the time to buy Lowe's, or should you be careful about including it in your portfolio? Get the full breakdown from our expert analysts, it’s free.\n\nDespite the momentum, we're swiping left on Lowe's for now. Here are three reasons why we avoid LOW and a stock we'd rather own.\n\nFounded in North Carolina as Lowe's North Wilkesboro Hardware, the company is a home improvement retailer that sells everything from paint to tools to building materials.\n\nA company’s long-term sales performance signals its overall quality. Even a bad business can shine for one or two quarters, but a top-tier one grows for years. Unfortunately, Lowe’s 3.1% annualized revenue growth over the last five years was sluggish. This fell short of our benchmark for the consumer retail sector.\n\nA retailer’s store count often determines how much revenue it can generate.\n\nLowe's operated 1,747 locations in the latest quarter. Over the last two years, the company has generally closed its stores, averaging 5.7% annual declines.\n\nWhen a retailer shutters stores, it usually means that brick-and-mortar demand is less than supply, and it is responding by closing underperforming locations to improve profitability.\n\nSame-store sales is an industry measure of whether revenue is growing at existing stores, and it is driven by customer visits (often called traffic) and the average spending per customer (ticket).\n\nLowe’s demand has been shrinking over the last two years as its same-store sales have averaged 3.9% annual declines.\n\nLowe’s business quality ultimately falls short of our standards. With its shares topping the market in recent months, the stock trades at 20.1× forward price-to-earnings (or $248.99 per share). At this valuation, there’s a lot of good news priced in - we think there are better stocks to buy right now. We’d recommend looking at CrowdStrike, the most entrenched endpoint security platform.\n\nThe Trump trade may have passed, but rates are still dropping and inflation is still cooling. Opportunities are ripe for those ready to act - and we’re here to help you pick them.\n\nGet started by checking out our Top 9 Market-Beating Stocks. This is a curated list of our High Quality stocks that have generated a market-beating return of 175% over the last five years.\n\nStocks that made our list in 2019 include now familiar names such as Nvidia (+2,691% between September 2019 and September 2024) as well as under-the-radar businesses like United Rentals (+550% five-year return). Find your next big winner with StockStory today for free.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 447,
    "summary": "Lowe’s 16.7% return over the past six months has outpaced the S&P 500 by 10.4%, and its stock price has climbed to $248.99 per share. This performance may have investors wondering how to approach the situation.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/video/could-drive-consumer-spending-2025-214717345.html",
    "provided_title": "This is what could drive consumer spending in 2025",
    "error": "Skipping video URL",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/video/wall-street-strategists-2025-years-170000264.html",
    "provided_title": "Wall Street strategists' 2025 New Year's resolutions for investors",
    "error": "Skipping video URL",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/video/markets-more-room-run-2025-221349316.html",
    "provided_title": "Markets have 'more room to run' in 2025: Strategist",
    "error": "Skipping video URL",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/video/magnificent-7-keep-dominating-2025-171331442.html",
    "provided_title": "Can the Magnificent 7 keep dominating in 2025?",
    "error": "Skipping video URL",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "4284befa-b3a8-49a0-af9c-bc472d55a3fd",
    "url": "https://finance.yahoo.com/news/minimum-wage-just-went-up-in-these-21-states-133030468.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Minimum wage just went up in these 21 states",
    "authors": [
      "Adriana Belmonte    · Senior Distribution Editor  Sat, Jan 4, 2025, 7:30 AM 2 min read"
    ],
    "publish_date": "2025-01-04T13:30:30.000Z",
    "extraction_date": "2025-03-10T16:54:45.427492",
    "text": "Workers across 21 states welcomed the new year by seeing their hourly minimum wages rise.\n\nThe federal minimum wage is $7.25 an hour, a rate that has remained unchanged since July 2009. During his presidential campaign, President Biden pledged to raise the federal minimum wage to $15 an hour, though that promise never came to fruition.\n\nIn the meantime, states have taken measures into their own hands over the past 15 years.\n\nStarting Jan. 1, 2025, three states — Delaware, Illinois, and Rhode Island — joined the group of states with a $15 minimum wage, thanks to ballot initiatives approved by voters and later signed into law by their legislators.\n\nResidents of Nebraska and Missouri also approved ballot measures that bumped up their minimum wages by over $1.00/hour to $13.50 and $13.75, respectively.\n\nThe other states with minimum wage increases put into effect by their own residents were New York, which now has a $15.50 hourly rate — $16.50 for those working in New York City, Long Island, and Westchester County — and Michigan at $10.56.\n\nIncoming President Trump did not commit to raising the minimum wage on a federal level but did signal a willingness to consider it further.\n\n“I’d want to speak to the governors,” Trump told NBC News. “And the other thing that is very complicated about minimum wage is places are so different. Mississippi and Alabama and great places are very different than New York or California, I mean in terms of the cost of living and other things. So it would be nice to have just a minimum wage for the whole country, but it wouldn’t work because you have places ... where a minimum wage which is at $8 or $9 ... might have very little effect because the cost of living in certain places is really low.”\n\nThere are 20 states, along with the District of Columbia, that adjust their minimum wage on an annual basis according to inflation, though the effective dates are often mid-year rather than at the start of the year.\n\nAlabama, Georgia, Louisiana, Mississippi, South Carolina, Tennessee, and Wyoming are the only seven states that either have no minimum wage law on a state level or have one below the federal minimum.\n\n—\n\nAdriana Belmonte is a reporter and editor covering politics and healthcare policy for Yahoo Finance. You can follow her on X @adrianambells and reach her at adriana@yahoofinance.com.\n\nClick here for the latest economic news and indicators to help inform your investing decisions\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 426,
    "summary": "Workers across 21 states welcomed the new year by seeing their hourly minimum wages rise.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "2ec24711-f8a2-4dd9-ba2b-ecff45ff385f",
    "url": "https://finance.yahoo.com/news/listing-a-home-in-2025-here-are-the-designs-experts-say-buyers-want-124007332.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Listing a home in 2025? Here are the designs experts say buyers want.",
    "authors": [
      "Claire Boston    · Senior Reporter  Sat, Jan 4, 2025, 6:40 AM 3 min read"
    ],
    "publish_date": "2025-01-04T12:40:07.000Z",
    "extraction_date": "2025-03-10T16:54:47.487384",
    "text": "If you’re planning on listing your home this year, it’s time to think about getting cozy.\n\nMinimalist interiors with gray laminate flooring, shiny silver fixtures, and aggressively neutral paint colors that dominated interior design in the 2010s and early 2020s are no longer drawing in prospective home buyers.\n\nWhat’s working instead, real estate agents and home stagers say: warmer-toned hues, textured elements, and dollops of character like accent walls.\n\n“Buyers no longer really want that modern box that was so popular back in 2015 or 2016,” said Walter Franco Jr., a real estate agent in Los Angeles.\n\nRicci Taylor, owner of Atlanta-based staging and furniture leasing company Everly Design Co., said she’s noticed earthy shades of brown and accent colors like cinnamon and evergreen catching on with clients, along with more rounded furniture silhouettes and textured metals. After spending pandemic lockdowns cooped up in stark spaces, many buyers are now seeking designs that remind them of nature.\n\n“It’s all about that feng shui — bringing the outside in,” Taylor said. “I think you’re going to be seeing more bedrooms, offices, and accent walls being done with these warmer colors.”\n\nCase in point: Paint giant Pantone declared “Mocha Mousse” its 2025 color of the year. The shade is described as “a warming, brown hue imbued with richness” and “answering our desire for comfort.”\n\nJennifer Roberts, a real estate broker at Coldwell Banker Warburg in New York, said her clients are increasingly prioritizing calming, muted wall colors and subtle pops of color that make their homes feel like oases.\n\n“They want to walk into the apartment and shut out the world,” said Roberts, who does most of her business in Manhattan’s Upper East and Upper West Side neighborhoods.\n\nAnother shift: After years of open-concept floorplans dominating, she’s noticed more buyers once again seeking walls. In some cases, apartments with formal dining rooms are winning out over layouts with more casual options like kitchen islands.\n\n“They want distinct rooms,” Roberts said. “It provides more cozy spaces.”\n\nIf you do live in a minimalist box, however, there’s no reason to fear that your home will never sell. Whites and neutrals remain popular in living areas, and simple upgrades like swapping out light fixtures and painting cabinets can enhance a home’s look at a fraction of the cost of a gut renovation, Taylor said.\n\nHanny Jahns, founder and CEO of staging and interior design company Stageasily, said airy, open homes are still sought after in her Las Vegas market. There, many people are favoring modern designs with character, like the work of potter and designer Jonathan Adler, that can be \"a little bit fun and a little bit retro,\" she said.\n\nIn larger homes, she steers clients toward bigger furniture pieces from the likes of Restoration Hardware. But counterintuitively, those oversized pieces can also work in smaller spaces by making them look larger, she said.\n\nAmong buyers, neutral, natural color palettes aren't going anywhere, but she too is avoiding heavily gray looks for now.\n\n\"Gray is kind of becoming the new beige,\" she said. \"People are staying away from that.\"\n\nClaire Boston is a senior reporter for Yahoo Finance covering housing, mortgages, and home insurance.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 530,
    "summary": "The shiny silver fixtures and neutral paint colors that long dominated interior design are no longer drawing in prospective home buyers. What’s working instead: warmer-toned hues, textured elements, and dollops of character like accent walls.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "73893924-1e43-45c6-a027-57edd0db04e1",
    "url": "https://finance.yahoo.com/news/beer-and-alcohol-stocks-face-bigger-challenges-as-us-surgeon-general-links-drinking-to-cancer-risk-202756782.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Beer and alcohol stocks face bigger challenges as US surgeon general links drinking to cancer risk",
    "authors": [
      "Brooke DiPalma    · Senior Reporter Updated Mon, Jan 6, 2025, 4:56 AM 4 min read"
    ],
    "publish_date": "2025-01-06T10:56:44.000Z",
    "extraction_date": "2025-03-10T16:54:49.587418",
    "text": "Booze makers are getting an early hangover after the US surgeon general called for the addition of a warning label to alcoholic drinks.\n\nOn Friday, shares of beer and alcohol giants sank across the board. Diageo (DGE.L) is down 4% and Pernod Ricard (PER.HA) is down nearly 3%, while Molson Coors (TAP) and Anheuser-Busch InBev (BUD) are both down 2%. Brown-Forman (BF-B) and Constellation Brands (STZ) are down around 1% each.\n\nEarlier this morning, Surgeon General Vivek Murthy released a 20-plus-page advisory that linked the risk of cancer to drinking alcohol and called for adding a warning label to beer, wine, and spirits like those on cigarette packs.\n\nAs of now, South Korea requires a cancer-specific label on alcohol, while Ireland signed a new law to do so starting in 2026, per Murthy.\n\nAccording to the advisory, nearly 100,000 US cancer cases and 20,000 cancer deaths have been linked to alcohol consumption each year. It noted seven types of cancer were linked, including breast, liver, and colon cancer.\n\nYahoo Finance reached out to Molson Coors, Anheuser-Busch, and Constellation Brands for comment, but did not hear back.\n\nWith President-elect Donald Trump's administration set to take office in 17 days, the true impact of this advisory is up in the air.\n\n\"We're in the middle of changing administrations ... it's unclear how much leg there is to this into the new administration,\" S&P Ratings analyst Christopher Johnson told Yahoo Finance over the phone.\n\n\"If you actually end up with ... warning labels on the products, then that could have a more lasting impact on the growth outlook for the products.\"\n\nJohnson said a drop in alcohol consumption due to health risks is not at the same level as cigarette consumption, which has an \"industrywide view of volume declines.\"\n\n\"We're not there yet in terms of thinking about some kind of structural pressure on [alcohol] volumes related to health risk concerns,\" added Johnson. His team is also looking out for any attempt by the government to curb consumption with taxation (there have been no hints of new taxes so far).\n\n\"When those types of taxes do hit products ... there tends to be a one-time negative impact that then gets lapped and the consumer gets used to the new price point,\" he said.\n\nBump Williams of Bump Williams Consulting expects \"business goes on as usual\" following the news.\n\n\"From the manufacturing side, distributors have already diversified their portfolio well beyond just servicing the Beverage-Alcohol business and the Retailers will simply do as [they're] instructed to do by the law and regulations required in packaging,\" he told Yahoo Finance in an email.\n\nThe advisory is throwing a wrench in an already struggling sector. Challenges up against the industry include a decline in overall US consumption and premium-priced alcoholic beverages under pressure due to weaker consumer discretionary income, Johnson said.\n\nWilliams is also keeping an eye on potential tariffs under Trump that may cause price hikes.\n\nAll six of the alcohol companies mentioned above clocked negative stock performance in the past year, while the S&P 500 jumped 26%. Brown-Forman and Pernod Ricard led the losses with 34% and 31% drops, respectively.\n\nAccording to a Gallop Poll, nearly 60% of US adults say they have an occasion to drink alcohol, down from the historical trend of 63%, which dates back to 1939. A drop in consumption compared to 2022 has weighed on revenue growth, per Statista Market Insights, though overall revenue is up due partially to higher prices and inflation.\n\nMeanwhile, nonalcoholic beverages have been on the rise.\n\n\"Those factors continue to be much more relevant to our outlook for the sector right now than what the news that came out today might have on further pressure on volumes,\" Johnson said, adding that younger generations are \"already consuming less alcohol.\"\n\nSuntory CEO Takeshi Niinami, whose company is behind brands like Jim Bean and various Japanese whiskeys, said the business has to educate consumers that drinking in moderation is key.\n\n\"Heavy drinking is so bad, we have to talk about that,\" Niinami told Yahoo Finance's Opening Bid (listen in above). \"moderate drinking is good for you ... you can feel good and bond with your friends ... we have to demonstrate that we are contributing [to] society,\" he said.\n\n—\n\nBrooke DiPalma is a senior reporter for Yahoo Finance. Follow her on Twitter at @BrookeDiPalma or email her at bdipalma@yahoofinance.com.\n\nClick here for all of the latest retail stock news and events to better inform your investing strategy",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 751,
    "summary": "Surgeon General Vivek Murthy's link of alcohol to cancer risks spills over into Friday's trading session.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "debd98f7-42b2-48cd-ac3d-883ffe3960e9",
    "url": "https://finance.yahoo.com/news/mike-johnson-reelected-as-house-speaker-after-a-new-promise-to-work-with-musks-doge-201052316.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Mike Johnson reelected as House speaker after a new promise to work with Musk's 'DOGE'",
    "authors": [
      "Ben Werschkul    · Washington Correspondent Updated Fri, Jan 3, 2025, 2:59 PM 5 min read"
    ],
    "publish_date": "2025-01-03T20:59:03.000Z",
    "extraction_date": "2025-03-10T16:54:51.622248",
    "text": "Mike Johnson was able to keep his spot atop the US House on Friday while seeming to offer minimal binding concessions to hard-right Republicans who had threatened his path to re-election.\n\nWhat Johnson did offer — in an announcement made just before the vote — was a promise to \"make meaningful spending reforms to eliminate trillions in waste, fraud, and abuse, and end the weaponization of government.\"\n\nIt is a new effort that Johnson says will also include the formation of a new working group of independent experts set to work directly with Elon Musk’s extra-governmental \"Department of Government Efficiency\" (DOGE).\n\nIt’s unclear what powers this new working group will have beyond publicizing its findings, but the promise clearly helped put Johnson over the top as the opposition to him slowly dwindled on Friday afternoon.\n\nJohnson was able to prevail in a narrow tally, gaining a bare majority of 218 votes. Hakeem Jeffries of New York was the Democratic choice and gained 215 votes.\n\nAs expected, a Kentucky Republican named Thomas Massie opposed Johnson and voted for Rep. Tom Emmer.\n\nThe proceedings saw moments of last-minute drama when Republicans Ralph Norman of South Carolina and Keith Self of Texas also initially voted for other candidates but then switched their votes after some arm-twisting behind closed doors.\n\nRep. Self told CNN afterward that he switched his vote after being promised concessions to allow House Freedom caucus members to be part of the process to negotiate some of the major bills in the months ahead.\n\nJohnson pledged as the day began that \"I don't make deals with anyone.\"\n\n\"I don't do anything in exchange for a vote other than commit to make this institution work as effectively and efficiently as possible,\" he told reporters as he entered the Capitol Friday.\n\nThe back-and-forth this week ended (for now at least) fears that Johnson would have to offer deep concessions on a range of issues to his right flank in order to maintain power.\n\nSome of the proposed changes might have made it harder for the Republicans to pass legislation in the coming weeks on a range of topics from the border to energy to taxes, as well as the coming debt ceiling deadline.\n\n“It certainly gives us hope and helps allay some fears we had,” offered analyst Ahmed Riesgo, Insigneo’s chief investment officer, in a live Yahoo Finance appearance shortly after the vote.\n\nBut others were more sanguine. Brian Gardner, Stifel’s chief Washington policy strategist, focused on the dissension and noted that some of the chaos \"is a signal about how difficult it is going to be for Republicans to be going forward.\"\n\nHe added that “investors overestimate how much power Republicans have up on Capitol Hill, especially in the House.”\n\nFriday’s vote came after a bumpy week where the dissatisfaction among many of Johnson’s colleagues was evident, a feeling that manifested in a wide array of ideas that could have given conservative Republicans more power in the coming Congress.\n\nOne of the key areas of contention was a 36-page House rules package that Johnson unveiled in recent days by saying its provisions were not up for debate.\n\nA key change in there actually solidifies Johnson by moving the threshold for opponents to oust him from a single member — a clause that former Rep. Matt Gaetz used to oust Kevin McCarthy — to nine members.\n\nAnother controversial change that Johnson was confronted with — but one he repeatedly parried away — was a push to appoint Rep. Chip Roy, a Texas Republican and leader of the hard-line group, as the chair of the powerful House Rules Committee.\n\nIn the end, Roy did not secure any public promise of the seat but voted for Johnson nonetheless.\n\nSuch a move would have undercut Johnson’s power as that committee — traditionally nicknamed the \"Speaker's committee\" — controls access to much of what is voted on on the House floor.\n\nIn his speech Friday after winning the gavel, Johnson said, “This is a momentous time in the history of our nation\" and spoke of the coming Congress's mission to be \"stewards\" of the American Revolution.\n\nJohnson’s quest was aided by Donald Trump. The president-elect endorsed Johnson earlier this week, made calls to lawmakers on his behalf, and then publicly congratulated him Friday afternoon — writing that \"Mike will be a Great Speaker, and our Country will be the beneficiary.\"\n\nThe immediate pressure for a conclusion to this issue came because the selection of a new speaker was needed before the House can take up official 2025 business, most pressingly certifying Trump’s election victory on Monday.\n\nThe issue that has dogged Johnson all week is that a small faction of House Republicans — whose importance was outsized given Johnson’s tight margins — remains upset about how Johnson has handled things like last month’s budget battle, where he ended up relying on Democrats’ votes in the face of GOP divisions.\n\nThe argument from Johnson and his allies all week has been that the realignment of power in Washington set for 2025 will make those issues moot, and that he is the best leader to shepherd through Trump’s agenda.\n\n\"No speaker is perfect, and no one will ever be,\" said Rep. Lisa McClain, the Michigan Republican, in her speech before formally nominating Johnson.\n\nShe added that the goal of the coming Congress is to “make progress” and enact President-elect Trump’s agenda.\n\nThis post has been updated with additional developments.\n\nBen Werschkul is Washington correspondent for Yahoo Finance.\n\nEvery Friday, Yahoo Finance's Rachelle Akuffo, Rick Newman, and Ben Werschkul bring you a unique look at how U.S. policy and government affects your bottom line on Capitol Gains. Watch or listen to Capitol Gains on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.\n\nClick here for political news related to business and money policies that will shape tomorrow's stock prices\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 991,
    "summary": "Mike Johnson was able to keep his spot atop the US House Friday while seeming to offer minimal binding concessions to hard-right Republicans who had threatened his path to reelection.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "87806551-9daf-4b0d-a006-3e1d3c29e825",
    "url": "https://finance.yahoo.com/news/rivian-stock-surges-to-start-the-year-on-better-than-expected-ev-deliveries-173904321.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Rivian stock surges to start the year on better-than-expected EV deliveries",
    "authors": [
      "Laura Bratton     Updated Fri, Jan 3, 2025, 3:29 PM 2 min read"
    ],
    "publish_date": "2025-01-03T21:29:24.000Z",
    "extraction_date": "2025-03-10T16:54:53.684721",
    "text": "Rivian (RIVN) stock jumped more than 24% Friday as the EV maker reported better-than-expected vehicle sales for its quarter ending Dec. 31.\n\nRivian said Friday that it delivered nearly 14,200 EVs during the fourth quarter, bringing its yearly sales volume to roughly 51,580 electric trucks — within the company's prior guidance. Wall Street analysts had expected the company to deliver closer to 13,400 EVs for the period and 51,000 for the year.\n\nRivian stock had a rough 2024. Shares ended the year down 40% from 2023 and nearly 90% from their all-time high above $100 in the company's high-profile market debut in 2021.\n\nAfter its blockbuster IPO three years ago, the Amazon-backed EV maker has faced a mountain of obstacles: First, it grappled with a shortage of necessary computer chips; then, there was a wider market shift away from electric cars just as competition from mainstay Tesla (TSLA) was heating up. The company has undergone a massive cost-cutting campaign, slashing its workforce in multiple rounds of layoffs starting as early as 2022 and redesigning car components to make production less expensive.\n\nEven with those efforts, Rivian’s operating losses mounted in the past year. In its third quarter last year, Rivian’s revenue fell for the first time since it went public, dropping 35% to $874 million versus the $980 million expected by analysts as the company faced yet another production disruption thanks to a miscommunication with a key supplier.\n\nRivian’s fourth quarter deliveries number released Friday “affirms that supply issues were isolated to Q3,” RBC Capital Markets analyst Tom Narayan wrote in a note to shareholders Friday. Narayan holds a Neutral rating on the stock and sees shares hovering around $12 over the next 12 months. The stock was trading above $16 Friday.\n\nMeanwhile, CFRA analyst Garrett Nelson maintained his Sell rating on Rivian shares, with a price target of just $8, noting Rivian’s “bottom-line losses are likely to continue for the foreseeable future.”\n\nRivian will report its full fourth quarter results on Feb. 20.\n\nLaura Bratton is a reporter for Yahoo Finance. Follow her on X @LauraBratton5.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 373,
    "summary": "Rivian stock soared Friday after the electric truck maker reported better than expected vehicle sales for its quarter ending Dec. 31.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "c81a9700-aa7a-4b79-b867-07ac137b1ddb",
    "url": "https://finance.yahoo.com/news/ford-sales-jumped-42-last-year-powered-by-f-series-trucks-170253457.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Ford sales jumped 4.2% last year, powered by F-Series trucks",
    "authors": [
      "Pras Subramanian    · Senior Reporter  Fri, Jan 3, 2025, 11:02 AM 2 min read"
    ],
    "publish_date": "2025-01-03T17:02:53.000Z",
    "extraction_date": "2025-03-10T16:54:55.768636",
    "text": "Ford (F) posted a strong fourth quarter US report, one that capped off a strong year for the Dearborn, Mich.-based automaker.\n\nFord said US sales in Q4 rose 8.8% versus a year ago, powered by F-Series sales that jumped 21.1% in the quarter. For the year, Ford reported a 4.2% jump in US sales, totaling approximately 2.079 million vehicles. Ford rival GM posted a 4% jump in 2024 sales, resulting in 2.7 million vehicles sold.\n\nFord shares were up around 1% in midday trade.\n\nF-Series trucks again shouldered the load for Ford, achieving the status of the No. 1 selling truck in America for the 48th straight year.\n\n“The Ford F-Series best illustrates the company’s Freedom of Choice strategy with gas, diesel, hybrid and electric models. All of these F-Series versions saw year-over-year sales growth in the final month of 2024,” the company said in a statement.\n\nFord’s “electrified” segment — or vehicles using both hybrid and fully electric powertrains — jumped 38% in 2024, hitting 285,291 units sold.\n\nFord hybrid sales were the majority of that total, hitting a record 187,426 — up 40% over 2023. Maverick hybrid pickup sales made up nearly one-third of that amount.\n\nFord said each of its EVs set new sales records last year, with Mustang Mach-E totaling 51,745 units sold (up 27%), F-150 Lightning sales hitting 33,510 (up 39%), and E-Transit sales climbing to 12,610 (up 64%).\n\nMustang Mach-E Q4 sales hit a best-ever 16,119 vehicles sold, which Ford said made it the second-best-selling electric SUV behind only Tesla’s Model Y.\n\nThe success of Ford EVs comes as the company continues to lose money in its EV division, having pushed back the opening of some EV factories and canceled upcoming EVs like a full-size three-row SUV.\n\nOn the Lincoln side, the luxury brand saw Q4 sales jump 35.4%, with 2024 sales climbing 28.1%. The Aviator (up 62.3% for the year) and much-hyped Nautilus (up 50.2%) powered the gains.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 369,
    "summary": "Ford posted a strong fourth quarter US report, one that capped off a strong year for the Dearborn, Mich.-based automaker.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "57738804-bad7-4565-afd9-7fb59b7b227c",
    "url": "https://finance.yahoo.com/news/nvidia-stock-jumps-leads-magnificent-7-gains-to-start-2025-after-end-of-year-tech-sell-off-154139053.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Nvidia stock jumps, leads 'Magnificent 7' gains to start 2025 after end-of-year tech sell-off",
    "authors": [
      "Laura Bratton     Updated Fri, Jan 3, 2025, 3:32 PM 3 min read"
    ],
    "publish_date": "2025-01-03T21:32:14.000Z",
    "extraction_date": "2025-03-10T16:54:57.900916",
    "text": "Nvidia stock (NVDA) led gains among the “Magnificent Seven” tech stocks to start the new year after a group-wide sell-off in the last days of 2024. Shares of the AI chipmaker rose 4.5% Friday after gaining roughly 3% the prior day.\n\nThat upswing followed a 4% dip between Christmas Eve and New Year’s Eve as megacap tech stocks dropped across the board in the absence of a “Santa Claus\" rally, where the stock market typically enjoys a surge between Dec. 24 and Jan. 2. Tesla (TSLA) stock plunged nearly 13% over that time frame, while Amazon (AMZN) and Microsoft (MSFT) dropped more than 4%. Meanwhile, Meta (META) and Google (GOOG) fell just under 4%, and Apple (AAPL) dropped 3%.\n\nEven with its December decline, Nvidia shares still ended 2024 up more than 150%. Wall Street analysts have remained bullish on the stock, estimating shares will rise to roughly $173 over the next year from their current level of $138, according to Yahoo Finance data.\n\nBank of America’s Vivek Arya told Brian Sozzi on the Opening Bid podcast Thursday that broader market forces and company-specific issues drove the sell-off in Nvidia stock late last year.\n\n\"What we have seen in the market is a rotation of money from semiconductors to software,\" Arya said, noting that the latter was less exposed to US trade restrictions on goods to and from China. He added that for Nvidia, \"the last two quarters have not been clean, really, because they're going through growing pains from one generation of product that was Hopper to the new generation of product.\"\n\nArya was referring to concerns surrounding delays in shipments of the company's new Blackwell artificial intelligence chips.\n\n\"In our view, these are short-term issues,\" he said. That could create a buying opportunity: While its Magnificent Seven peers are trading at two times their average earnings growth estimates for 2025, Arya noted that Nvidia shares are trading at less than one times the consensus earnings growth for the company this upcoming year.\n\nArya has a Buy rating on Nvidia stock and sees shares rising to $190 over the next 12 months.\n\nShares of Nvidia and its Magnificent Seven peers have benefited from investors' massive bets on artificial intelligence, as well as earnings growth. As Yahoo Finance's Josh Schafer reported, through roughly three-quarters of reports, the combination of Apple, Alphabet, Microsoft, Amazon, Meta, Tesla, and Nvidia grew earnings year over year by 33% in 2024, compared to just 4.2% growth for the other 493 S&P 500 companies, per FactSet data.\n\nTo be sure, skeptics warn of a bubble that could burst and send AI-fueled stocks tumbling if hype over the new technology fades and Big Tech's spending on artificial intelligence infrastructure wanes. Wall Street analysts overall remain convinced the AI enthusiasm will continue, however.\n\nTesla also notched a notable gain Friday, jumping more than 8%. Alphabet, Microsoft, and Meta rose around 1%, while Amazon spiked nearly 2%. Apple shares were roughly flat.\n\nLaura Bratton is a reporter for Yahoo Finance. Follow her on X @LauraBratton5.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 532,
    "summary": "Nvidia stock led the so-called “Magnificent 7” tech stocks higher to start the year after a group-wide selloff in the last days of 2024.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "b281b2f8-6ed2-40a2-8a0e-12497aa2019b",
    "url": "https://finance.yahoo.com/news/biden-blocks-us-steels-14-billion-sale-to-japanese-giant-nippon-steel-145927959.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Biden blocks US Steel's $14 billion sale to Japanese giant Nippon Steel",
    "authors": [
      "Jennifer Schonberger    · Senior Reporter Updated Fri, Jan 3, 2025, 10:10 AM 3 min read"
    ],
    "publish_date": "2025-01-03T16:10:41.000Z",
    "extraction_date": "2025-03-10T16:54:59.929394",
    "text": "President Joe Biden on Friday blocked US Steel’s (X) $14 billion sale to Japanese giant Nippon Steel on national security concerns, creating new uncertainty for an iconic American steelmaker.\n\n\"This acquisition would place one of America’s largest steel producers under foreign control and create risk for our national security and our critical supply chains,\" President Biden said in a statement.\n\nThe stock of Pittsburgh-based US Steel dropped more than 7% in morning trading.\n\nUS Steel and Nippon in a joint statement suggested they would now pursue legal action following Biden's order, which they said did not \"present any credible evidence of a national security issue, making it clear this was a political decision.\"\n\n\"We are left with no choice but to take all appropriate action to protect our legal rights,\" the companies said in their statement, which argued that Biden's move sent \"a chilling message to any company based in a U.S. allied country contemplating significant investment in the United States.\"\n\nThe 124-year-old US Steel spent much of 2024 lobbying the Biden administration to approve the tie-up, which would have allowed the world’s fourth-largest steelmaker an entry into the US market.\n\nThe Japanese buyer committed to keep the US Steel name and Pittsburgh headquarters, but it couldn’t overcome concerns about the potential effect on union workers, domestic supply chains, and US national security.\n\nThe United Steelworkers union staunchly opposed the deal, arguing it would be bad for steelworkers and harm America's ability to produce steel.\n\nBiden sided with that view in the latest example of a protectionist tilt in Washington from both parties.\n\n\"We need major US companies representing the major share of US steelmaking capacity to keep leading the fight on behalf of America’s national interests,\" Biden said Friday.\n\nBiden was public about his opposition to the deal last year while he was still running for president. President-elect Donald Trump also opposed the acquisition and also vowed to block the deal.\n\nThe Committee on Foreign Investment in the United States (CFIUS), a federal interagency panel, spent months reviewing the acquisition for national security risks and was reportedly unable to reach a consensus before sending a report about the matter to Biden.\n\nIn his new executive order issued Friday, Biden is requiring the companies to abandon the deal in 30 days unless the date is extended by CFIUS.\n\nIt’s unclear if US Steel would look to find a new buyer.\n\n\"It's been a highly politicized process,\" Josh Spoores, CRU North American steel analyst, told Yahoo Finance.\n\nUS Steel and Nippon on Friday repeated the commitments they had made previously, including new investments in US Steel plants and ensuring that key directors and executives would be US citizens.\n\n\"The record before CFIUS is abundantly clear that this transaction, with the commitments made by Nippon Steel, would strengthen, not weaken, national security\" the companies said in their joint statement.\n\n\"Yet, it is clear that the CFIUS process was deeply corrupted by politics, and the outcome was pre-determined, without an investigation on the merits, but to satisfy the political objectives of the Biden White House.\"\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 538,
    "summary": "President Joe Biden on Friday blocked US Steel’s $14 billion sale to Japanese giant Nippon Steel on national security concerns, creating new uncertainty for an iconic American steelmaker.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "75d0621b-a7f8-46ce-953a-2ff817cbc693",
    "url": "https://finance.yahoo.com/news/musk-standing-way-bezos-reaches-180904582.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Commentary: Elon Musk is standing in the way as Jeff Bezos reaches for orbit",
    "authors": [
      "Richard Waters  Updated Sat, Jan 4, 2025, 10:19 AM 4 min read"
    ],
    "publish_date": "2025-01-04T16:19:33.000Z",
    "extraction_date": "2025-03-10T16:55:01.993023",
    "text": "The first attempt by Jeff Bezos’s private space company, Blue Origin, to launch a rocket into orbit will be a seminal moment for the space",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 25,
    "summary": "The first attempt by Jeff Bezos’s private space company, Blue Origin, to launch a rocket into orbit will be a seminal moment for the space business.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "ebd01cb3-7834-471b-b9d7-1e7c41c54782",
    "url": "https://finance.yahoo.com/news/don-t-blame-car-sharing-230024502.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Don’t Blame Car-Sharing Site Turo for Vehicle Attacks",
    "authors": [
      "The Information   Fri, Jan 3, 2025, 5:00 PM 5 min read"
    ],
    "publish_date": "2025-01-03T23:00:24.000Z",
    "extraction_date": "2025-03-10T16:55:04.156867",
    "text": "Why you shouldn’t blame car-sharing company Turo for the New Year’s Day attacks. Plus, The Information’s stories of the week.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 20,
    "summary": "Why you shouldn’t blame car-sharing company Turo for the New Year’s Day attacks. Plus, The Information’s stories of the week.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "57b85883-0667-43b8-809a-3b48b735b881",
    "url": "https://finance.yahoo.com/news/top-tiktok-north-american-ad-210315537.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Top TikTok North American Ad Sales Exec to Depart",
    "authors": [
      "The Information   Fri, Jan 3, 2025, 3:03 PM 1 min read"
    ],
    "publish_date": "2025-01-03T21:03:15.000Z",
    "extraction_date": "2025-03-10T16:55:06.222562",
    "text": "Sameer Singh, who oversaw ad sales for North America at TikTok, is departing as TikTok braces for a hearing at the U.S. Supreme Court on",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 25,
    "summary": "Sameer Singh, who oversaw ad sales for North America at TikTok, is departing as TikTok braces for a hearing at the U.S. Supreme Court on Jan. 10.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "d608ab91-8c44-4d26-a2fb-c14e6c905856",
    "url": "https://finance.yahoo.com/news/equities-rise-markets-assess-manufacturing-214829588.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Equities Rise as Markets Assess Manufacturing Data, Fed Official's Comments",
    "authors": [
      "MT Newswires   Fri, Jan 3, 2025, 3:48 PM 2 min read"
    ],
    "publish_date": "2025-01-03T21:48:29.000Z",
    "extraction_date": "2025-03-10T16:55:08.313956",
    "text": "US benchmark equity indexes rose Friday as traders parsed the latest manufacturing sector data and r",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 16,
    "summary": "US benchmark equity indexes rose Friday as traders parsed the latest manufacturing sector data and r",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "f706d210-c0e4-4a4f-894e-af39c9fcab96",
    "url": "https://finance.yahoo.com/news/oil-rig-count-falls-1-204016578.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Oil Rig Count Falls by 1; Crude Price Headed for 2nd Straight Weekly Gain",
    "authors": [
      "MT Newswires   Fri, Jan 3, 2025, 2:40 PM 1 min read"
    ],
    "publish_date": "2025-01-03T20:40:16.000Z",
    "extraction_date": "2025-03-10T16:55:10.429392",
    "text": "The number of oil rigs in the US decreased by one during the week ended Friday, according to data co",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 20,
    "summary": "The number of oil rigs in the US decreased by one during the week ended Friday, according to data co",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "72d5b571-8295-4be1-9f15-2b8f54f09704",
    "url": "https://finance.yahoo.com/news/ford-gm-log-gains-2024-200446358.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Ford, GM Log Gains in 2024 US Vehicle Sales",
    "authors": [
      "MT Newswires   Fri, Jan 3, 2025, 2:04 PM 2 min read"
    ],
    "publish_date": "2025-01-03T20:04:46.000Z",
    "extraction_date": "2025-03-10T16:55:12.489382",
    "text": "Ford Motor (F) and General Motors (GM) on Friday reported year-over-year gains in 2024 and fourth-qu",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 16,
    "summary": "Ford Motor (F) and General Motors (GM) on Friday reported year-over-year gains in 2024 and fourth-qu",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "f38ca0a6-ee8c-4112-ab56-e2b7efd663bf",
    "url": "https://finance.yahoo.com/news/equities-rise-intraday-traders-parse-183512208.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Equities Rise Intraday as Traders Parse Manufacturing Data, Fed Official's Comments",
    "authors": [
      "MT Newswires   Fri, Jan 3, 2025, 12:35 PM 2 min read"
    ],
    "publish_date": "2025-01-03T18:35:12.000Z",
    "extraction_date": "2025-03-10T16:55:14.752148",
    "text": "US benchmark equity indexes were higher intraday as markets analyzed the latest manufacturing sector",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 14,
    "summary": "US benchmark equity indexes were higher intraday as markets analyzed the latest manufacturing sector",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "2a56d7a5-2bb5-43e7-ba8a-828717f3c1ad",
    "url": "https://finance.yahoo.com/news/economic-outlook-2025-positive-inflation-181825982.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Economic Outlook for 2025 Positive But Inflation Risks Persist, Richmond Fed's Barkin Says",
    "authors": [
      "MT Newswires   Fri, Jan 3, 2025, 12:18 PM 2 min read"
    ],
    "publish_date": "2025-01-03T18:18:25.000Z",
    "extraction_date": "2025-03-10T16:55:16.805862",
    "text": "Richmond Fed President Tom Barkin said Friday that his 2025 baseline expectation for the US economy",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 16,
    "summary": "Richmond Fed President Tom Barkin said Friday that his 2025 baseline expectation for the US economy",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/mortgage-brokers-made-rate-hikes-070000566.html",
    "provided_title": "Mortgage Brokers Made Rate Hikes More Painful, Says Bank of England",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/mortgage-brokers-made-rate-hikes-070000566.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "e008a84a-b2c0-473a-aca2-809a986e2a4a",
    "url": "https://finance.yahoo.com/news/us-30-fixed-rate-mortgage-173752445.html",
    "original_title": "Yahoo Finance",
    "provided_title": "US 30-year fixed-rate mortgage flirts with 7%",
    "authors": [
      "Reuters   Thu, Jan 2, 2025, 11:37 AM 1 min read"
    ],
    "publish_date": "2025-01-02T17:37:52.000Z",
    "extraction_date": "2025-03-10T16:55:20.723146",
    "text": "WASHINGTON (Reuters) - U.S. mortgage rates jumped to a six-month high this week, suggesting that a recent improvement in home sales could be temporary.\n\nThe average rate on the popular 30-year fixed-rate mortgage increased to 6.91%, the highest level since early July, from 6.85% last week, mortgage finance agency Freddie Mac said on Thursday. It averaged 6.62% during the same period a year ago.\n\n\"Compared to this time last year, rates are elevated and the market's affordability headwinds persist,\" said Sam Khater, Freddie Mac’s Chief Economist.\n\nMortgage rates have trended higher despite the Federal Reserve cutting interest rates three times since starting its monetary policy easing cycle in September.\n\nThey have risen in tandem with U.S. Treasury yields amid a resilient economy and investor fears that President-elect Donald Trump's proposed policies, including tax cuts, higher tariffs on imported goods and mass deportations, could reignite inflation.\n\nMortgage rates track the 10-year Treasury note. Sales of previously owned homes surged to an eight-month high in November, mostly reflecting contracts signed in October and possibly September when mortgage rates were mostly lower.\n\nSales could still rise in December after contracts increased to a 21-month high in November. Increased supply is pulling more buyers into the market, but rising mortgage rates could discourage some homeowners from putting their houses on the market, especially if they would need to buy another home.\n\nMany homeowners have mortgages below 5%. The so-called rate-lock effect could mean fewer homes being listed, reducing inventory and pushing up prices.\n\nThis would combine with rising mortgage rates to reduce affordability for many prospective buyers.\n\n(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama)",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 271,
    "summary": "U.S. mortgage rates jumped to a six-month high this week, suggesting that a recent improvement in home sales could be temporary.  The average rate on the popular 30-year fixed-rate mortgage increased to 6.91%, the highest level since early July, from 6.85% last week, mortgage finance agency Freddie Mac said on Thursday.  \"Compared to this time last year, rates are elevated and the market's affordability headwinds persist,\" said Sam Khater, Freddie Mac’s Chief Economist.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "900750db-9623-4712-9d52-cab55e6b0764",
    "url": "https://finance.yahoo.com/news/average-rate-30-u-mortgage-171537608.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Average rate on a 30-year U.S. mortgage hits 6.91%, according to Freddie Mac, the highest since July",
    "authors": [
      "PAUL WISEMAN   Thu, Jan 2, 2025, 11:15 AM 1 min read"
    ],
    "publish_date": "2025-01-02T17:15:37.000Z",
    "extraction_date": "2025-03-10T16:55:22.793187",
    "text": "WASHINGTON (AP) — U.S. mortgage rates rose this week to the highest level since July.\n\nThe benchmark 30-year fixed rate loan rate rose to 6.91% from 6.85% last week, according to mortgage giant Freddie Mac. It was at 6.62% a year ago.\n\nThe uptick in the cost of home loans reflects a rise in the bond yields that lenders use as a guide to price mortgages. The increase is occurring with the price of homes rising steadily.\n\nThe average rate on a 15-year fixed-rate mortgage, popular with homeowners seeking to refinance, climbed to 6.13%, up from 6% and also the highest since July. It was at 5.89% a year ago.\n\n“Inching up to just shy of 7%, mortgage rates reached their highest point in nearly six months,” said Freddie Mac chief economist Sam Khater. “Compared to this time last year, rates are elevated and the market’s affordability headwinds persist. However, buyers appear to be more inclined to get off the sidelines as pending home sales rise.”\n\nInterest rates have been climbing since the Federal Reserve signaled last month that it expects to raise its benchmark rate just twice this year, down from the four cuts it forecast in September.\n\nThe reason the Fed is tapping the brakes is that inflation remains stubbornly above the cental bank's 2% target, even though it’s fallen from the heights it reached in mid-2022. Economists also worry that President-elect Donald Trump’s economic policies, notably his plan to vastly increase tariffs on imports, could fuel inflation.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 250,
    "summary": "U.S. mortgage rates rose this week to the highest level since July.  The benchmark 30-year fixed rate loan rate rose to 6.91% from 6.85% last week, according to mortgage giant Freddie Mac.  The uptick in the cost of home loans reflects a rise in the bond yields that lenders use as a guide to price mortgages.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "ba133e65-c0f9-4a79-8944-8462f85e6bd0",
    "url": "https://finance.yahoo.com/news/mortgage-rates-start-2025-near-7-hitting-highest-level-since-july-170041049.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Mortgage rates start 2025 near 7%, hitting highest level since July",
    "authors": [
      "Claire Boston    · Senior Reporter  Thu, Jan 2, 2025, 11:00 AM 1 min read"
    ],
    "publish_date": "2025-01-02T17:00:41.000Z",
    "extraction_date": "2025-03-10T16:55:24.921923",
    "text": "Mortgage rates rose again last week, leaving them near 7% to start the year.\n\nThe average 30-year fixed-rate mortgage rose to 6.91% in the week through Wednesday, from 6.85% as of Dec. 26, according to Freddie Mac data. 15-year mortgage rates jumped to 6.13% from 6% a week earlier.\n\n“Inching up to just shy of 7%, mortgage rates reached their highest point in nearly six months,” Sam Khater, Freddie Mac’s chief economist, said in a statement. \"Compared to this time last year, rates are elevated and the market’s affordability headwinds persist.\"\n\nIt’s the third straight week of rate gains and the highest level since July.\n\nRead more: What determines mortgage rates? It’s complicated.\n\nFactors like high rates and elevated home prices that have shut many prospective buyers out of the market show no sign of easing for now. But there are signs that some buyers are pushing ahead with home purchases despite affordability challenges: Housing contract signings rose in November to reach the highest level since early 2023, according to the National Association of Realtors.\n\nDemand for mortgages in the final week of 2024 fell sharply, a combination of holiday market slowness and rates near 7%, according to the Mortgage Bankers Association.\n\nApplications to purchase a new home fell 13% through Friday compared to two weeks earlier, while refinancing applications were down 36%. The results include an adjustment for the Christmas holiday.\n\nLate December is typically one of the seasonally slowest times for the housing market as buyers and sellers pause amid the holidays and colder weather.\n\nClaire Boston is a senior reporter for Yahoo Finance covering housing, mortgages, and home insurance.\n\nClick here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more\n\nRead the latest financial and business news from Yahoo Finance",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 304,
    "summary": "The average 30-year fixed-rate mortgage rose to 6.91% to start the new year.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/us-mortgage-rates-rise-highest-120000062.html",
    "provided_title": "US Mortgage Rates Approach 7% in Ominous Sign for Housing Market",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/us-mortgage-rates-rise-highest-120000062.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/singapore-home-prices-rebound-end-060713984.html",
    "provided_title": "Singapore’s Home Prices Rebound on Year-End Sales Boom",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/singapore-home-prices-rebound-end-060713984.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "9927861d-f67b-4570-9af7-3adb990328e8",
    "url": "https://finance.yahoo.com/news/australian-home-prices-finally-cool-133613792.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Australian home prices finally cool as 2024 comes to an end",
    "authors": [
      "Reuters   Wed, Jan 1, 2025, 7:36 AM 2 min read"
    ],
    "publish_date": "2025-01-01T13:36:13.000Z",
    "extraction_date": "2025-03-10T16:55:30.410561",
    "text": "SYDNEY (Reuters) - Australia's home prices marked the first monthly decline in almost two years in December as high mortgage rates stretched affordability and more sellers emerged after a long run of gains.\n\nFigures from property consultant CoreLogic, released on Thursday, showed prices across the nation dipped 0.1% in December from the prior month, while values in the major capitals fell 0.2%.\n\nSydney prices slipped by 0.6% in December, while Melbourne lost 0.7%. Brisbane, Perth and Adelaide all continued to enjoy monthly gains.\n\n\"Growth in housing values has been consistently weakening through the second half of the year, as affordability constraints weighed on buyer demand and advertised supply levels trended higher,\" said Tim Lawless, CoreLogic's research director.\n\nProperty values were still up 4.9% for 2024 as a whole, adding about A$38,000 to the median value of a home, which in Sydney now stands at A$1.2 million ($745,680.00).\n\nThe government statistician estimates the value of land and housing held by households rose by A$851 billion in the year to September, reaching a notional A$11.3 trillion.\n\nThe strength of the market over the past couple of years has surprised policy makers given interest rates had hit 12-year highs of 4.35% late in 2023.\n\nThe Reserve Bank of Australia (RBA) recently opened the door to a rate cut as early as February but markets expect only a modest easing to around 3.60% over 2025.\n\n\"It will take a lot more than three or four rate cuts to get interest rates back to the pre-pandemic decade average of 2.55%,\" noted Lawless.\n\n\"So we don't expect lower rates to be the catalyst for a renewed phase of strong value growth.\"\n\nA Reuters poll in November forecast home prices to rise around 5% in both 2025 and 2026, due in part to strong population growth and a lack of new supply.\n\n($1 = 1.6093 Australian dollars)\n\n(Reporting by Wayne Cole; Editing by Sam Holmes)",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 318,
    "summary": "Australia's home prices marked the first monthly decline in almost two years in December as high mortgage rates stretched affordability and more sellers emerged after a long run of gains.  Figures from property consultant CoreLogic, released on Thursday, showed prices across the nation dipped 0.1% in December from the prior month, while values in the major capitals fell 0.2%.  \"Growth in housing values has been consistently weakening through the second half of the year, as affordability constraints weighed on buyer demand and advertised supply levels trended higher,\" said Tim Lawless, CoreLogic's research director.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "url": "https://finance.yahoo.com/news/football-star-lionel-messi-holds-082541775.html",
    "provided_title": "Football Star Lionel Messi Lists His Real Estate Assets",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/football-star-lionel-messi-holds-082541775.html",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "45912962-e618-4ac6-8a2e-d2e107b46178",
    "url": "https://finance.yahoo.com/personal-finance/mortgages/article/mortgage-refinance-rates-today-saturday-january-4-2025-110005503.html",
    "original_title": "Yahoo Finance",
    "provided_title": "Mortgage and refinance rates today, January 4, 2025: Fixed rates hardly move",
    "authors": [
      "Laura Grace Tarpley · Lead Editor and Content Strategist, Mortgages   Sat, Jan 4, 2025 6 min read"
    ],
    "publish_date": "2025-01-04T11:00:05.000Z",
    "extraction_date": "2025-03-10T16:55:34.425066",
    "text": "Mortgage rates are inching down today — but just barely. According to Zillow, the 30-year fixed mortgage rate has decreased by one basis point to 6.67%, and the 15-year fixed rate is down four basis points to 6.00%.\n\nRates will probably decline throughout 2025, but not drastically. If you're otherwise ready to buy a home, now could be as good a time as any to start house hunting.\n\nDig deeper: Should you buy a house? How to know if you're ready.\n\nHere are the current mortgage rates, according to the latest Zillow data:\n\n30-year fixed: 6.67%\n\n20-year fixed: 6.51%\n\n15-year fixed: 6.00%\n\n5/1 ARM: 6.68%\n\n7/1 ARM: 6.65%\n\n30-year VA: 6.08%\n\n15-year VA: 5.63%\n\n5/1 VA: 6.23%\n\nRemember, these are the national averages and rounded to the nearest hundredth.\n\nLearn more: 5 strategies for getting the lowest mortgage rates\n\nThese are today's mortgage refinance rates, according to the latest Zillow data:\n\n30-year fixed: 6.65%\n\n20-year fixed: 6.62%\n\n15-year fixed: 5.89%\n\n5/1 ARM: 6.04%\n\n7/1 ARM: 6.68%\n\n30-year VA: 6.05%\n\n15-year VA: 5.77%\n\n5/1 VA: 5.97%\n\nAgain, the numbers provided are national averages rounded to the nearest hundredth. Mortgage refinance rates are often higher than rates when you buy a house, although that's not always the case.\n\nUse Yahoo Finance's free mortgage calculator to see how various interest rates and term lengths will impact your monthly mortgage payment. It also shows how the home price and down payment amount play into things.\n\nOur calculator includes homeowners insurance and property taxes in your monthly payment estimate. You even have the option to enter costs for private mortgage insurance (PMI) and homeowners' association dues if those apply to you. These details result in a more accurate monthly payment estimate than if you simply calculated your mortgage principal and interest.\n\nThere are two main advantages to a 30-year fixed mortgage: Your payments are lower, and your monthly payments are predictable.\n\nA 30-year fixed-rate mortgage has relatively low monthly payments because you’re spreading your repayment out over a longer period of time than with, say, a 15-year mortgage. Your payments are predictable because, unlike with an adjustable-rate mortgage (ARM), your rate isn’t going to change from year to year. Most years, the only things that might affect your monthly payment are any changes to your homeowners insurance or property taxes.\n\nThe main disadvantage to 30-year fixed mortgage rates is mortgage interest — both in the short and long term.\n\nA 30-year fixed term comes with a higher rate than a shorter fixed term, and it’s higher than the intro rate to a 30-year ARM. The higher your rate, the higher your monthly payment. You’ll also pay much more in interest over the life of your loan due to both the higher rate and the longer term.\n\nThe pros and cons of 15-year fixed mortgage rates are basically swapped from the 30-year rates. Yes, your monthly payments will still be predictable, but another advantage is that shorter terms come with lower interest rates. Not to mention, you’ll pay off your mortgage 15 years sooner. So you’ll save potentially hundreds of thousands of dollars in interest over the course of your loan.\n\nHowever, because you’re paying off the same amount in half the time, your monthly payments will be higher than if you choose a 30-year term.\n\nDig deeper: 15-year vs. 30-year mortgages\n\nAdjustable-rate mortgages lock in your rate for a predetermined amount of time, then change it periodically. For example, with a 5/1 ARM, your rate stays the same for the first five years and then goes up or down once per year for the remaining 25 years.\n\nThe main advantage is that the introductory rate is usually lower than what you’ll get with a 30-year fixed rate, so your monthly payments will be lower. (Current average rates don't necessarily reflect this, though — in some cases, fixed rates are actually lower. Talk to your lender before deciding between a fixed or adjustable rate.)\n\nWith an ARM, you have no idea what mortgage rates will be like once the intro-rate period ends, so you risk your rate increasing later. This could ultimately end up costing more, and your monthly payments are unpredictable from year to year.\n\nBut if you plan to move before the intro-rate period is over, you could reap the benefits of a low rate without risking a rate increase down the road.\n\nLearn more: Adjustable-rate vs. fixed-rate mortgage\n\nFirst of all, now is a relatively good time to buy a house compared to the last couple of years. Home prices aren't spiking like they were during the height of the COVID-19 pandemic. So, if you want or need to buy a house soon, you should feel pretty good about the current climate.\n\nAlso, mortgage rates aren't predicted to fall drastically throughout 2025 like people were expecting a few months ago. Since rates are wobbling now — and competition tends to be less fierce in winter months — it could be a good time to buy.\n\nRead more: Which is more important, your home price or mortgage rate?\n\nAccording to Zillow, the national average 30-year mortgage rate is 6.67% right now. But keep in mind that averages can vary depending on where you live. For example, if you're buying in a city with a high cost of living, rates could be higher.\n\nMortgage rates are expected to go down overall in 2025, though they probably won't plummet anytime soon.\n\nMortgage rates have been going back and forth for a couple of weeks, and they've ticked down a bit today.\n\nIn many ways, securing a low mortgage refinance rate is similar to when you bought your home. Try to improve your credit score and lower your debt-to-income ratio (DTI). Refinancing into a shorter term will also land you a lower rate, though your monthly mortgage payments will be higher.\n\nA rate-and-term refinance replaces your original mortgage with a new one with a different mortgage rate and term length. Find out if it’s a good fit.\n\nWhen you can refinance a mortgage depends on your loan type. You may have to wait up to 12 months. Learn how soon you can refinance your mortgage.\n\nWant to get a mortgage on a $500,000 home? Learn what your monthly mortgage payment and long-term costs will be to determine if you can afford a $500,000 house.\n\nThere are several types of home refinance options, including cash-out, no-closing-cost, and more. Learn which type of refinance is best for your financial goals.\n\nHow do you know when to refinance your mortgage? Lower interest rates are only one sign that it could be time. Learn more about when to refinance.\n\nRefinancing a mortgage hurts your credit, but the effects are usually small and go away quickly. Learn how to prepare for a refinance to affect your credit.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 1135,
    "summary": "These are today's mortgage and refinance rates. Fixed rates have ticked down, but the changes aren't drastic. Lock in your rate today.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "6670902e-54a0-4b93-9139-130503e22bb9",
    "url": "https://finance.yahoo.com/personal-finance/article/advantages-of-dry-january-saving-money-192611061.html",
    "original_title": "Yahoo Finance",
    "provided_title": "A hidden benefit of Dry January: You could save hundreds of dollars this month",
    "authors": [
      "Ivana Pino · Senior Writer  Updated Sat, Jan 4, 2025 4 min read"
    ],
    "publish_date": "2025-01-04T14:33:16.000Z",
    "extraction_date": "2025-03-10T16:55:36.612371",
    "text": "Some advertisements and offers on this page are from advertisers who pay us. That may influence which products we write about, but it does not affect what we write about them. Here's an explanation of how we make money and our Advertiser Disclosure.\n\nWith a new year comes new resolutions, often tied to our personal, health, and financial goals. Many Americans may be looking to save more money, eat healthier, commit to a fitness regimen, or, in some cases, cut out alcohol.\n\nAccording to a 2023 Gallup poll, 62% of US adults drink alcohol. About 1 in 5 adults who drink said they sometimes drink more than they think they should.\n\nToo much alcohol can certainly have negative impacts on your mental and physical health; taking a break from drinking can serve as a much-needed reset. That’s a big part of why “Dry January” is growing in popularity.\n\nBut if you decide to participate this year, you might find that abstaining from alcohol for 31 days could benefit your wallet too.\n\nAfter a festive holiday season, some people feel the need to hit the pause button on their alcohol consumption. Enter Dry January, a challenge officially started in 2013 by Alcohol Change UK, which encourages adults to abstain from drinking alcohol for the entire month.\n\nThe challenge is meant to be a total reset, leading to higher energy levels, increased productivity, improved sleep, and other health benefits. About a quarter of Americans successfully completed Dry January in 2024, according to a survey by CivicScience. That’s up from 16% in 2023.\n\nHowever, resolving to go alcohol-free in January may not only be good for your health — experts say your finances can benefit as well.\n\nRead more: 5 psychological money hacks to cut spending and increase savings\n\n“So many of us think about our physical and mental health at this time of the year; make a resolution to put your financial health in that same bucket,” said Emily Irwin, Wells Fargo senior director of advice, in an interview with Yahoo Finance. “When you think about Dry January, that really means take a step back and only spend on necessities.”\n\nAfter all, the costs associated with drinking extend beyond the price of booze.\n\nAmericans spend an average of $583 on alcohol each year, according to Own Your Limits, an educational campaign run by the Department of Defense. That’s about $50 per month — but it could be more, depending on your alcohol consumption and drink of choice.\n\nThen there are all the other potential expenses involved in a night of drinking: tipping the bartender, a taxi or rideshare home, that late night pizza you probably wouldn’t have ordered if you weren’t buzzed.\n\nThere are also indirect, long-term expenses you might reduce by cutting back on alcohol, such as medical costs or even insurance premiums.\n\nDry January can present a great opportunity to be more mindful of your spending in general. So while you’re at it, take a look at your budget and see if there are other ways you can cut back on unnecessary spending in January and beyond.\n\nRead more: Your complete guide to budgeting for 2025\n\nIf you decide to take on the dry January challenge, there are a few steps you can take to set yourself up for success and get the most out of your alcohol-free month:\n\nPlan out your social calendar ahead of time: Take a look at your plans for this month and identify any potential triggers or social situations where you might be tempted to drink. Come up with a strategy for how to handle them, like meeting up with friends at the local coffee shop rather than a cocktail bar. If you think you may give into temptation, planning ahead and making sure you’re in the right environment can make it easier to stick to your goal.\n\nLet friends and family know you’re taking on the challenge: Give your loved ones a heads up that you’re avoiding alcohol for the month, especially if you feel you might need extra support or an accountability partner.\n\nSwap out your drink of choice for a mocktail: Many bars and restaurants offer alcohol-free versions of your favorite cocktails and other specialty nonalcoholic beverages. Look up menus to find out what nonalcoholic options are available and decide what you’re drinking ahead of time. That way, you can still enjoy going out without breaking your alcohol-free streak.\n\nSet a goal: What will you do with your newfound savings? Choosing a goal — whether it's establishing an emergency fund or saving up for a spring break vacation — can help you stay motivated to stick with Dry January and enjoy the results of your hard work.\n\nCheck in with yourself: Depending on your previous relationship with alcohol, going cold turkey can sometimes lead to negative side effects. Pay close attention to how you’re feeling and note any changes, such as increased anxiety or headaches. You may want to discuss these symptoms with your doctor.\n\nWith interest rates on the decline, redditors want to know which financial institution has the better option for their savings: American Express or Wealthfront. Here’s our expert take.\n\nUnderstanding the relationship between savings/CD rates and inflation can help you maximize your interest earnings. Here’s how inflation impacts savings account and CD rates.\n\nAre CD rates expected to go up or down this year? Here’s what could happen, according to experts.\n\nIf you’re traveling, moving, or otherwise away from your credit union’s nearest branch, shared branching allows you to perform basic banking tasks at a location within the network.\n\nIf you send money using Zelle, it’s important to be aware of transfer limits. Here’s a look at the Zelle transfer limits among some of the largest banks.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 959,
    "summary": "Saving money is one of the often overlooked benefits of Dry January. Here's how giving up alcohol for a month can benefit your finances.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "cb84f9ab-d802-476f-b61a-41c35507989f",
    "url": "https://finance.yahoo.com/news/know-apples-95-million-settlement-184509384.html",
    "original_title": "Yahoo Finance",
    "provided_title": "What to know about Apple's $95 million settlement of the snooping Siri case",
    "authors": [
      "MICHAEL LIEDTKE   Fri, Jan 3, 2025, 12:45 PM 4 min read"
    ],
    "publish_date": "2025-01-03T18:45:09.000Z",
    "extraction_date": "2025-03-10T16:55:38.853979",
    "text": "Apple has agreed to pay $95 million to settle a lawsuit that accused the company of turning its virtual assistant Siri into a snoop that eavesdropped on the users of iPhones and other trendy devices in a betrayal to its long-standing commitment to personal privacy.\n\nThe proposed settlement filed in federal court earlier this week still needs to be approved by a judge, but here are a few things to know about the case and the privacy issues that it raised.\n\nWHAT WAS THE LAWSUIT ABOUT?\n\nThe Wood Law Firm, which specializes in class-action lawsuits, filed the complaint against Apple in August 2019, shortly after The Guardian newspaper published an article alleging that Siri's microphone had been surreptitiously turned on to record conversations occurring without the users' knowledge.\n\nApple issued a September 2014 software update that was supposed to activate the virtual assistant only with the triggering words “Hey, Siri,” but The Guardian story alleged Siri was listening and recording conversations at other times to help improve the company’s technology.\n\nThe story led to the lawsuit, which later raised allegations that Apple shared some of the conversations that Siri secretly recorded with advertisers looking to connect with consumers who were more likely to buy their products and services.\n\nHOW MANY PEOPLE ARE COVERED BY THE SETTLEMENT?\n\nTens of millions of U.S consumers who owned or purchased iPhones and other devices equipped with Siri from September 17, 2014, through the end of last year will be eligible to file claims.\n\nHOW MUCH MONEY WILL EACH ELIGIBLE CONSUMER RECEIVE?\n\nIt's far too early to tell for certain, but the settlement currently envisions paying out up to $20 per Siri-enabled device, with each consumer limited to a maximum. The final amount could be affected by two factors: the number of claims and how much of the settlement fund is reduced to cover legal fees and costs.\n\nA claims administrator estimates only 3% to 5% of eligible consumers will file claims. The lawyers in the case currently are seeking nearly $30 million in fees and expenses, but that figure could still be lowered by U.S. District Judge Jeffrey White, who is overseeing the case in Oakland, California. A proposed Feb. 14 court hearing has been proposed to review the settlement terms.\n\nDID APPLE BREAK ANY LAWS?\n\nIf the allegations were true, Apple may have violated federal wiretapping laws and other statutes designed to protect people's privacy. But Apple adamantly denied any wrongdoing and maintained that it would have been cleared of any misconduct had the case gone to trial. Lawyers representing the consumers asserted that Apple's misbehavior was so egregious that the company could have been liable for $1.5 billion in damages if it lost the case.\n\nAlthough Apple hasn't explained the reasons for making the settlement, major companies often decide it makes more sense to resolve class-action cases rather than to continue to run up legal costs and risk the chance of potentially bad publicity. The lawsuit also targeted one of Apple's core values framing privacy as a “fundamental human right.”\n\nAlthough $95 million sounds like a lot of money, it's a pittance for Apple. Since September 2014, the company's total profits have exceeded $700 billion — a streak of prosperity that has helped propel the company's market value to about $3.7 trillion.\n\nDO I NEED TO BE WORRIED ABOUT THE MICROPHONES ON OTHER DEVICES SPYING ON ME?\n\nPerhaps. A case similar to the one filed against Siri is still active in a San Jose, California, federal court against Google and the virtual assistant in its Android software, which has been widely used in smartphones for years.\n\nJUST IN CASE, HOW DO I DISABLE SIRI?\n\nYou can turn Apple’s virtual assistant off by following these simple steps:\n\n1. Navigate to Settings Siri & Search.\n\n2. Toggle off Listen for ‘Hey Siri’ and press the Side button for Siri.\n\n3. Tap Turn Off Siri when a pop-up window appears.\n\nYou can also disable individual apps' access to your iPhone's mic by doing the following: Navigate to Settings (select the app) then toggle off Microphone.",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 680,
    "summary": "Apple has agreed to pay $95 million to settle a lawsuit that accused the company of turning its virtual assistant Siri into a snoop that eavesdropped on the users of iPhones and other trendy devices in a betrayal to its long-standing commitment to personal privacy.  The proposed settlement filed in federal court earlier this week still needs to be approved by a judge, but here are a few things to know about the case and the privacy issues that it raised.  The Wood Law Firm, which specializes in class-action lawsuits, filed the complaint against Apple in August 2019, shortly after The Guardian newspaper published an article alleging that Siri's microphone had been surreptitiously turned on to record conversations occurring without the users' knowledge.",
    "input_timestamp": "2025-01-04 15:33:39"
  },
  {
    "id": "dcbf1244-4b13-4ac8-9cfe-00ce423c013a",
    "url": "https://finance.yahoo.com/news/spacexs-starship-deploy-mock-satellites-171858786.html",
    "original_title": "Yahoo Finance",
    "provided_title": "SpaceX's Starship to deploy mock satellites in next test",
    "authors": [
      "Joey Roulette   Fri, Jan 3, 2025, 11:18 AM 2 min read"
    ],
    "publish_date": "2025-01-03T17:18:58.000Z",
    "extraction_date": "2025-03-10T16:55:40.939100",
    "text": "By Joey Roulette\n\nWASHINGTON (Reuters) -Elon Musk's SpaceX said on Friday its upcoming Starship test flight would include the rocket's first attempt to deploy payloads in space by releasing 10 model Starlink satellites, a key demonstration for Starship's potential in the satellite launch market.\n\n\"While in space, Starship will deploy 10 Starlink simulators, similar in size and weight to next-generation Starlink satellites as the first exercise of a satellite deploy mission,\" SpaceX said in a blog post on its website.\n\nThe Starship flight from SpaceX's sprawling Boca Chica, Texas facilities, tentatively planned for later this month, will mark the seventh demonstration in a test-to-failure style of rocket development where the company tests new upgrades with each flight.\n\nIn October, Starship's \"Super Heavy\" first stage booster returned to its launch pad's giant mechanical arms for the first time, a milestone for its fully reusable design.\n\nThe rocket's sixth test flight in November, attended by U.S. President-elect Donald Trump, achieved similar mission objectives - besides the landing of Super Heavy, which was forced to target a water landing on the Gulf of Mexico because of a launchpad problem.\n\nStarship is the centerpiece of SpaceX's future satellite launch business - an area it currently dominates with its partially reusable Falcon 9 - as well as Musk's dreams to colonize Mars.\n\nThe rocket's power, stronger than the Saturn V rocket that sent Apollo astronauts to the moon in the last century, is key for launching huge batches of satellites into low-Earth orbit and is expected to rapidly expand the company's Starlink satellite internet network.\n\nSpaceX is under contract with NASA to land U.S. astronauts on the moon later this decade using Starship.\n\nMusk, SpaceX's founder and CEO, has become a close ally of Trump who has made getting to Mars a more prominent goal for the incoming administration.\n\n(Reporting by Joey Roulette, Editing by Franklin Paul and Gareth Jones)",
    "has_paywall": false,
    "domain": "finance.yahoo.com",
    "word_count": 315,
    "summary": "WASHINGTON (Reuters) -Elon Musk's SpaceX said on Friday its upcoming Starship test flight would include the rocket's first attempt to deploy payloads in space by releasing 10 model Starlink satellites, a key demonstration for Starship's potential in the satellite launch market.  \"While in space, Starship will deploy 10 Starlink simulators, similar in size and weight to next-generation Starlink satellites as the first exercise of a satellite deploy mission,\" SpaceX said in a blog post on its website.",
    "input_timestamp": "2025-01-04 15:33:39"
  }
]