[
  {
    "title": "View More",
    "url": "https://finance.yahoo.com/topic/latest-news",
    "timestamp": "2025-01-04 15:33:39",
    "text": "LONDON/ZURICH (Reuters) -UBS is in talks to compensate some clients for losses after they were sold complex foreign-exchange derivatives that wiped out much of their investments when U.S. President Donald Trump's tariffs sparked wild moves in currencies, sources familiar with the matter said.  Several hundred customers of the Swiss banking giant are affected, the sources said, some of whom have seen a significant hit to their investments.  Among those asking for compensation from UBS for the losses incurred are wealthier retail customers who argue they were sold complex products that they did not understand, the second source said, adding that they were only suitable for sophisticated investors.\n\n(Reuters) -Galaxy Digital, founded by Mike Novogratz, made its Nasdaq debut on Friday, capping off a momentous week for cryptocurrency in public markets, with Coinbase joining the S&P 500 and retail brokerage eToro also going public.  Galaxy Digital, a crypto investment company that also specializes in artificial intelligence data center infrastructure, had been listed on the Toronto Stock Exchange, but began trading on the Nasdaq on Friday at $23.50 per share after a lengthy transition period.\n\nConsulting firms like McKinsey, BCG, PwC, and KPMG have seen increased demand since Trump began levying tariffs.\n\nNow on demand on WHAT THE TRUCK?!? Dooner is joined by Will Hopping; Norita Taylor; William Hall The post SONAR’s Trade War Command Center; Nikola & CARB: Who killed the hydrogen truck? | WHAT THE TRUCK?!? appeared first on FreightWaves.\n\n(Bloomberg) -- A key House committee on Friday failed to advance House Republicans’ massive tax-and-spending bill after hard-line conservatives bucked President Donald Trump and blocked the bill over cost concerns.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Ch\n\nTesla stock is on the move after the EV maker added Chipotle president Jack Hartung to its board of directors.\n\nNvidia stock was on track to see a 15.4% gain over the five trading sessions ending Friday as an optimistic outlook for its business abroad sent shares soaring ahead of its quarterly earnings report on May 28.\n\nRelief over easing trade tensions is giving way to concern about the impact of President Trump's tariffs.\n\nThree factions of Republicans have flummoxed GOP leaders and raised serious questions this week about the timing of a coming vote on Trump's 'big beautiful bill.'\n\nConsumer sentiment continued to decline in May as Americans expect Trump's tariffs to send inflation soaring over the next year.\n\nNovo Nordisk CEO Lars Fruergaard Jørgensen steps down from the Danish drug giant.\n\nBill George, who sat on the boards of Starbucks and Target, said CEOs are eager to invest in their companies.\n\nIn the first three months of the year Tesla reported deliveries of 336,681, a drop of 13% versus a year ago, missing estimates of 390,000 units.\n\nAirlines say demand is holding steady. Summer travel isn't what it used to be, but it can still be something.\n\nJPMorgan Chase CEO Jamie Dimon's time as top boss is winding down at a time when his stature on Wall Street and in the nation's capital is arguably at an all-time high. Investors, as a result, may not be ready to let him go.\n\nShares of blockchain infrastructure company Coinbase (NASDAQ:COIN) jumped 9.3% in the afternoon session after the company clarified that the SEC's inquiry was related to a discontinued user-metric last reported more than two and a half years ago.\n\nShares of healthcare professional network Doximity (NYSE:DOCS) fell 11.7% in the afternoon session after the company reported weak first quarter 2025 results: its revenue guidance for next year fell short of Wall Street's estimates and suggested a significant slowdown in demand. Notably, top-line growth decelerated significantly, up 17% (versus 25% growth in the previous quarter).\n\nShares of identification solutions manufacturer Brady (NYSE:BRC) fell 5.4% in the afternoon session after the company reported disappointing first quarter results: Its revenue slightly missed and its full-year EPS guidance fell slightly short of Wall Street's estimates. Management also noted that the tariff situation was likely to create uncertainty, suggesting it could be a significant headwind for the business. Overall, this was a weaker quarter.\n\nShares of semiconductor machinery manufacturer Applied Materials (NASDAQ:AMAT) fell 6% in the afternoon session after the company reported disappointing first 2025 quarter results: its revenue was in line and its inventory levels slightly increased. On the other hand, Applied Materials beat analysts' EPS and adjusted operating income estimates this quarter. Zooming out, we think this was a mixed quarter. The market seemed to be hoping for more.\n\nTesla stock is on the move after the EV maker added Chipotle president Jack Hartung to its board of directors.\n\nRutger Bregman calls on graduates to choose careers that tackle the world's most pressing issues, such as ending hunger, in his book \"Moral Ambition.\"\n\nEpic Games said 'Fortnite' will be offline on Apple devices because the iPhone maker blocked its app update. The move comes just weeks after Epic Games cheered a judge's ruling that limited the commissions that Apple makes through apps.\n\n(Bloomberg) -- Oil rose after Iran’s foreign minister downplayed prospects for a breakthrough in nuclear talks with the US, saying no formal proposal had been received. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos as NJ Transit Strike LoomsBrent advanced\n\n(Bloomberg) -- President Donald Trump said Iran will face “something bad” if it doesn’t quickly accept a US proposal over its nuclear program, while officials in Tehran called the the US messaging “confusing and contradictory.”Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters\n\nConsumer sentiment fell for the fifth straight month, hovering near an all-time low as inflation worries intensified despite President Donald Trump's moves to pause or reduce some tariffs.\n\nSAO PAULO (AP) — BRF SA (BRFS) on Thursday reported first-quarter profit of $191.8 million. On a per-share basis, the Sao Paulo-based company said it had profit of 12 cents. The chicken, beef and pork producer posted revenue of $2.65 billion in the period.\n\nMAKATI, Philippines (AP) — Philippine Long Distance Telephone Co. (PHI) on Thursday reported profit of $155.7 million in its first quarter. On a per-share basis, the Makati, Philippines-based company said it had net income of 72 cents. Earnings, adjusted for non-recurring gains, were 71 cents per share.\n\nThe new United Polaris Studio suites are 25% larger than standard United Polaris and feature companion seats, caviar service, and 27-inch 4K OLED screens.\n\nSAO PAULO SP, Brazil (AP) — Cosan S.A. (CSAN) on Thursday reported a loss of $304.9 million in its first quarter. On a per-share basis, the Sao Paulo Sp, Brazil-based company said it had a loss of 65 cents. The bioethanol company posted revenue of $1.65 billion in the period.\n\n(Bloomberg) -- New Jersey Transit locomotive engineers started striking early Friday, triggering a shutdown of the agency’s rail service and disrupting travel for hundreds of thousands of commuters.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos as NJ Transi\n\nNvidia stock was on track to see a 15.4% gain over the five trading sessions ending Friday as an optimistic outlook for its business abroad sent shares soaring ahead of its quarterly earnings report on May 28.\n\nOklahoma state officials announced a deal Friday with a private company in the United Arab Emirates for the construction of a $4 billion aluminum manufacturing facility in northeast Oklahoma.  Gov. Kevin Stitt and Oklahoma Department of Commerce officials say the deal with Emirates Global Aluminum would result in the first new aluminum smelting facility to be built in the U.S. in 45 years.  The annual capacity of the smelter would be about 600,000 tons (544,000 metric tons) of primary aluminum, according to a memorandum of understanding signed by Stitt and the company's CEO.\n\n(Reuters) -Michael Burry's Scion Asset Management has doubled its stake in Estee Lauder, at a time when the beauty giant's new CEO is steering the company through a transformation to overcome weak demand in key markets such as North America and China.  \"Burry's bet suggests belief in Estee Lauder's ability to reclaim its status as a beauty powerhouse in an increasingly competitive global market,\" said Angeli Gianchandani, a global brand marketing expert at New York University.  Since joining the company in January, Estee CEO Stephane de La Faverie has ramped up product launches and introduced new luxury price tiers in an attempt to revive demand after several quarters of slow growth.\n\nDespite their restrictions, basic economy tickets have proven popular with budget-conscious flyers and likely won't fully disappear anytime soon.\n\nThree factions of Republicans have flummoxed GOP leaders and raised serious questions this week about the timing of a coming vote on Trump's 'big beautiful bill.'\n\nU.S. equities edged higher at midday as investor optimism about trade deals and inflation outweighed falling consumer sentiment.\n\nDAT is positioning itself not just as a load board, but as the freight industry’s central exchange through its acquisition of factoring and fintech provider Outgo. The post DAT acquires Outgo, enters race to become dominant freight exchange platform appeared first on FreightWaves.\n\nThe bank CEO said in-person work is essential for innovation, management, and the development of young workers. But Gen Z is clinging to their couches.\n\n(Reuters) -A 90-day trade thaw between Washington and Beijing could prove to be a welcome reprieve for the U.S. freight industry, as importers rush to lock in shipments ahead of the busy back-to-school period, experts said.  The $906 billion U.S. trucking industry, in particular, has been facing a nearly three-year-long slowdown due to overcapacity, which was worsened by President Donald Trump's recent tariffs on the country's largest trading partners.  But an agreement on Monday between the world's two largest economies to slash tariffs for at least 90 days, coupled with the White House's deal with the UK and ongoing negotiations with other trade partners, have shifted expectations from fears of low freight activity to a potential import surge ahead of the peak shopping season starting late July.\n\n(Bloomberg) -- Former Federal Reserve Chair Ben S. Bernanke urged the US central bank to provide the public a fuller explanation of its interest-rate decisions and a much richer examination of potential forecast scenarios.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brac\n\nMagrathea’s founders didn’t have the Defense Department in mind when they started out—but they made the pivot.\n\nConsumer confidence is a key economic indicator to keep tabs on. Learn more about what the consumer confidence index is and how it impacts the economy and your wallet.\n\nPARIS (Reuters) -French shipping group CMA CGM will reorganise its global fleet to avoid U.S. port fees on Chinese-built vessels that are due to take effect from October, the company's finance director said.  The port charges are another operational headache for shipping firms wrestling with the fallout from U.S. tariffs, though adjustments made by Washington after an industry backlash have made the fee scheme less disruptive than feared, Ramon Fernandez, CMA CGM's chief financial officer, told Reuters.  U.S. President Donald Trump's administration aims to use the port fees to counter China's dominance in global shipbuilding and support a revival of U.S. maritime transport.\n\n(Bloomberg) -- President Donald Trump called on members of his party to unite behind his economic agenda in Congress, putting pressure on factions of lawmakers who are calling for last-minute changes to the legislation to drop their demands.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the Nordic\n\nThe World Bank said Friday that the $15.5 million Syria owed it has been paid off by Saudi Arabia and Qatar, clearing Damascus to take out new loans.  Saudi Arabia and Qatar had announced plans last month to clear Syria’s outstanding debts, a move that Syria hailed as paving the way for recovery and reconstruction after a 14-year conflict that killed half a million people and caused wide destruction in the country.\n\nNew company will have over 37 million customers.\n\n(Bloomberg) -- OpenAI is rolling out a new artificial intelligence agent for ChatGPT users that’s designed to help streamline software development as the company pushes into a crowded market of startups and large tech firms offering AI tools for coders. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes\n\noil is riding high on the euphoria of not having debilitating tariffs on US imports to China, managed to lift ICE Brent around $65 per barrel towards the end of the week\n\nOpenAI announced on Friday it's launching a research preview of Codex, the company's most capable AI coding agent yet. Codex is powered by codex-1, a version of the company's o3 AI reasoning model optimized for software engineering tasks. OpenAI says codex-1 produces \"cleaner\" code than o3, adheres more precisely to instructions, and will iteratively run tests on its code until passing results are achieved. The Codex agent runs in a sandboxed, virtual computer in the cloud. By connecting with Gi\n\nPutting money aside is an effective way to save for special occasions or to build a rainy day fund in case of emergencies, but earn too much interest and the taxman may come calling.\n\nBurry bought bearish put options on Chinese tech companies Alibaba, Baidu, JD.com, and PDD Holdings, He doubled his stake in Estée Lauder.\n\nVirgin Galactic results and plans for future flights sent shares of the space tourism firm soaring 35%.\n\nBahama Breeze abruptly closed more than one-third of its restaurants this week, further compounding to the problems the casual dining segment is experiencing.\n\nConsumer sentiment continued to decline in May as Americans expect Trump's tariffs to send inflation soaring over the next year.\n\n(Bloomberg) -- Fifth Third Bancorp. began forging relationships with crypto companies about five years ago, but held off on major investments until regulation became clearer. That moment has arrived, according to the bank’s head of strategy. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the Nordi\n\nBetween collections resuming, courts blocking student loan programs and layoffs at the Education Department, borrowers might be confused about the status of their student loans.  Recently, the Education Department announced it would start involuntary collections on defaulted loans, meaning the roughly 5.3 million borrowers who are in default could have their wages garnished by the federal government.  At the center of the turmoil are the government's income-driven repayment plans, which reduce monthly payments for borrowers with lower incomes.\n\nPam Bondi sold her stock in Trump Media on April 2, the same day Trump announced a slew of new tariffs that sent the market tumbling.\n\n(Bloomberg) -- In a week that saw an epic rally in US stocks and recession calls cast aside, currency traders are just as bearish as ever on the American dollar. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos as NJ Transit Strike LoomsStrategists at JPMorga\n\nWASHINGTON (Reuters) -U.S. consumer sentiment slumped further in May while one-year inflation expectations surged as households remained concerned about the economic impact of President Donald Trump's aggressive and often erratic trade policy.  The University of Michigan Surveys of Consumers on Friday said its Consumer Sentiment Index dropped to 50.8 this month from a final reading of 52.2 in April.  \"Tariffs were spontaneously mentioned by nearly three-quarters of consumers, up from almost 60% in April; uncertainty over trade policy continues to dominate consumers’ thinking about the economy,\" said Surveys of Consumers Director Joanne Hsu.\n\nU.S. consumer sentiment fell slightly in May for the fifth straight month, surprising economists, as Americans increasingly worry that President Donald Trump’s trade war will worsen inflation.  The preliminary reading of the University of Michigan’s closely watched consumer sentiment index, released Friday, declined 2.7% on a monthly basis to 50.8, the second-lowest level in the nearly 75-year history of the survey.  Americans have largely taken a sour view about where the economy is headed in the wake of the Trump administration’s imposition of huge import duties, which threaten to slow growth and push up prices.",
    "word_count": 2879
  },
  {
    "title": "NYC congestion pricing set to take effect after years of delays",
    "url": "https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Maduro Rival Seeks Biden Talks Before Venezuela’s Inauguration",
    "url": "https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Austrian Chancellor Nehammer Quits as Coalition Talks Fail",
    "url": "https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "How low can bond spreads go? Five numbers to watch",
    "url": "https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Biden to ban new oil drilling over vast stretch of US Atlantic, Pacific waters",
    "url": "https://finance.yahoo.com/news/biden-ban-oil-drilling-over-040842217.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Boeing ended its difficult 2024 as the biggest loser in the Dow Jones index",
    "url": "https://finance.yahoo.com/news/boeing-ended-difficult-2024-biggest-094501398.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Of the 30 companies in the Dow Jones Industrial Average, Boeing's share price fell the most in 2024.\n\nThe planemaker got off to a worrying start with January's Alaska Airlines blowout.\n\nIts new CEO also had to contend with a seven-week strike that contributed to delivery delays.\n\nBoeing's painful 2024 ended with the planemaker ranking as the biggest loser in the Dow Jones Industrial Average.\n\nIts share price dropped 31% last year — the worst of the index's 30 companies, according to Markets Insider data.\n\nThe planemaker was close to avoiding that title as Nike shares fell nearly 30% across the same period. As a whole, the Dow Jones was up 13%, led by Nvidia after its stock more than doubled.\n\nJust days into 2024 it was apparent that it was going to be a testing year for Boeing.\n\nOn January 5, an Alaska Airlines 737 Max lost a door plug in midair. The fact that the plane was delivered 66 days earlier suggested the problem originated with the manufacturer. That was later shown in the National Transportation Safety Board's preliminary report that said the plane left Boeing's factory missing key bolts.\n\nThe incident sparked an overhaul of the company's processes and culture — and a wave of criticism from airline bosses.\n\nRegulators placed Boeing under further scrutiny too. The Federal Aviation Administration limited production of the 737 Max to 38 jets a month. Its administrator, Mike Whitaker, told Reuters last month he expects Boeing to take several months to get up to that number.\n\nIn March, Dave Calhoun stepped down as CEO. He was replaced in August by Kelly Ortberg, an industry veteran who signaled a return to prioritizing engineering over profit.\n\nOrtberg announced plans to be based in Seattle, Boeing's historic home, and visited factories.\n\nStill, the embattled company couldn't stay out of the headlines.\n\nIn September, its Starliner spacecraft returned to Earth uncrewed. The astronauts it took to the International Space Station were supposed to return after eight days, but problems with Starliner meant they are instead set to spend eight months in space.\n\nLater that month, some 30,000 Boeing workers went on strike, hampering production for seven weeks amid tense union negotiations. 737 Max production didn't restart until December.\n\nLate deliveries continued to irritate airline customers. During the strike, Ortberg announced further delays to Boeing's highly anticipated but yet-to-be-certified 777X jet.\n\nThe CEO also said Boeing would lay off 10% of its 170,000 employees.\n\nBoeing's biggest rival, Airbus, has seen its stock rise 14% over the past year.\n\nBank of America analysts estimated that the European planemaker delivered as many as 760 jets thanks to a big end-of-year push — slightly below Airbus' guidance of 770 planes.\n\nAt the end of November, Boeing had delivered less than half that number, at 318 jets.\n\nOrtberg has a plan to help level the playing field, including putting Boeing leaders on factory floors to help change the company's culture.\n\n\"This is a big ship that will take some time to turn, but when it does, it has the capacity to be great again,\" he said in a memo to staff.\n\n\"With the right focus and culture, we can be an iconic company and aerospace leader once again.\"\n\n2025 is set to be a pivotal year for Ortberg's plan to help move the company forward from last year's woes.\n\nNew year, new Boeing?\n\nRead the original article on Business Insider",
    "word_count": 570
  },
  {
    "title": "These hedge funds soared amid big gains for US stocks and the dollar",
    "url": "https://finance.yahoo.com/news/hedge-funds-soared-amid-big-164000834.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Hedge funds scored hefty returns in 2024, when U.S. stocks and the dollar dominated global markets. Despite an election-fueled \"America first\" narrative in the broader market, some diversified funds still notched outsized gains.\n\nTop hedge funds put up big numbers in 2024, which was dominated by U.S. markets that got a jolt from Donald Trump's presidential election victory.\n\nDespite an \"America first\" narrative that helped boost the S&P 500 23% and the U.S. dollar index by about 7% last year, some multi-strategy funds with bets across different asset classes and geographies saw outsized gains.\n\nFor example, Discovery Capital Management soared 52%, a person familiar with the matter said, confirming other reports. The hedge fund declined to comment.\n\nThat builds on top of a 48% surge in 2023, making it one of the best hedge funds on Wall Street that year, according to Bloomberg.\n\nMeanwhile, D.E. Shaw's Oculus, a macro-oriented multi-strategy fund, returned 36.1% in 2024, and the Composite fund, its largest multi-strategy fund, returned 18%, according to a person familiar with the firm’s results. D.E. Shaw declined to comment.\n\nWhile their performance is often compared to the S&P 500's, hedge funds point out that they don't benchmark themselves to the large-cap U.S. stock index and instead seek to hedge against market downside while providing consistent, risk-adjusted gains that aren't necessarily correlated with the S&P 500.\n\nIn addition, hedge funds often employ different strategies across various offerings. Citadel's flagship Wellington multi-strategy fund returned 15.1% in 2024, a person familiar with the matter confirmed, while its Tactical Trading fund returned 22.3%, and its Equities fund scored an 18% gain. Citadel declined to comment.\n\nElsewhere, Millennium Management climbed 15%, according to reports. The hedge fund didn't immediately respond to requests for comment.\n\nWith such gains, those funds were on track to outperform their peers. Through the first 11 months of 2024, hedge funds overall averaged a 10.7% return, according to the latest data from PivotalPath cited by Reuters. That's up from a 5.7% average return in the same period in 2023.\n\nAnd among global hedge funds taking long and short bets on stocks last year, the total weighted average return came in at 12.75%, according to a private Goldman Sachs note that was seen by Reuters.\n\n\"It could be argued that 2024 was the year of the stock picker, with equity hedge funds playing dispersion well and really leaning into creative shorting strategies and a careful use of leverage to drive returns,\" said PivotalPath CEO Jon Caplis told Reuters.\n\nThis story was originally featured on Fortune.com",
    "word_count": 423
  },
  {
    "title": "AI stocks to watch, Apple TV tries free, and the Chips Act scramble: Tech roundup",
    "url": "https://finance.yahoo.com/news/ai-stocks-watch-apple-tv-140000580.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "kinjavideo-197409\n\nBig Tech stocks could have another big year in 2025.\n\nNvidia (NVDA), Amazon (AMZN), Alphabet (GOOGL), and Apple (AAPL) could continue to be some of the biggest winners of the artificial intelligence-driven stock boom, David Dietze, senior portfolio strategist at Peapack Private Wealth Management, said in the latest episode of Quartz AI Factor, a video series set at the Nasdaq MarketSite.\n\nRead More\n\nApple (AAPL) announced Monday that its video streaming service, Apple TV+, will be free worldwide this upcoming weekend, allowing anyone with an Apple ID to access the platform’s shows.\n\nRead More\n\nBig Tech is spending billions on artificial intelligence as demand grows for computing power and more advanced capabilities.\n\nMicrosoft (MSFT), Meta (META), Google (GOOGL), and Amazon (AMZN) spent a combined $125 billion on investing in and running AI data centers between January and August 2024, according to a JPMorgan (JPM) report citing New Street Research. The research shows both total AI capital expenditures and total data center operating costs, which include “cash operating expenses, software, depreciation, and electricity.”\n\nRead More\n\nApple (AAPL) is giving its Chinese customers a discount on iPhones as it competes with homegrown rivals such as Huawei.\n\nThe iPhone maker is offering a discount of up to 500 Chinese yuan, or $68.50, on its latest iPhone models when customers use “eligible payment methods,” according to the Apple website. The 500 yuan discount applies to the iPhone 16 Pro and iPhone 16 Pro Max, while the iPhone 16 and iPhone 16 Plus will be discounted by 400 yuan during the promotion, which runs from January 4 to 7.\n\nRead More\n\nTech giant Apple (AAPL) has agreed to pay $95 million to settle a proposed cash action lawsuit over allegations that it used its virtual assistant to eavesdrop on iPhone users.\n\nRead More\n\nJust when you thought your toaster couldn’t get any smarter, CES 2025 is about to prove you wrong. The world’s biggest tech show returns to Las Vegas from January 7-10, promising to stuff artificial intelligence into literally everything that has a power button.\n\nRead More\n\nAs the Biden administration prepares to pass power to President-elect Donald Trump, U.S. chipmakers are rushing to finalize federal funding.\n\nIn 2022, President Joe Biden signed the bipartisan CHIPS and Science Act to boost semiconductor manufacturing, research, and development in the U.S. The $280 billion package includes $52 billion in subsidies for chips.\n\nRead More\n\nElon Musk’s Starlink is set to give Ukraine “uninterrupted” service through its satellite network through a partnership with Kyivstar (VEON), the country’s largest mobile operator.\n\nRead More\n\nkinjavideo-197411\n\nDavid Dietze of Peapack Private Wealth Management says capital expenditures are no longer enough and AI companies must deliver tangible cash flows\n\nkinjavideo-197410\n\nDavid Dietze of Peapack Private Wealth Management on the companies powering the AI revolution — and who’s cashing in\n\nFor the latest news, Facebook, Twitter and Instagram.",
    "word_count": 477
  },
  {
    "title": "Wall Street’s Top Banks Just Abandoned a Once Popular Alliance",
    "url": "https://finance.yahoo.com/news/wall-street-top-banks-just-140000186.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  }
]