[
  {
    "title": "View More",
    "url": "https://finance.yahoo.com/topic/latest-news",
    "timestamp": "2025-01-04 15:33:39",
    "text": "U.S. Treasury Secretary Scott Bessent said on Wednesday that he thinks the Trump administration can reach tariff deals with U.S. allies as he prepares to lead negotiations with over 70 countries in the coming weeks, but China remains an outlier due to its retaliation.  Bessent, speaking to an American Bankers Association conference in Washington, said he would take a lead negotiating role in negotiations over President Donald Trump's tariffs.\n\nOpposing views on president Trump's tariffs persist, even among his supporters.\n\nThis comes a day after U.S. Steel said Ancora Holdings, which owns less than 1% stake in the company, claims to be in support of the transaction following its previous attempts to undermine the planned merger.  The investor, which recently unveiled a plan that could deliver a cash offer of $75 per share, has said it had no intention of standing in the way of the $55 per share Nippon deal.\n\nGold opened trading Wednesday at $2,998.30, slightly higher than yesterday's closing price of $2,968.40. While gold prices are still near all-time highs, ongoing fallout from U.S. President Trump's global tariff announcement has weakened gold's recent rally.\n\n(Bloomberg) -- Bitcoin swung between gains and losses, in a sign that cryptocurrency traders are struggling to weather the market turmoil unleashed by US trade tariffs. The largest digital asset was down about 1.3% to $76,046 as of 8:38 a.m. in New York, slipping back into the red after earlier rising 1.1%. Ether, the second-biggest token, also turned negative as China retaliated to new tariffs imposed by US President Donald Trump. Stock markets in Europe had already tumbled on Wednesday as Trum\n\nOpposing views on president Trump's tariffs persist, even among his supporters.\n\nThe massive surge in long-term Treasury yields has served as another example of strange trading action in the aftermath of Trump's tariff-fueled \"Liberation Day.\"\n\nTeens appear to be staying upbeat on the economy despite a sliding stock market and slowing economic growth.\n\nSavers pulled vast sums of 401(k) money from stocks and shifted to more conservative investments, in response to the tariff-induced market turmoil. But that's not necessarily a good strategy.\n\nWalmart maintains its outlook despite Trump tariffs taking hold.\n\nDelta Air Lines delivered a beat on earnings per share while revenues missed analyst expectations as elements from a \"slower-growth\" Q1 clouded the airline's full-year guidance.\n\nThe tech giants can be defensive stocks in a trade war not because they are insulated but because they are enormous, cash-rich, and have sprawling businesses.\n\nElon Musk's disagreements with the Trump administration on tariffs have dramatically spilled into public view. It was a break that had been a long time coming.\n\nUS stock futures sank as Wall Street girded for President Trump's massive tariffs.\n\nSen. Elizabeth Warren warned that President Trump's tariff plan is already damaging the economy and asserted that \"Congress has the power\" to roll the policies back.\n\nWalmart, the nation's largest retailer, is standing behind its full-year sales and operating income outlook even as President Donald Trump has launched tariff wars with China and nearly every trading partner that have brought a wave of economic uncertainty.  Walmart said in a release the range of outcomes has “widened due to less favorable category mix\" and \"the desire to maintain flexibility to invest in price as tariffs are implemented.”\n\nThe massive surge in long-term Treasury yields has served as another example of strange trading action in the aftermath of Trump's tariff-fueled \"Liberation Day.\"\n\nNEW YORK (Reuters) -JPMorgan Chase CEO Jamie Dimon said on Wednesday that sweeping tariffs imposed by U.S. President Donald Trump will probably lead to a recession and defaults by borrowers, he told Fox Business’ Mornings with Maria.  Dimon urged fast progress on trade negotiations with U.S. trading partners in order to calm markets, which have been roiled by tariff announcements.  \"I hope what they really do is... get those things done quickly,\" he said, referring to trade negotiations between U.S. Treasury Secretary Scott Bessent and other nations.\n\nLoyal customers of Asian supermarkets and other grocery stores that specialize in selling imported food heaved a collective sigh of dismay when President Donald Trump announced extra-high U.S. tariffs on goods from dozens of countries.  What would happen to prices at 99 Ranch Market and H Mart?, wondered Asian Americans and immigrants who shop at the two American chains for preferred brands like Japan's Kewpie mayonnaise and China's Pearl River light soy sauce.\n\nGerman unicorn 1Komma5 Grad has joined Sweden's Klarna in reassessing plans for a U.S. float as President Trump's renewable energy and trade policies have roiled markets.  It was aiming for an initial public offering on NASDAQ in 2025.  \"Due to recent tariffs and market reaction we have postponed IPO plans to review the timeline,\" the company's founder and CEO Philipp Schroeder told Reuters.\n\nU.S. Treasury Secretary Scott Bessent said on Wednesday his department will play a greater role in banking regulation to better balance costs and benefits and ensure that lenders can finance growth in the U.S. economy.  In prepared remarks to an American Bankers Association conference, Bessent called for \"commonsense principles\" in banking regulations to ease burdens, especially for community banks that have had to deal with rules tailored for larger institutions.  Bessent said Treasury's stronger involvement in crafting bank regulation would be achieved through the Financial Stability Oversight Council, which meets regularly and includes the heads of the Federal Reserve and other bank regulators.\n\nAutonomous driving technology startup Nuro said on Wednesday it was valued at $6 billion after raising $106 million in its latest funding round. The funding — backed by T Rowe Price Associates, Fidelity Management & Research, Tiger Global, Greylock Partners and XN — comes more than three years after its last round, where Nuro raised $600 million. The company will use the funds to scale its artificial-intelligence technology and advance commercial partnerships, it said.\n\n(Bloomberg) -- Treasury Secretary Scott Bessent played down a selloff in US Treasuries, saying that there was nothing systemic at play, and also served warning against China not to attempt to devalue its exchange rate in retaliation for American tariff hikes.“There’s one of these deleveraging convulsions that’s going on right now in the markets,” Bessent said on Fox Business, adding that he’d witnessed those very often in his hedge-fund career. “It’s in the fixed-income market. There are some ve\n\nShares of Cal-Maine Foods fell 5% in premarket trading Wednesday as a request for information from the U.S. Department of Justice on egg prices outweighed surging fiscal third-quarter sales and profits.\n\nTeens appear to be staying upbeat on the economy despite a sliding stock market and slowing economic growth.\n\nSavers pulled vast sums of 401(k) money from stocks and shifted to more conservative investments, in response to the tariff-induced market turmoil. But that's not necessarily a good strategy.\n\nDelta Air Lines warned that revenue could fall in the current quarter and that “growth has largely stalled,” forcing it to drop plans to offer more seats to passengers, in another warning sign about a possible recession hitting even businesses not directly impacted by recent tariffs.\n\nHundreds of Indonesians are flocking to buy gold bars, betting that the precious metal's value could shield them from tougher economic times ahead as the currency and the stock market tumble in South East Asia's largest economy.  Indonesia is among dozens of countries affected by U.S. President Donald Trump's tariffs, which took effect on Wednesday and have sent shockwaves through many economies.  The rupiah has already hit historic lows, despite central bank intervention.\n\nVerizon said an AI assistant for the company's customer service representatives built using Google models had cut down on call times and freed them up to sell products to customers, leading to a surge in sales.  An AI assistant on their screen helps the customer service agents figure out the right answers to customers' queries.  Verizon first started deploying the new AI features in July 2024, ramping them up to full scale in January.\n\nLONDON (Reuters) -British sportswear retailer JD Sports forecast little or no profit growth this year, even before any potential impact from U.S. tariffs, with the trading environment in its key markets expected to be \"volatile\".  Prior to Wednesday's update, shares in FTSE 100-listed JD had lost over a third of their value this year on worries about consumer spending amid a downturn in demand for Nike products, which account for about 45% of JD's sales.  Its stock was up 8% in afternoon trading after JD forecast current year profit in line with market expectations.\n\n(Bloomberg) -- Sign up for the India Edition newsletter by Menaka Doshi – an insider's guide to the emerging economic powerhouse, and the billionaires and businesses behind its rise, delivered weekly.India’s strategy to counter the US’s damaging tariffs is to finalize a trade agreement with President Donald Trump’s government, Foreign Minister Subrahmanyam Jaishankar said. New Delhi decided to “engage the Trump administration early on,” Jaishankar said at a conference hosted by broadcaster News1\n\n(Photo Illustration by The Real Deal with Getty)The Agency’s Michael Biryla thought he and his seller were in the clear. The potential buyer had already completed an inspection and hammered out negotiations on the contract for the $3 million Upper East Side listing. Then came the call from the buyer agent: the deal was off. “Last night, I got a […]This article originally appeared on The Real Deal. Click here to read the full story.\n\n(Bloomberg) -- With crude prices plunging below $60 a barrel, consumers who count fuel as their single biggest expense are rushing to lock in supplies. More than 25 million barrels of options contracts on the Brent benchmark traded in structures that protect buyers from price gains this week. The activity reflected consumer hedging that allows airlines, truckers and shipping companies to lock in lower fuel costs, according to people involved in the market. Industrial consumers of oil often use d\n\n\"Broad economic uncertainty around global trade\" has led to stalling growth for Delta Air Lines, CEO Ed Bastian said.\n\n(Bloomberg) -- Oil plunged to a four-year low as an intensifying trade war endangered energy demand, with a fresh wave of US and Chinese levies menacing the global economy.Brent futures tumbled below $60 a barrel for the first time since 2021 as natural gas, copper and other commodities also slid. Shares of BP Plc and Shell Plc slumped more than 5%.The declines echoed a wider plunge across global markets, with investors fleeing stocks and bonds around the world, after US President Donald Trump’s\n\nNews of the day for April 9, 2025\n\nUS stock futures tumbled Wednesday after China announced significant retaliation against President Donald Trump’s enormous “reciprocal” tariffs that went into effect earlier in the day, upending global trade.\n\n(Bloomberg) -- PC shipments grew at their fastest quarterly pace since the pandemic after companies from Apple Inc. to Dell Technologies Inc. hastened product deliveries around the world before tariffs hit.Laptops led the way as the entire spectrum of desktops, workstations and portable computers rose 9.4% to 62.7 million units in the first quarter, according to market tracker Canalys. It was the fastest increase for the industry since the spring of 2021, when Covid restrictions were driving dem\n\nBEIJING (Reuters) -     China's commerce ministry on Wednesday added 12 U.S. companies to its export control list and six to its unreliable entities list, effective Thursday, according to ministry statements.\n\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.President Donald Trump’s so-called reciprocal tariffs are now in place, dealing a thunderous blow to the world economy as he pushes forward efforts to drastically reorder global trade.Trump’s latest tariffs push levies imposed on China this year to as high as 104%, along with import taxes on roughly 60 trading partners that run trade surpluses with the US. That comes after a 10% baseline tariff for most US t\n\n(Bloomberg) -- European stocks slumped as China retaliated with higher tariffs on the US, escalating President Donald Trump’s trade war.The Stoxx Europe 600 Index tumbled 4.01% by 12:24 p.m. in London, with all sectors in the red. Health care, energy and real estate stocks fell the most. China said it would raise the tariff on US goods to 84% from 34%, effective April 10. The moves follow Trump’s latest levies that went into force at midday Wednesday in Beijing, taking the cumulative rate announ\n\n(Bloomberg) -- US mortgage rates fell to the lowest level since October, spurred by a rally in government bonds in the wake of an escalating trade war and driving home purchase applications to a more than one-year high.The contract rate on a 30-year mortgage decreased 9 basis points to 6.61% in the week ended April 4, according to Mortgage Bankers Association data released Wednesday. The rates on 30-year jumbo and 15-year fixed mortgages also declined.Cheaper borrowing costs also sparked a 35% s\n\nDENVER (AP) — The Simply Good Foods Co. (SMPL) on Wednesday reported fiscal second-quarter net income of $36.7 million. On a per-share basis, the Denver-based company said it had net income of 36 cents. Earnings, adjusted for one-time gains and costs, came to 46 cents per share.\n\nIndia is considering measures such as extending interest subsidies on bank loans and offering incentives to help exporters to diversify amid rising global uncertainty after the U.S. tariff hikes, two government sources said.  A 26% tariff on Indian exports - alongside even steeper duties on some other countries like China - has escalated trade tensions, and raised concerns among Indian exporters of gems and jewellery, chemicals, pharmaceutical and engineering goods.  The proposed support measures could be discussed at a meeting late on Wednesday, convened by Commerce and Industry Minister Piyush Goyal, with nearly 30 export promotion councils representing millions of exporters, said one of the government sources with the knowledge of the matter.\n\nChina raising its retaliatory tariff on the US to 84%, up from 34%, effective April 10.\n\nWalmart maintains its outlook despite Trump tariffs taking hold.\n\nLife sciences company Neogen (NASDAQ:NEOG) missed Wall Street’s revenue expectations in Q1 CY2025, with sales falling 3.4% year on year to $221 million. The company’s full-year revenue guidance of $895 million at the midpoint came in 1.7% below analysts’ estimates. Its non-GAAP profit of $0.10 per share was 13% below analysts’ consensus estimates.\n\nElectric vehicle sales in the kingdom totalled just 2,000 last year, according to Telemetry analyst Sam Abuelsamid, fewer than Tesla sold between breakfast and dinner on an average day.  But Saudi Arabia has huge plans for EVs that Tesla has not been able to tap, partly because of a feud between its billionaire CEO Elon Musk and the kingdom's powerful Public Investment Fund sovereign wealth fund that dates back to 2018.\n\nNEOG) on Wednesday reported a loss of $11 million in its fiscal third quarter. The Lansing, Michigan-based company said it had a loss of 5 cents per share. Earnings, adjusted for one-time gains and costs, came to 10 cents per share.\n\nThe average contract rate on a 30-year fixed-rate mortgage fell 9 basis points in the week ended April 4, the Mortgage Bankers Association said on Wednesday.  Mortgage rates closely track the 10-year Treasury note yield, which ended last week at a six-month low as investors fearful of a tariff-induced recession fled to the safety of U.S. government bonds.\n\nDelta Air Lines pulled its guidance for 2025 Wednesday as the trade war scrambles expectations for business and household spending and depresses bookings across the travel sector.  “With broad economic uncertainty around global trade, growth has largely stalled,\" CEO Ed Bastian said in a statement on Wednesday.  In the first quarter, Delta earned $240 million, or 37 cents per share.\n\nPackaged food company Simply Good Foods (NASDAQ:SMPL) reported revenue ahead of Wall Street’s expectations in Q1 CY2025, with sales up 15.2% year on year to $359.7 million. Its non-GAAP profit of $0.46 per share was 14.7% above analysts’ consensus estimates.\n\nApple produces around 90% of its iPhones in China, according to Wedbush Securities analysts.\n\nDALLAS (Reuters) -Walmart is sticking to its full-year growth forecasts for sales and operating income, the retailer said on Wednesday, even as U.S. President Donald Trump's sweeping tariffs fuel economic uncertainty and dent consumer confidence.  The retail behemoth had in February forecast sales for the fiscal year ending January 2026 to rise between 3% and 4%, and annual adjusted operating income to increase between 3.5% and 5.5%.  Walmart, which is the biggest U.S. importer, is at the risk of taking a hit from Trump's slew of tariffs, mainly on Asian countries that supply everything from clothing to toys to the retailer.\n\n“Liberation Day” came and went, with President Donald Trump’s sweeping new tariffs battering markets, unsettling the global order, and prompting businesses and households to reconsider their spending.\n\nBillionaire backers of President Donald Trump are watching their fortunes tumble as tariffs take a toll on Big Tech.\n\nC & C Freight Network, Best Choice Trucking and Best Logistics Inc. each filed for Chapter 11 bankruptcy protection Monday. The post Trucking and logistics bankruptcies reported across US appeared first on FreightWaves.\n\nThe British government has refused to rule out nationalizing the last plant in the U.K. that makes steel from raw materials as the global trade war increases pressure to preserve the nation’s ability to supply domestic industry with the steel it needs.  The Scunthorpe steel works operated by British Steel may soon run out of the iron pellets used to produce steel in two massive blast furnaces unless the government steps in, according to local politicians and unions.\n\nGlobal stocks are in turmoil and bond yields are spiking after President Donald Trump's \"Liberation Day\" tariffs went into effect, with Chinese imports facing a 104% levy.\n\nDelta Air Lines says growth has stalled in trade war and the carrier pulls outlook for 2025.",
    "word_count": 2962
  },
  {
    "title": "NYC congestion pricing set to take effect after years of delays",
    "url": "https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html"
  },
  {
    "title": "Maduro Rival Seeks Biden Talks Before Venezuela’s Inauguration",
    "url": "https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html"
  },
  {
    "title": "Austrian Chancellor Nehammer Quits as Coalition Talks Fail",
    "url": "https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html"
  },
  {
    "title": "How low can bond spreads go? Five numbers to watch",
    "url": "https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "404 Client Error: Not Found for url: https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html"
  }
]