[
  {
    "title": "View More",
    "url": "https://finance.yahoo.com/topic/latest-news",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Warren Buffett's Berkshire Hathaway said on Thursday it more than doubled its stake in alcoholic beverages producer Constellation Brands, while selling its holdings in Citigroup and Brazilian fintech lender Nu Holdings.\n\nPresident Donald Trump has taken U.S. trade policy, and the economy, on a rollercoaster ride over the last four months. Two charts illustrate how wild a journey it's been.\n\nCasino resort and entertainment company Red Rock Resorts (NASDAQ:RRR) beat Wall Street’s revenue expectations in Q1 CY2025, with sales up 1.8% year on year to $497.9 million. Its non-GAAP profit of $0.51 per share was 12.9% above analysts’ consensus estimates.\n\n(Bloomberg) -- Wall Street traders drove stocks higher as bond yields sank after the latest economic data spurred bets the Federal Reserve will cut interest rates at least twice this year to prevent a recession.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos\n\n(Bloomberg) -- Thoma Bravo sold its remaining stake in Nasdaq Inc. for proceeds of about $3.4 billion, according to people familiar with the matter.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos as NJ Transit Strike LoomsThe private equity firm divested aro\n\nInvestors digested fresh retail sales,  wholesale inflation data, and an update from Walmart for clues about the health of the economy.\n\nFoot Locker has been struggling with flagging sales for years prior to the acquisition.\n\nCoinbase's stock fell Thursday after disclosing that cyber attackers had stolen sensitive customer data and a news report of an SEC investigation.\n\nThe bond yields that underpin mortgage rates rose this week after the US and China cut a temporary trade deal. That led to an uptick in average mortgage rates.\n\nWalmart CFO John David Rainey warns price increases are coming in a big way amid Trump tariffs.\n\nOil prices were under pressure on Thursday on renewed hopes of a nuclear deal between the US and Iran.\n\nDespite the whirlwind of headlines about auto tariffs, EV mandates, and even the potential loss of EV tax credits, Americans are still very much interested in EVs. Including those not named Tesla.\n\nJPMorgan Chase CEO Jamie Dimon is not ruling out the possibility of a US recession, saying Thursday that 'I wouldn't take it off the table at this point.'\n\nUnitedHealthcare stock plunged again on Thursday after a new report in the WSJ said the company is facing a Medicare fraud probe.\n\nWall Street's biggest bear makes a key move on recession risk probability.\n\nNEW YORK (Reuters) -AI startup Cohere has doubled its annualized revenue since the beginning of the year, driven by growing demand for secure, customized AI tools among enterprise clients in regulated sectors, the company told Reuters.  The company has crossed an annualized revenue of $100 million as of May 2025, according to one person familiar with the matter.  The growth followed a strategic shift in the third quarter of 2024 with a focus on private deployments tailored for customers in sectors such as finance, healthcare and government.\n\nAre you a brand new owner-operator? Steer away from trouble with these 5 tips. The post 5 Rookie Mistakes Every New Owner-Operator Should Avoid appeared first on FreightWaves.\n\nA reverse mortgage can be a good idea for seniors needing access to cash, but it’s not right for everyone. Learn if a reverse mortgage is the best fit for you.\n\nThe cryptocurrency exchange estimated preliminary expenses of $180 million to $400 million for remediation costs and voluntary customer reimbursements.\n\nThe company expects bookings of between $5.9 billion and $6 billion, compared with expectations of $6.46 billion, according to an average of analysts' estimates compiled by Visible Alpha that were revised after \"GTA VI\" was delayed.  The next installment in the best-selling \"Grand Theft Auto\" franchise is expected to sell millions of copies and generate billions in the first few weeks.  Take-Two's decision to delay the long-awaited game into fiscal 2027 could weigh on its overall bookings for this year, but could benefit it in the next.\n\n(Bloomberg) -- Treasuries gained as a fresh spate of economic data offered signs of ebbing economic activity and dimming inflation, supporting bets that the Federal Reserve will cut interest rates twice this year.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Cha\n\nSAN DIEGO (AP) — Beam Global (BEEM) on Thursday reported a loss of $15.5 million in its first quarter. On a per-share basis, the San Diego-based company said it had a loss of $1.04. Losses, adjusted for asset impairment costs, were 32 cents per share.\n\nCLEVELAND (AP) — Sifco Industries Inc. SIF) on Thursday reported a loss of $1.4 million in its fiscal second quarter. On a per-share basis, the Cleveland-based company said it had a loss of 23 cents.\n\nThe average estimate of eight analysts surveyed by Zacks Investment Research was for earnings of $1.58 per share. The information technology services provider posted revenue of $611.1 million in the period, also falling short of Street forecasts. Six analysts surveyed by Zacks expected $622.4 million.\n\nSEATTLE (AP) — Omeros Corporation OMER on Thursday reported a loss of $33.5 million in its first quarter. The Seattle-based company said it had a loss of 58 cents per share. Losses, adjusted to account for discontinued operations, were 65 cents per share.\n\nOn a per-share basis, the Washington-based company said it had profit of 22 cents. The results beat Wall Street expectations. The average estimate of seven analysts surveyed by Zacks Investment Research was for earnings of 14 cents per share.\n\nThe New York-based company said it had a loss of $21.08 per share. Earnings, adjusted for non-recurring costs and stock option expense, were $1.09 per share. The results exceeded Wall Street expectations.\n\nMURRAY, Utah (AP) — ReposiTrak (TRAK) on Thursday reported net income of $2 million in its fiscal third quarter. On a per-share basis, the Murray, Utah-based company said it had profit of 10 cents. The software-as-a-service provider posted revenue of $5.9 million in the period.\n\nBAY HARBOR ISLAND, Fla. AP) — Fortress Biotech Inc. FBIO) on Thursday reported a loss of $10.6 million in its first quarter.\n\nThe S&P 500 rose 0.4% Thursday, enough to extend its winning streak to a fourth day and to pull within 3.7% of its record.  The Dow Jones Industrial Average added 0.6%, and the Nasdaq composite fell 0.2%.  The Nasdaq composite fell 34.49 points, or 0.2%, to 19,112.32.\n\nThe San Francisco-based company said it had profit of 31 cents per share. Earnings, adjusted for one-time gains and costs, came to 38 cents per share. The results topped Wall Street expectations.\n\nHIGH POINT, N.C. (AP) — VTv Therapeutics Inc. VTVT) on Thursday reported a loss of $5.1 million in its first quarter. On a per-share basis, the High Point, North Carolina-based company said it had a loss of 77 cents.\n\nTUSTIN, Calif. AP) — Virgin Galactic Holdings, Inc. SPCE) on Thursday reported a loss of $84.5 million in its first quarter.\n\nAMAT) on Thursday reported fiscal second-quarter earnings of $2.14 billion. On a per-share basis, the Santa Clara, California-based company said it had net income of $2.63. Earnings, adjusted for one-time gains and costs, were $2.39 per share.\n\nThe Ohio-based bank is launching services for middle-market companies across the new footprint, after making similar plays in the Carolinas and Texas.\n\nChipmaking equipment maker Applied Materials missed Wall Street estimate for second-quarter revenue on Thursday, against the backdrop of heightened uncertainty around the ongoing trade war and export curbs.\n\nSAN DIEGO (AP) — Gossamer Bio Inc. GOSS) on Thursday reported a loss of $36.6 million in its first quarter. The San Diego-based company said it had a loss of 16 cents per share.\n\nSemiconductor equipment maker Applied Materials on Thursday afternoon reported fiscal second-quarter 2025 financial results. A summary of its key numbers is below.\n\nInvestors digested fresh retail sales,  wholesale inflation data, and an update from Walmart for clues about the health of the economy.\n\nSecurity and healthcare technology company OSI Systems (NASDAQ:OSIS) reported Q1 CY2025 results beating Wall Street’s revenue expectations, with sales up 9.6% year on year to $444.4 million. The company expects the full year’s revenue to be around $1.7 billion, close to analysts’ estimates. Its non-GAAP profit of $2.44 per share was 1.5% above analysts’ consensus estimates.\n\n\"The appearance of impropriety, or worse, is too great,\" Rep. Mike Lawler of New York wrote.\n\nCross-border tensions are moderating Canadian National’s outlook, but its CEO still expects around 3% growth in freight volumes this year. The post Tariffs temper Canadian National outlook appeared first on FreightWaves.\n\nResource management provider Itron (NASDAQ:ITRI) missed Wall Street’s revenue expectations in Q1 CY2025, with sales flat year on year at $607.2 million. On the other hand, the company expects next quarter’s revenue to be around $610 million, close to analysts’ estimates. Its non-GAAP profit of $1.52 per share was 15.3% above analysts’ consensus estimates.\n\nEconomic consulting firm CRA International (NASDAQ:CRAI) reported Q1 CY2025 results beating Wall Street’s revenue expectations, with sales up 5.9% year on year to $181.9 million. The company’s full-year revenue guidance of $725 million at the midpoint came in 0.9% above analysts’ estimates. Its non-GAAP profit of $2.22 per share was 13.8% above analysts’ consensus estimates.\n\nGlobal electronics components and solutions distributor Arrow Electronics (NYSE:ARW) beat Wall Street’s revenue expectations in Q1 CY2025, but sales fell by 1.6% year on year to $6.81 billion. On the other hand, next quarter’s revenue guidance of $7 billion was less impressive, coming in 1.4% below analysts’ estimates. Its non-GAAP profit of $1.80 per share was 25.5% above analysts’ consensus estimates.\n\nIT solutions integrator Insight Enterprises (NASDAQ:NSIT) missed Wall Street’s revenue expectations in Q1 CY2025, with sales falling 11.6% year on year to $2.1 billion. Its non-GAAP profit of $1.96 per share was 2.7% below analysts’ consensus estimates.\n\nMaintenance and repair supplier W.W. Grainger (NYSE:GWW) met Wall Street’s revenue expectations in Q1 CY2025, with sales up 1.7% year on year to $4.31 billion. On the other hand, the company’s full-year revenue guidance of $17.85 billion at the midpoint came in 0.7% below analysts’ estimates. Its non-GAAP profit of $9.86 per share was 3.6% above analysts’ consensus estimates.\n\nHealthcare services company Sotera Health (NASDAQ:) beat Wall Street’s revenue expectations in Q1 CY2025, with sales up 2.6% year on year to $254.5 million. Its non-GAAP profit of $0.14 per share was 14.9% above analysts’ consensus estimates.\n\nFood and beverage supplier MGP Ingredients (NASDAQ:MGPI) reported revenue ahead of Wall Street’s expectations in Q1 CY2025, but sales fell by 28.7% year on year to $121.7 million. The company expects the full year’s revenue to be around $530 million, close to analysts’ estimates. Its non-GAAP profit of $0.36 per share was 3.3% below analysts’ consensus estimates.\n\nA lawyer representing Anthropic admitted to using an erroneous citation created by the company's Claude AI chatbot in its ongoing legal battle with music publishers, according to a filing made in a Northern California court on Thursday. Claude hallucinated the citation with \"an inaccurate title and inaccurate authors,\" Anthropic says in the filing, first reported by Bloomberg. Anthropic's lawyers explain that their \"manual citation check\" did not catch it, nor several other errors that were caus\n\nShares of Fiserv tumbled Thursday after CFO Robert Hau said the company expects volume growth of its Clover point-of-sale system this quarter to remain roughly in line with its first-quarter results.\n\nCompany engineers are struggling to significantly improve the capabilities of its Behemoth large-language model, resulting in staff questions about whether improvements over earlier versions are significant enough to justify public release, the report said.  Early in its development, Behemoth was internally scheduled for release in April to coincide with Meta's inaugural AI conference for developers, but later pushed an internal target for the model's launch to June, according to the report.\n\nPresident Donald Trump on Thursday announced deals totaling over $200 billion between the United States and the United Arab Emirates, including a $14.5 billion commitment between Boeing, GE Aerospace and Etihad Airways, the White House said.\n\nHigher tariffs could jeopardize Walmart’s profits in the year ahead even if the retail giant hits its sales goals, executives said Thursday.\n\n(Bloomberg) -- Oil fell for a second day after President Donald Trump said the US and Iran are getting closer to a deal regarding Tehran’s nuclear program, a move that could unleash more supplies onto a market that is rapidly approaching a glut. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the N\n\n(Bloomberg) -- Gold advanced after US economic data supported the case for the Federal Reserve to continue cutting interest rates this year.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the NordicsNYC Commuters Brace for Chaos as NJ Transit Strike LoomsThe latest data showed producer prices in th\n\nAerospace and defense company Leonardo DRS (NASDAQ:DRS) reported revenue ahead of Wall Street’s expectations in Q1 CY2025, with sales up 16.1% year on year to $799 million. The company expects the full year’s revenue to be around $3.48 billion, close to analysts’ estimates. Its non-GAAP profit of $0.20 per share was 21.7% above analysts’ consensus estimates.\n\nApril data from Cass Information Systems showed some stabilization on the freight industry’s path to recovery. The post April sees mixed freight trends on path to recovery appeared first on FreightWaves.\n\nUnitedHealth is bringing back former CEO Stephen Hemsley, as the insurance giant faces spiraling costs and a criminal investigation into its Medicare billing.\n\n(Bloomberg) -- Lawyers for President Donald Trump argued to a Delaware judge that a suit against him by the co-founders of his Truth Social platform should be dismissed or put on hold because he has immunity from such litigation while in office.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump Power-Hungry Data Centers Are Warming Homes in the No",
    "word_count": 2434
  },
  {
    "title": "NYC congestion pricing set to take effect after years of delays",
    "url": "https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Maduro Rival Seeks Biden Talks Before Venezuela’s Inauguration",
    "url": "https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Austrian Chancellor Nehammer Quits as Coalition Talks Fail",
    "url": "https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "How low can bond spreads go? Five numbers to watch",
    "url": "https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Biden to ban new oil drilling over vast stretch of US Atlantic, Pacific waters",
    "url": "https://finance.yahoo.com/news/biden-ban-oil-drilling-over-040842217.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Boeing ended its difficult 2024 as the biggest loser in the Dow Jones index",
    "url": "https://finance.yahoo.com/news/boeing-ended-difficult-2024-biggest-094501398.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Of the 30 companies in the Dow Jones Industrial Average, Boeing's share price fell the most in 2024.\n\nThe planemaker got off to a worrying start with January's Alaska Airlines blowout.\n\nIts new CEO also had to contend with a seven-week strike that contributed to delivery delays.\n\nBoeing's painful 2024 ended with the planemaker ranking as the biggest loser in the Dow Jones Industrial Average.\n\nIts share price dropped 31% last year — the worst of the index's 30 companies, according to Markets Insider data.\n\nThe planemaker was close to avoiding that title as Nike shares fell nearly 30% across the same period. As a whole, the Dow Jones was up 13%, led by Nvidia after its stock more than doubled.\n\nJust days into 2024 it was apparent that it was going to be a testing year for Boeing.\n\nOn January 5, an Alaska Airlines 737 Max lost a door plug in midair. The fact that the plane was delivered 66 days earlier suggested the problem originated with the manufacturer. That was later shown in the National Transportation Safety Board's preliminary report that said the plane left Boeing's factory missing key bolts.\n\nThe incident sparked an overhaul of the company's processes and culture — and a wave of criticism from airline bosses.\n\nRegulators placed Boeing under further scrutiny too. The Federal Aviation Administration limited production of the 737 Max to 38 jets a month. Its administrator, Mike Whitaker, told Reuters last month he expects Boeing to take several months to get up to that number.\n\nIn March, Dave Calhoun stepped down as CEO. He was replaced in August by Kelly Ortberg, an industry veteran who signaled a return to prioritizing engineering over profit.\n\nOrtberg announced plans to be based in Seattle, Boeing's historic home, and visited factories.\n\nStill, the embattled company couldn't stay out of the headlines.\n\nIn September, its Starliner spacecraft returned to Earth uncrewed. The astronauts it took to the International Space Station were supposed to return after eight days, but problems with Starliner meant they are instead set to spend eight months in space.\n\nLater that month, some 30,000 Boeing workers went on strike, hampering production for seven weeks amid tense union negotiations. 737 Max production didn't restart until December.\n\nLate deliveries continued to irritate airline customers. During the strike, Ortberg announced further delays to Boeing's highly anticipated but yet-to-be-certified 777X jet.\n\nThe CEO also said Boeing would lay off 10% of its 170,000 employees.\n\nBoeing's biggest rival, Airbus, has seen its stock rise 14% over the past year.\n\nBank of America analysts estimated that the European planemaker delivered as many as 760 jets thanks to a big end-of-year push — slightly below Airbus' guidance of 770 planes.\n\nAt the end of November, Boeing had delivered less than half that number, at 318 jets.\n\nOrtberg has a plan to help level the playing field, including putting Boeing leaders on factory floors to help change the company's culture.\n\n\"This is a big ship that will take some time to turn, but when it does, it has the capacity to be great again,\" he said in a memo to staff.\n\n\"With the right focus and culture, we can be an iconic company and aerospace leader once again.\"\n\n2025 is set to be a pivotal year for Ortberg's plan to help move the company forward from last year's woes.\n\nNew year, new Boeing?\n\nRead the original article on Business Insider",
    "word_count": 570
  },
  {
    "title": "These hedge funds soared amid big gains for US stocks and the dollar",
    "url": "https://finance.yahoo.com/news/hedge-funds-soared-amid-big-164000834.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Hedge funds scored hefty returns in 2024, when U.S. stocks and the dollar dominated global markets. Despite an election-fueled \"America first\" narrative in the broader market, some diversified funds still notched outsized gains.\n\nTop hedge funds put up big numbers in 2024, which was dominated by U.S. markets that got a jolt from Donald Trump's presidential election victory.\n\nDespite an \"America first\" narrative that helped boost the S&P 500 23% and the U.S. dollar index by about 7% last year, some multi-strategy funds with bets across different asset classes and geographies saw outsized gains.\n\nFor example, Discovery Capital Management soared 52%, a person familiar with the matter said, confirming other reports. The hedge fund declined to comment.\n\nThat builds on top of a 48% surge in 2023, making it one of the best hedge funds on Wall Street that year, according to Bloomberg.\n\nMeanwhile, D.E. Shaw's Oculus, a macro-oriented multi-strategy fund, returned 36.1% in 2024, and the Composite fund, its largest multi-strategy fund, returned 18%, according to a person familiar with the firm’s results. D.E. Shaw declined to comment.\n\nWhile their performance is often compared to the S&P 500's, hedge funds point out that they don't benchmark themselves to the large-cap U.S. stock index and instead seek to hedge against market downside while providing consistent, risk-adjusted gains that aren't necessarily correlated with the S&P 500.\n\nIn addition, hedge funds often employ different strategies across various offerings. Citadel's flagship Wellington multi-strategy fund returned 15.1% in 2024, a person familiar with the matter confirmed, while its Tactical Trading fund returned 22.3%, and its Equities fund scored an 18% gain. Citadel declined to comment.\n\nElsewhere, Millennium Management climbed 15%, according to reports. The hedge fund didn't immediately respond to requests for comment.\n\nWith such gains, those funds were on track to outperform their peers. Through the first 11 months of 2024, hedge funds overall averaged a 10.7% return, according to the latest data from PivotalPath cited by Reuters. That's up from a 5.7% average return in the same period in 2023.\n\nAnd among global hedge funds taking long and short bets on stocks last year, the total weighted average return came in at 12.75%, according to a private Goldman Sachs note that was seen by Reuters.\n\n\"It could be argued that 2024 was the year of the stock picker, with equity hedge funds playing dispersion well and really leaning into creative shorting strategies and a careful use of leverage to drive returns,\" said PivotalPath CEO Jon Caplis told Reuters.\n\nThis story was originally featured on Fortune.com",
    "word_count": 423
  },
  {
    "title": "AI stocks to watch, Apple TV tries free, and the Chips Act scramble: Tech roundup",
    "url": "https://finance.yahoo.com/news/ai-stocks-watch-apple-tv-140000580.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "kinjavideo-197409\n\nBig Tech stocks could have another big year in 2025.\n\nNvidia (NVDA), Amazon (AMZN), Alphabet (GOOGL), and Apple (AAPL) could continue to be some of the biggest winners of the artificial intelligence-driven stock boom, David Dietze, senior portfolio strategist at Peapack Private Wealth Management, said in the latest episode of Quartz AI Factor, a video series set at the Nasdaq MarketSite.\n\nRead More\n\nApple (AAPL) announced Monday that its video streaming service, Apple TV+, will be free worldwide this upcoming weekend, allowing anyone with an Apple ID to access the platform’s shows.\n\nRead More\n\nBig Tech is spending billions on artificial intelligence as demand grows for computing power and more advanced capabilities.\n\nMicrosoft (MSFT), Meta (META), Google (GOOGL), and Amazon (AMZN) spent a combined $125 billion on investing in and running AI data centers between January and August 2024, according to a JPMorgan (JPM) report citing New Street Research. The research shows both total AI capital expenditures and total data center operating costs, which include “cash operating expenses, software, depreciation, and electricity.”\n\nRead More\n\nApple (AAPL) is giving its Chinese customers a discount on iPhones as it competes with homegrown rivals such as Huawei.\n\nThe iPhone maker is offering a discount of up to 500 Chinese yuan, or $68.50, on its latest iPhone models when customers use “eligible payment methods,” according to the Apple website. The 500 yuan discount applies to the iPhone 16 Pro and iPhone 16 Pro Max, while the iPhone 16 and iPhone 16 Plus will be discounted by 400 yuan during the promotion, which runs from January 4 to 7.\n\nRead More\n\nTech giant Apple (AAPL) has agreed to pay $95 million to settle a proposed cash action lawsuit over allegations that it used its virtual assistant to eavesdrop on iPhone users.\n\nRead More\n\nJust when you thought your toaster couldn’t get any smarter, CES 2025 is about to prove you wrong. The world’s biggest tech show returns to Las Vegas from January 7-10, promising to stuff artificial intelligence into literally everything that has a power button.\n\nRead More\n\nAs the Biden administration prepares to pass power to President-elect Donald Trump, U.S. chipmakers are rushing to finalize federal funding.\n\nIn 2022, President Joe Biden signed the bipartisan CHIPS and Science Act to boost semiconductor manufacturing, research, and development in the U.S. The $280 billion package includes $52 billion in subsidies for chips.\n\nRead More\n\nElon Musk’s Starlink is set to give Ukraine “uninterrupted” service through its satellite network through a partnership with Kyivstar (VEON), the country’s largest mobile operator.\n\nRead More\n\nkinjavideo-197411\n\nDavid Dietze of Peapack Private Wealth Management says capital expenditures are no longer enough and AI companies must deliver tangible cash flows\n\nkinjavideo-197410\n\nDavid Dietze of Peapack Private Wealth Management on the companies powering the AI revolution — and who’s cashing in\n\nFor the latest news, Facebook, Twitter and Instagram.",
    "word_count": 477
  },
  {
    "title": "Wall Street’s Top Banks Just Abandoned a Once Popular Alliance",
    "url": "https://finance.yahoo.com/news/wall-street-top-banks-just-140000186.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "S&P Global price target lowered to $580 from $590 at Oppenheimer",
    "url": "https://finance.yahoo.com/news/p-global-price-target-lowered-130534578.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Oppenheimer lowered the firm’s price target on S&P Global to $580 from $590 and keeps an Outperform rating on the shares as part of a Q4 earnings preview. The weak Q4 issuance expectation didn’t appear to materialize, and Opco’s proprietary tracker indicates that issuance bettered expectations, the analyst tells investors in a research note. The firm forecast that S&P Global’s and Moody’s Q4 Ratings revenues grew 13% and 22% year-over-year, respectively, higher than the consensus estimates of 11% and 7%. It expects Moody’s Street estimates to rise going into the print. However, for the stocks to work on the print and in 2025, the 2025 guidance and results throughout the year have to exceed investor expectations, contends Oppenheimer.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee Insiders’ Hot Stocks on TipRanks >>\n\nRead More on SPGI:\n\nIs Amgen (NASDAQ:AMGN) a High-Quality Dividend Stock on Sale?\n\nCan Morgan Stanley (NYSE:MS) Stock Run Higher?\n\nMoody’s initiated with a Buy at Citi\n\nS&P Global initiated with a Buy at Citi\n\nMicrosoft’s Financial Strength and Growth Prospects Make It a Strong Buy for Investors",
    "word_count": 213
  },
  {
    "title": "Tractor Supply target adjusted for stock split at Evercore ISI",
    "url": "https://finance.yahoo.com/news/tractor-supply-target-adjusted-stock-125515043.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Evercore ISI lowered the firm’s price target on Tractor Supply (TSCO) to $58 from $290 and keeps an In Line rating on the shares as the firm adjusted its target to reflect the 5-for-1 stock split that occurred on December 20. The firm made no changes to any of its financial assumptions or outlook based on the adjustment to the share count, the analyst noted.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on TSCO:\n\nTractor Supply closes acquistion of Allivet\n\nTractor Supply target adjusted for stock split at Barclays\n\nVOO ETF Update, 12/30/2024\n\nSPY ETF Update, 12/27/2024\n\nSPY ETF Update, 12/24/2024",
    "word_count": 144
  },
  {
    "title": "Jobs Report, Fed Minutes, Delta Earnings: What to Watch Next Week",
    "url": "https://finance.yahoo.com/m/539777b7-ba2e-3d67-baf5-9b4f269daa4a/jobs-report-fed-minutes-.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Q3 Earnings Highlights: Coupang (NYSE:CPNG) Vs The Rest Of The Online Retail Stocks",
    "url": "https://finance.yahoo.com/news/q3-earnings-highlights-coupang-nyse-090904592.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "As the Q3 earnings season wraps, let’s dig into this quarter’s best and worst performers in the online retail industry, including Coupang (NYSE:CPNG) and its peers.\n\nConsumers ever rising demand for convenience, selection, and speed are secular engines underpinning ecommerce adoption. For years prior to Covid, ecommerce penetration as a percentage of overall retail would grow 1-2% annually, but in 2020 adoption accelerated by 5%, reaching 25%, as increased emphasis on convenience drove consumers to structurally buy more online. The surge in buying caused many online retailers to rapidly grow their logistics infrastructures, preparing them for further growth in the years ahead as consumer shopping habits continue to shift online.\n\nThe 6 online retail stocks we track reported a strong Q3. As a group, revenues beat analysts’ consensus estimates by 2.2% while next quarter’s revenue guidance was 0.7% below.\n\nThankfully, share prices of the companies have been resilient as they are up 5.7% on average since the latest earnings results.\n\nFounded in 2010 by Harvard Business School student Bom Kim, Coupang (NYSE:CPNG) is an e-commerce giant often referred to as the \"Amazon of South Korea\".\n\nCoupang reported revenues of $7.87 billion, up 27.2% year on year. This print exceeded analysts’ expectations by 1.4%. Overall, it was a strong quarter for the company with a solid beat of analysts’ EBITDA estimates and solid growth in its buyers.\n\n“This quarter we continued the strong momentum we’ve seen throughout this year, delivering robust growth in revenues and margins,” said Gaurav Anand, CFO of Coupang.\n\nUnsurprisingly, the stock is down 16.5% since reporting and currently trades at $22.45.\n\nWe think Coupang is a good business, but is it a buy today? Read our full report here, it’s free.\n\nKnown for its glass tower car vending machines, Carvana (NYSE:CVNA) provides a convenient automotive shopping experience by offering an online platform for buying and selling used cars.\n\nCarvana reported revenues of $3.66 billion, up 31.8% year on year, outperforming analysts’ expectations by 5.3%. The business had an exceptional quarter with an impressive beat of analysts’ EBITDA estimates.\n\nCarvana achieved the biggest analyst estimates beat and fastest revenue growth among its peers. Although it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 8.5% since reporting. It currently trades at $189.81.\n\nIs now the time to buy Carvana? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 2002 by Niraj Shah, Wayfair (NYSE:W) is a leading online retailer of mass-market home goods in the US, UK, Canada, and Germany.\n\nWayfair reported revenues of $2.88 billion, down 2% year on year, in line with analysts’ expectations. It was a slower quarter as it posted a significant miss of analysts’ number of active customers estimates and a decline in its buyers.\n\nWayfair delivered the weakest performance against analyst estimates and slowest revenue growth in the group. The company reported 21.7 million active buyers, down 2.7% year on year. Interestingly, the stock is up 7.5% since the results and currently trades at $46.06.\n\nRead our full analysis of Wayfair’s results here.\n\nFounded by Ryan Cohen, who later became known for his involvement in GameStop, Chewy (NYSE:CHWY) is an online retailer specializing in pet food, supplies, and healthcare services.\n\nChewy reported revenues of $2.88 billion, up 4.8% year on year. This result beat analysts’ expectations by 0.7%. Overall, it was a very strong quarter as it also recorded a solid beat of analysts’ EBITDA estimates.\n\nThe stock is up 4.2% since reporting and currently trades at $34.99.\n\nRead our full, actionable report on Chewy here, it’s free.\n\nLaunched in 2003 by software engineers Michael Mente and Mike Karanikolas, Revolve (NASDAQ:RVLV) is a fashion retailer leveraging social media and a community of fashion influencers to drive its merchandising strategy.\n\nRevolve reported revenues of $283.1 million, up 9.9% year on year. This number topped analysts’ expectations by 4.4%. It was a very strong quarter as it also produced an impressive beat of analysts’ EBITDA estimates and a narrow beat of analysts’ number of active customers estimates.\n\nThe company reported 2.63 million active buyers, up 4.7% year on year. The stock is up 28.6% since reporting and currently trades at $33.47.\n\nRead our full, actionable report on Revolve here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 899
  },
  {
    "title": "Unpacking Q3 Earnings: Hain Celestial (NASDAQ:HAIN) In The Context Of Other Shelf-Stable Food Stocks",
    "url": "https://finance.yahoo.com/news/unpacking-q3-earnings-hain-celestial-090849049.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "As the Q3 earnings season comes to a close, it’s time to take stock of this quarter’s best and worst performers in the shelf-stable food industry, including Hain Celestial (NASDAQ:HAIN) and its peers.\n\nAs America industrialized and moved away from an agricultural economy, people faced more demands on their time. Packaged foods emerged as a solution offering convenience to the evolving American family, whether it be canned goods or snacks. Today, Americans seek brands that are high in quality, reliable, and reasonably priced. Furthermore, there's a growing emphasis on health-conscious and sustainable food options. Packaged food stocks are considered resilient investments. People always need to eat, so these companies can enjoy consistent demand as long as they stay on top of changing consumer preferences. The industry spans from multinational corporations to smaller specialized firms and is subject to food safety and labeling regulations.\n\nThe 20 shelf-stable food stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates while next quarter’s revenue guidance was 5.7% below.\n\nWhile some shelf-stable food stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.6% since the latest earnings results.\n\nSold in over 75 countries around the world, Hain Celestial (NASDAQ:HAIN) is a natural and organic food company whose products range from snacks to teas to baby food.\n\nHain Celestial reported revenues of $394.6 million, down 7.2% year on year. This print was in line with analysts’ expectations, but overall, it was a softer quarter for the company with a significant miss of analysts’ adjusted operating income estimates.\n\n“Our performance in the first quarter built upon the momentum from our foundational year by further streamlining our portfolio and operational footprint, enabling us to deliver gross margin expansion,” said Wendy Davidson, Hain Celestial President and CEO.\n\nUnsurprisingly, the stock is down 30.9% since reporting and currently trades at $6.15.\n\nRead our full report on Hain Celestial here, it’s free.\n\nBest known for its portfolio of powerhouse breakfast cereal brands, General Mills (NYSE:GIS) is a packaged foods company that has also made a mark in cereals, baking products, and snacks.\n\nGeneral Mills reported revenues of $5.24 billion, up 2% year on year, outperforming analysts’ expectations by 1.9%. The business had a very strong quarter with a solid beat of analysts’ EBITDA estimates and an impressive beat of analysts’ gross margin estimates.\n\nAlthough it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 3.6% since reporting. It currently trades at $63.54.\n\nIs now the time to buy General Mills? Access our full analysis of the earnings results here, it’s free.\n\nBest known for its SuperPretzel soft pretzels and ICEE frozen drinks, J&J Snack Foods (NASDAQ:JJSF) produces a range of snacks and beverages and distributes them primarily to supermarket and food service customers.\n\nJ&J Snack Foods reported revenues of $426.8 million, down 3.9% year on year, in line with analysts’ expectations. It was a disappointing quarter as it posted a significant miss of analysts’ EBITDA and gross margin estimates.\n\nAs expected, the stock is down 11.3% since the results and currently trades at $153.79.\n\nRead our full analysis of J&J Snack Foods’s results here.\n\nFounded in 1919 as Nebraska Consolidated Mills in Omaha, Nebraska, Conagra Brands today (NYSE:CAG) boasts a diverse portfolio of packaged foods brands that includes everything from whipped cream to jarred pickles to frozen meals.\n\nConagra reported revenues of $3.20 billion, flat year on year. This number topped analysts’ expectations by 1.5%. Taking a step back, it was a mixed quarter as it also produced a solid beat of analysts’ organic revenue estimates but full-year EPS guidance missing analysts’ expectations.\n\nThe stock is up 2% since reporting and currently trades at $27.91.\n\nRead our full, actionable report on Conagra here, it’s free.\n\nFounded in 1895, Post (NYSE:POST) is a packaged food company known for its namesake breakfast cereal and healthier-for-you snacks.\n\nPost reported revenues of $2.01 billion, up 3.3% year on year. This result beat analysts’ expectations by 2.2%. Overall, it was a strong quarter as it also produced an impressive beat of analysts’ EPS estimates and a decent beat of analysts’ adjusted operating income estimates.\n\nThe stock is up 6.9% since reporting and currently trades at $115.36.\n\nRead our full, actionable report on Post here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 915
  },
  {
    "title": "Industrial Packaging Q3 Earnings: International Paper (NYSE:IP) is the Best in the Biz",
    "url": "https://finance.yahoo.com/news/industrial-packaging-q3-earnings-international-090822582.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Let’s dig into the relative performance of International Paper (NYSE:IP) and its peers as we unravel the now-completed Q3 industrial packaging earnings season.\n\nIndustrial packaging companies have built competitive advantages from economies of scale that lead to advantaged purchasing and capital investments that are difficult and expensive to replicate. Recently, eco-friendly packaging and conservation are driving customers preferences and innovation. For example, plastic is not as desirable a material as it once was. Despite being integral to consumer goods ranging from beer to toothpaste to laundry detergent, these companies are still at the whim of the macro, especially consumer health and consumer willingness to spend.\n\nThe 9 industrial packaging stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nAmidst this news, share prices of the companies have had a rough stretch. On average, they are down 6% since the latest earnings results.\n\nEstablished in 1898, International Paper (NYSE:IP) produces containerboard, pulp, paper, and materials used in packaging and printing applications.\n\nInternational Paper reported revenues of $4.69 billion, up 1.6% year on year. This print was in line with analysts’ expectations, and overall, it was an exceptional quarter for the company with an impressive beat of analysts’ EPS and EBITDA estimates.\n\n\"Our third quarter earnings are above our outlook,\" said Chairman and CEO Andy Silvernail.\n\nInterestingly, the stock is up 8.4% since reporting and currently trades at $53.16.\n\nIs now the time to buy International Paper? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1959, Packaging Corporation of America (NYSE: PKG) produces containerboard and corrugated packaging products, also offering displays and protective packaging solutions.\n\nPackaging Corporation of America reported revenues of $2.18 billion, up 12.7% year on year, outperforming analysts’ expectations by 4.4%. The business had an exceptional quarter with a solid beat of analysts’ sales volume estimates and an impressive beat of analysts’ adjusted operating income estimates.\n\nPackaging Corporation of America scored the biggest analyst estimates beat and fastest revenue growth among its peers. The market seems content with the results as the stock is up 4% since reporting. It currently trades at $225.21.\n\nIs now the time to buy Packaging Corporation of America? Access our full analysis of the earnings results here, it’s free.\n\nEstablished in 1987, Silgan Holdings (NYSE:SLGN) is a supplier of rigid packaging for consumer goods products, specializing in metal containers, closures, and plastic packaging.\n\nSilgan Holdings reported revenues of $1.75 billion, down 3.2% year on year, falling short of analysts’ expectations by 4.6%. It was a disappointing quarter as it posted a significant miss of analysts’ adjusted operating income estimates.\n\nSilgan Holdings delivered the weakest performance against analyst estimates in the group. The stock is flat since the results and currently trades at $51.05.\n\nRead our full analysis of Silgan Holdings’s results here.\n\nFounded in 1960, Sealed Air Corporation (NYSE: SEE) specializes in the development and production of protective and food packaging solutions, serving a variety of industries.\n\nSealed Air reported revenues of $1.35 billion, down 2.7% year on year. This print met analysts’ expectations. It was a strong quarter as it also produced a solid beat of analysts’ adjusted operating income estimates and an impressive beat of analysts’ EPS estimates.\n\nThe stock is down 10.2% since reporting and currently trades at $33.29.\n\nRead our full, actionable report on Sealed Air here, it’s free.\n\nFormerly Crown Cork & Seal, Crown Holdings (NYSE:CCK) produces packaging products for consumer marketing companies, including food, beverage, household, and industrial products.\n\nCrown Holdings reported revenues of $3.07 billion, flat year on year. This number was in line with analysts’ expectations. Overall, it was a strong quarter as it also logged a solid beat of analysts’ adjusted operating income estimates and full-year EPS guidance exceeding analysts’ expectations.\n\nThe stock is down 13.5% since reporting and currently trades at $81.21.\n\nRead our full, actionable report on Crown Holdings here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Top 6 Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 841
  },
  {
    "title": "Specialty Equipment Distributors Stocks Q3 Earnings: Richardson Electronics (NASDAQ:RELL) Best of the Bunch",
    "url": "https://finance.yahoo.com/news/specialty-equipment-distributors-stocks-q3-090757503.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how specialty equipment distributors stocks fared in Q3, starting with Richardson Electronics (NASDAQ:RELL).\n\nHistorically, specialty equipment distributors have boasted deep selection and expertise in sometimes narrow areas like single-use packaging or unique lighting equipment. Additionally, the industry has evolved to include more automated industrial equipment and machinery over the last decade, driving efficiencies and enabling valuable data collection. Specialty equipment distributors whose offerings keep up with these trends can take share in a still-fragmented market, but like the broader industrials sector, this space is at the whim of economic cycles that impact the capital spending and manufacturing propelling industry volumes.\n\nThe 10 specialty equipment distributors stocks we track reported a slower Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nWhile some specialty equipment distributors stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.8% since the latest earnings results.\n\nFounded in 1947, Richardson Electronics (NASDAQ:RELL) is a distributor of power grid and microwave tubes as well as consumables related to those products.\n\nRichardson Electronics reported revenues of $53.73 million, up 2.2% year on year. This print exceeded analysts’ expectations by 8.7%. Overall, it was an incredible quarter for the company with a solid beat of analysts’ EPS estimates and an impressive beat of analysts’ EBITDA estimates.\n\n“Our first quarter results are encouraging and benefited from the strategies underway to drive sales growth, improve profitability, and generate positive operating cash flow,” said Edward J. Richardson, Chairman, CEO, and President.\n\nRichardson Electronics scored the biggest analyst estimates beat of the whole group. Unsurprisingly, the stock is up 10.8% since reporting and currently trades at $14.28.\n\nIs now the time to buy Richardson Electronics? Access our full analysis of the earnings results here, it’s free.\n\nFormerly a subsidiary of Hertz Corporation and with a logo that still bears some similarities to its former parent, Herc Holdings (NYSE:HRI) provides equipment rental and related services to a wide range of industries.\n\nHerc reported revenues of $965 million, up 6.3% year on year, outperforming analysts’ expectations by 3.6%. The business had a strong quarter with an impressive beat of analysts’ Equipment rentals revenue estimates and full-year EBITDA guidance slightly topping analysts’ expectations.\n\nThe market seems happy with the results as the stock is up 10.5% since reporting. It currently trades at $187.\n\nIs now the time to buy Herc? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1984, Alta Equipment Group (NYSE:ALTG) is a provider of industrial and construction equipment and services across the Midwest and Northeast United States.\n\nAlta reported revenues of $448.8 million, down 3.7% year on year, falling short of analysts’ expectations by 6.5%. It was a disappointing quarter as it posted and a significant miss of analysts’ adjusted operating income estimates.\n\nAlta delivered the weakest performance against analyst estimates in the group. As expected, the stock is down 18.4% since the results and currently trades at $6.55.\n\nRead our full analysis of Alta’s results here.\n\nFounded in 1980, Titan Machinery (NASDAQ:TITN) is a distributor of agricultural and construction equipment across the United States and Europe.\n\nTitan Machinery reported revenues of $679.8 million, down 2.1% year on year. This number surpassed analysts’ expectations by 0.7%. It was a strong quarter as it also logged a solid beat of analysts’ EBITDA and EPS estimates.\n\nThe stock is down 10.1% since reporting and currently trades at $13.85.\n\nRead our full, actionable report on Titan Machinery here, it’s free.\n\nInspired by a family gas station, Custom Truck One Source (NYSE:CTOS) is a distributor of trucks and heavy equipment.\n\nCustom Truck One Source reported revenues of $447.2 million, up 3% year on year. This result met analysts’ expectations. However, it was a softer quarter as it logged a significant miss of analysts’ adjusted operating income estimates.\n\nCustom Truck One Source pulled off the highest full-year guidance raise among its peers. The stock is up 21.6% since reporting and currently trades at $4.84.\n\nRead our full, actionable report on Custom Truck One Source here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our 9 Best Market-Beating Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 894
  },
  {
    "title": "Lowe's (LOW): Buy, Sell, or Hold Post Q3 Earnings?",
    "url": "https://finance.yahoo.com/news/lowes-low-buy-sell-hold-090711107.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Lowe’s 16.7% return over the past six months has outpaced the S&P 500 by 10.4%, and its stock price has climbed to $248.99 per share. This performance may have investors wondering how to approach the situation.\n\nIs now the time to buy Lowe's, or should you be careful about including it in your portfolio? Get the full breakdown from our expert analysts, it’s free.\n\nDespite the momentum, we're swiping left on Lowe's for now. Here are three reasons why we avoid LOW and a stock we'd rather own.\n\nFounded in North Carolina as Lowe's North Wilkesboro Hardware, the company is a home improvement retailer that sells everything from paint to tools to building materials.\n\nA company’s long-term sales performance signals its overall quality. Even a bad business can shine for one or two quarters, but a top-tier one grows for years. Unfortunately, Lowe’s 3.1% annualized revenue growth over the last five years was sluggish. This fell short of our benchmark for the consumer retail sector.\n\nA retailer’s store count often determines how much revenue it can generate.\n\nLowe's operated 1,747 locations in the latest quarter. Over the last two years, the company has generally closed its stores, averaging 5.7% annual declines.\n\nWhen a retailer shutters stores, it usually means that brick-and-mortar demand is less than supply, and it is responding by closing underperforming locations to improve profitability.\n\nSame-store sales is an industry measure of whether revenue is growing at existing stores, and it is driven by customer visits (often called traffic) and the average spending per customer (ticket).\n\nLowe’s demand has been shrinking over the last two years as its same-store sales have averaged 3.9% annual declines.\n\nLowe’s business quality ultimately falls short of our standards. With its shares topping the market in recent months, the stock trades at 20.1× forward price-to-earnings (or $248.99 per share). At this valuation, there’s a lot of good news priced in - we think there are better stocks to buy right now. We’d recommend looking at CrowdStrike, the most entrenched endpoint security platform.\n\nThe Trump trade may have passed, but rates are still dropping and inflation is still cooling. Opportunities are ripe for those ready to act - and we’re here to help you pick them.\n\nGet started by checking out our Top 9 Market-Beating Stocks. This is a curated list of our High Quality stocks that have generated a market-beating return of 175% over the last five years.\n\nStocks that made our list in 2019 include now familiar names such as Nvidia (+2,691% between September 2019 and September 2024) as well as under-the-radar businesses like United Rentals (+550% five-year return). Find your next big winner with StockStory today for free.",
    "word_count": 447
  },
  {
    "title": "This is what could drive consumer spending in 2025",
    "url": "https://finance.yahoo.com/video/could-drive-consumer-spending-2025-214717345.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  },
  {
    "title": "Wall Street strategists' 2025 New Year's resolutions for investors",
    "url": "https://finance.yahoo.com/video/wall-street-strategists-2025-years-170000264.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  },
  {
    "title": "Markets have 'more room to run' in 2025: Strategist",
    "url": "https://finance.yahoo.com/video/markets-more-room-run-2025-221349316.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  },
  {
    "title": "Can the Magnificent 7 keep dominating in 2025?",
    "url": "https://finance.yahoo.com/video/magnificent-7-keep-dominating-2025-171331442.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  },
  {
    "title": "Minimum wage just went up in these 21 states",
    "url": "https://finance.yahoo.com/news/minimum-wage-just-went-up-in-these-21-states-133030468.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Workers across 21 states welcomed the new year by seeing their hourly minimum wages rise.\n\nThe federal minimum wage is $7.25 an hour, a rate that has remained unchanged since July 2009. During his presidential campaign, President Biden pledged to raise the federal minimum wage to $15 an hour, though that promise never came to fruition.\n\nIn the meantime, states have taken measures into their own hands over the past 15 years.\n\nStarting Jan. 1, 2025, three states — Delaware, Illinois, and Rhode Island — joined the group of states with a $15 minimum wage, thanks to ballot initiatives approved by voters and later signed into law by their legislators.\n\nResidents of Nebraska and Missouri also approved ballot measures that bumped up their minimum wages by over $1.00/hour to $13.50 and $13.75, respectively.\n\nThe other states with minimum wage increases put into effect by their own residents were New York, which now has a $15.50 hourly rate — $16.50 for those working in New York City, Long Island, and Westchester County — and Michigan at $10.56.\n\nIncoming President Trump did not commit to raising the minimum wage on a federal level but did signal a willingness to consider it further.\n\n“I’d want to speak to the governors,” Trump told NBC News. “And the other thing that is very complicated about minimum wage is places are so different. Mississippi and Alabama and great places are very different than New York or California, I mean in terms of the cost of living and other things. So it would be nice to have just a minimum wage for the whole country, but it wouldn’t work because you have places ... where a minimum wage which is at $8 or $9 ... might have very little effect because the cost of living in certain places is really low.”\n\nThere are 20 states, along with the District of Columbia, that adjust their minimum wage on an annual basis according to inflation, though the effective dates are often mid-year rather than at the start of the year.\n\nAlabama, Georgia, Louisiana, Mississippi, South Carolina, Tennessee, and Wyoming are the only seven states that either have no minimum wage law on a state level or have one below the federal minimum.\n\n—\n\nAdriana Belmonte is a reporter and editor covering politics and healthcare policy for Yahoo Finance. You can follow her on X @adrianambells and reach her at adriana@yahoofinance.com.\n\nClick here for the latest economic news and indicators to help inform your investing decisions\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 426
  },
  {
    "title": "Listing a home in 2025? Here are the designs experts say buyers want.",
    "url": "https://finance.yahoo.com/news/listing-a-home-in-2025-here-are-the-designs-experts-say-buyers-want-124007332.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "If you’re planning on listing your home this year, it’s time to think about getting cozy.\n\nMinimalist interiors with gray laminate flooring, shiny silver fixtures, and aggressively neutral paint colors that dominated interior design in the 2010s and early 2020s are no longer drawing in prospective home buyers.\n\nWhat’s working instead, real estate agents and home stagers say: warmer-toned hues, textured elements, and dollops of character like accent walls.\n\n“Buyers no longer really want that modern box that was so popular back in 2015 or 2016,” said Walter Franco Jr., a real estate agent in Los Angeles.\n\nRicci Taylor, owner of Atlanta-based staging and furniture leasing company Everly Design Co., said she’s noticed earthy shades of brown and accent colors like cinnamon and evergreen catching on with clients, along with more rounded furniture silhouettes and textured metals. After spending pandemic lockdowns cooped up in stark spaces, many buyers are now seeking designs that remind them of nature.\n\n“It’s all about that feng shui — bringing the outside in,” Taylor said. “I think you’re going to be seeing more bedrooms, offices, and accent walls being done with these warmer colors.”\n\nCase in point: Paint giant Pantone declared “Mocha Mousse” its 2025 color of the year. The shade is described as “a warming, brown hue imbued with richness” and “answering our desire for comfort.”\n\nJennifer Roberts, a real estate broker at Coldwell Banker Warburg in New York, said her clients are increasingly prioritizing calming, muted wall colors and subtle pops of color that make their homes feel like oases.\n\n“They want to walk into the apartment and shut out the world,” said Roberts, who does most of her business in Manhattan’s Upper East and Upper West Side neighborhoods.\n\nAnother shift: After years of open-concept floorplans dominating, she’s noticed more buyers once again seeking walls. In some cases, apartments with formal dining rooms are winning out over layouts with more casual options like kitchen islands.\n\n“They want distinct rooms,” Roberts said. “It provides more cozy spaces.”\n\nIf you do live in a minimalist box, however, there’s no reason to fear that your home will never sell. Whites and neutrals remain popular in living areas, and simple upgrades like swapping out light fixtures and painting cabinets can enhance a home’s look at a fraction of the cost of a gut renovation, Taylor said.\n\nHanny Jahns, founder and CEO of staging and interior design company Stageasily, said airy, open homes are still sought after in her Las Vegas market. There, many people are favoring modern designs with character, like the work of potter and designer Jonathan Adler, that can be \"a little bit fun and a little bit retro,\" she said.\n\nIn larger homes, she steers clients toward bigger furniture pieces from the likes of Restoration Hardware. But counterintuitively, those oversized pieces can also work in smaller spaces by making them look larger, she said.\n\nAmong buyers, neutral, natural color palettes aren't going anywhere, but she too is avoiding heavily gray looks for now.\n\n\"Gray is kind of becoming the new beige,\" she said. \"People are staying away from that.\"\n\nClaire Boston is a senior reporter for Yahoo Finance covering housing, mortgages, and home insurance.",
    "word_count": 530
  },
  {
    "title": "Beer and alcohol stocks face bigger challenges as US surgeon general links drinking to cancer risk",
    "url": "https://finance.yahoo.com/news/beer-and-alcohol-stocks-face-bigger-challenges-as-us-surgeon-general-links-drinking-to-cancer-risk-202756782.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Booze makers are getting an early hangover after the US surgeon general called for the addition of a warning label to alcoholic drinks.\n\nOn Friday, shares of beer and alcohol giants sank across the board. Diageo (DGE.L) is down 4% and Pernod Ricard (PER.HA) is down nearly 3%, while Molson Coors (TAP) and Anheuser-Busch InBev (BUD) are both down 2%. Brown-Forman (BF-B) and Constellation Brands (STZ) are down around 1% each.\n\nEarlier this morning, Surgeon General Vivek Murthy released a 20-plus-page advisory that linked the risk of cancer to drinking alcohol and called for adding a warning label to beer, wine, and spirits like those on cigarette packs.\n\nAs of now, South Korea requires a cancer-specific label on alcohol, while Ireland signed a new law to do so starting in 2026, per Murthy.\n\nAccording to the advisory, nearly 100,000 US cancer cases and 20,000 cancer deaths have been linked to alcohol consumption each year. It noted seven types of cancer were linked, including breast, liver, and colon cancer.\n\nYahoo Finance reached out to Molson Coors, Anheuser-Busch, and Constellation Brands for comment, but did not hear back.\n\nWith President-elect Donald Trump's administration set to take office in 17 days, the true impact of this advisory is up in the air.\n\n\"We're in the middle of changing administrations ... it's unclear how much leg there is to this into the new administration,\" S&P Ratings analyst Christopher Johnson told Yahoo Finance over the phone.\n\n\"If you actually end up with ... warning labels on the products, then that could have a more lasting impact on the growth outlook for the products.\"\n\nJohnson said a drop in alcohol consumption due to health risks is not at the same level as cigarette consumption, which has an \"industrywide view of volume declines.\"\n\n\"We're not there yet in terms of thinking about some kind of structural pressure on [alcohol] volumes related to health risk concerns,\" added Johnson. His team is also looking out for any attempt by the government to curb consumption with taxation (there have been no hints of new taxes so far).\n\n\"When those types of taxes do hit products ... there tends to be a one-time negative impact that then gets lapped and the consumer gets used to the new price point,\" he said.\n\nBump Williams of Bump Williams Consulting expects \"business goes on as usual\" following the news.\n\n\"From the manufacturing side, distributors have already diversified their portfolio well beyond just servicing the Beverage-Alcohol business and the Retailers will simply do as [they're] instructed to do by the law and regulations required in packaging,\" he told Yahoo Finance in an email.\n\nThe advisory is throwing a wrench in an already struggling sector. Challenges up against the industry include a decline in overall US consumption and premium-priced alcoholic beverages under pressure due to weaker consumer discretionary income, Johnson said.\n\nWilliams is also keeping an eye on potential tariffs under Trump that may cause price hikes.\n\nAll six of the alcohol companies mentioned above clocked negative stock performance in the past year, while the S&P 500 jumped 26%. Brown-Forman and Pernod Ricard led the losses with 34% and 31% drops, respectively.\n\nAccording to a Gallop Poll, nearly 60% of US adults say they have an occasion to drink alcohol, down from the historical trend of 63%, which dates back to 1939. A drop in consumption compared to 2022 has weighed on revenue growth, per Statista Market Insights, though overall revenue is up due partially to higher prices and inflation.\n\nMeanwhile, nonalcoholic beverages have been on the rise.\n\n\"Those factors continue to be much more relevant to our outlook for the sector right now than what the news that came out today might have on further pressure on volumes,\" Johnson said, adding that younger generations are \"already consuming less alcohol.\"\n\nSuntory CEO Takeshi Niinami, whose company is behind brands like Jim Bean and various Japanese whiskeys, said the business has to educate consumers that drinking in moderation is key.\n\n\"Heavy drinking is so bad, we have to talk about that,\" Niinami told Yahoo Finance's Opening Bid (listen in above). \"moderate drinking is good for you ... you can feel good and bond with your friends ... we have to demonstrate that we are contributing [to] society,\" he said.\n\n—\n\nBrooke DiPalma is a senior reporter for Yahoo Finance. Follow her on Twitter at @BrookeDiPalma or email her at bdipalma@yahoofinance.com.\n\nClick here for all of the latest retail stock news and events to better inform your investing strategy",
    "word_count": 751
  },
  {
    "title": "Mike Johnson reelected as House speaker after a new promise to work with Musk's 'DOGE'",
    "url": "https://finance.yahoo.com/news/mike-johnson-reelected-as-house-speaker-after-a-new-promise-to-work-with-musks-doge-201052316.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Mike Johnson was able to keep his spot atop the US House on Friday while seeming to offer minimal binding concessions to hard-right Republicans who had threatened his path to re-election.\n\nWhat Johnson did offer — in an announcement made just before the vote — was a promise to \"make meaningful spending reforms to eliminate trillions in waste, fraud, and abuse, and end the weaponization of government.\"\n\nIt is a new effort that Johnson says will also include the formation of a new working group of independent experts set to work directly with Elon Musk’s extra-governmental \"Department of Government Efficiency\" (DOGE).\n\nIt’s unclear what powers this new working group will have beyond publicizing its findings, but the promise clearly helped put Johnson over the top as the opposition to him slowly dwindled on Friday afternoon.\n\nJohnson was able to prevail in a narrow tally, gaining a bare majority of 218 votes. Hakeem Jeffries of New York was the Democratic choice and gained 215 votes.\n\nAs expected, a Kentucky Republican named Thomas Massie opposed Johnson and voted for Rep. Tom Emmer.\n\nThe proceedings saw moments of last-minute drama when Republicans Ralph Norman of South Carolina and Keith Self of Texas also initially voted for other candidates but then switched their votes after some arm-twisting behind closed doors.\n\nRep. Self told CNN afterward that he switched his vote after being promised concessions to allow House Freedom caucus members to be part of the process to negotiate some of the major bills in the months ahead.\n\nJohnson pledged as the day began that \"I don't make deals with anyone.\"\n\n\"I don't do anything in exchange for a vote other than commit to make this institution work as effectively and efficiently as possible,\" he told reporters as he entered the Capitol Friday.\n\nThe back-and-forth this week ended (for now at least) fears that Johnson would have to offer deep concessions on a range of issues to his right flank in order to maintain power.\n\nSome of the proposed changes might have made it harder for the Republicans to pass legislation in the coming weeks on a range of topics from the border to energy to taxes, as well as the coming debt ceiling deadline.\n\n“It certainly gives us hope and helps allay some fears we had,” offered analyst Ahmed Riesgo, Insigneo’s chief investment officer, in a live Yahoo Finance appearance shortly after the vote.\n\nBut others were more sanguine. Brian Gardner, Stifel’s chief Washington policy strategist, focused on the dissension and noted that some of the chaos \"is a signal about how difficult it is going to be for Republicans to be going forward.\"\n\nHe added that “investors overestimate how much power Republicans have up on Capitol Hill, especially in the House.”\n\nFriday’s vote came after a bumpy week where the dissatisfaction among many of Johnson’s colleagues was evident, a feeling that manifested in a wide array of ideas that could have given conservative Republicans more power in the coming Congress.\n\nOne of the key areas of contention was a 36-page House rules package that Johnson unveiled in recent days by saying its provisions were not up for debate.\n\nA key change in there actually solidifies Johnson by moving the threshold for opponents to oust him from a single member — a clause that former Rep. Matt Gaetz used to oust Kevin McCarthy — to nine members.\n\nAnother controversial change that Johnson was confronted with — but one he repeatedly parried away — was a push to appoint Rep. Chip Roy, a Texas Republican and leader of the hard-line group, as the chair of the powerful House Rules Committee.\n\nIn the end, Roy did not secure any public promise of the seat but voted for Johnson nonetheless.\n\nSuch a move would have undercut Johnson’s power as that committee — traditionally nicknamed the \"Speaker's committee\" — controls access to much of what is voted on on the House floor.\n\nIn his speech Friday after winning the gavel, Johnson said, “This is a momentous time in the history of our nation\" and spoke of the coming Congress's mission to be \"stewards\" of the American Revolution.\n\nJohnson’s quest was aided by Donald Trump. The president-elect endorsed Johnson earlier this week, made calls to lawmakers on his behalf, and then publicly congratulated him Friday afternoon — writing that \"Mike will be a Great Speaker, and our Country will be the beneficiary.\"\n\nThe immediate pressure for a conclusion to this issue came because the selection of a new speaker was needed before the House can take up official 2025 business, most pressingly certifying Trump’s election victory on Monday.\n\nThe issue that has dogged Johnson all week is that a small faction of House Republicans — whose importance was outsized given Johnson’s tight margins — remains upset about how Johnson has handled things like last month’s budget battle, where he ended up relying on Democrats’ votes in the face of GOP divisions.\n\nThe argument from Johnson and his allies all week has been that the realignment of power in Washington set for 2025 will make those issues moot, and that he is the best leader to shepherd through Trump’s agenda.\n\n\"No speaker is perfect, and no one will ever be,\" said Rep. Lisa McClain, the Michigan Republican, in her speech before formally nominating Johnson.\n\nShe added that the goal of the coming Congress is to “make progress” and enact President-elect Trump’s agenda.\n\nThis post has been updated with additional developments.\n\nBen Werschkul is Washington correspondent for Yahoo Finance.\n\nEvery Friday, Yahoo Finance's Rachelle Akuffo, Rick Newman, and Ben Werschkul bring you a unique look at how U.S. policy and government affects your bottom line on Capitol Gains. Watch or listen to Capitol Gains on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.\n\nClick here for political news related to business and money policies that will shape tomorrow's stock prices\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 991
  },
  {
    "title": "Rivian stock surges to start the year on better-than-expected EV deliveries",
    "url": "https://finance.yahoo.com/news/rivian-stock-surges-to-start-the-year-on-better-than-expected-ev-deliveries-173904321.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Rivian (RIVN) stock jumped more than 24% Friday as the EV maker reported better-than-expected vehicle sales for its quarter ending Dec. 31.\n\nRivian said Friday that it delivered nearly 14,200 EVs during the fourth quarter, bringing its yearly sales volume to roughly 51,580 electric trucks — within the company's prior guidance. Wall Street analysts had expected the company to deliver closer to 13,400 EVs for the period and 51,000 for the year.\n\nRivian stock had a rough 2024. Shares ended the year down 40% from 2023 and nearly 90% from their all-time high above $100 in the company's high-profile market debut in 2021.\n\nAfter its blockbuster IPO three years ago, the Amazon-backed EV maker has faced a mountain of obstacles: First, it grappled with a shortage of necessary computer chips; then, there was a wider market shift away from electric cars just as competition from mainstay Tesla (TSLA) was heating up. The company has undergone a massive cost-cutting campaign, slashing its workforce in multiple rounds of layoffs starting as early as 2022 and redesigning car components to make production less expensive.\n\nEven with those efforts, Rivian’s operating losses mounted in the past year. In its third quarter last year, Rivian’s revenue fell for the first time since it went public, dropping 35% to $874 million versus the $980 million expected by analysts as the company faced yet another production disruption thanks to a miscommunication with a key supplier.\n\nRivian’s fourth quarter deliveries number released Friday “affirms that supply issues were isolated to Q3,” RBC Capital Markets analyst Tom Narayan wrote in a note to shareholders Friday. Narayan holds a Neutral rating on the stock and sees shares hovering around $12 over the next 12 months. The stock was trading above $16 Friday.\n\nMeanwhile, CFRA analyst Garrett Nelson maintained his Sell rating on Rivian shares, with a price target of just $8, noting Rivian’s “bottom-line losses are likely to continue for the foreseeable future.”\n\nRivian will report its full fourth quarter results on Feb. 20.\n\nLaura Bratton is a reporter for Yahoo Finance. Follow her on X @LauraBratton5.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 373
  },
  {
    "title": "Ford sales jumped 4.2% last year, powered by F-Series trucks",
    "url": "https://finance.yahoo.com/news/ford-sales-jumped-42-last-year-powered-by-f-series-trucks-170253457.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Ford (F) posted a strong fourth quarter US report, one that capped off a strong year for the Dearborn, Mich.-based automaker.\n\nFord said US sales in Q4 rose 8.8% versus a year ago, powered by F-Series sales that jumped 21.1% in the quarter. For the year, Ford reported a 4.2% jump in US sales, totaling approximately 2.079 million vehicles. Ford rival GM posted a 4% jump in 2024 sales, resulting in 2.7 million vehicles sold.\n\nFord shares were up around 1% in midday trade.\n\nF-Series trucks again shouldered the load for Ford, achieving the status of the No. 1 selling truck in America for the 48th straight year.\n\n“The Ford F-Series best illustrates the company’s Freedom of Choice strategy with gas, diesel, hybrid and electric models. All of these F-Series versions saw year-over-year sales growth in the final month of 2024,” the company said in a statement.\n\nFord’s “electrified” segment — or vehicles using both hybrid and fully electric powertrains — jumped 38% in 2024, hitting 285,291 units sold.\n\nFord hybrid sales were the majority of that total, hitting a record 187,426 — up 40% over 2023. Maverick hybrid pickup sales made up nearly one-third of that amount.\n\nFord said each of its EVs set new sales records last year, with Mustang Mach-E totaling 51,745 units sold (up 27%), F-150 Lightning sales hitting 33,510 (up 39%), and E-Transit sales climbing to 12,610 (up 64%).\n\nMustang Mach-E Q4 sales hit a best-ever 16,119 vehicles sold, which Ford said made it the second-best-selling electric SUV behind only Tesla’s Model Y.\n\nThe success of Ford EVs comes as the company continues to lose money in its EV division, having pushed back the opening of some EV factories and canceled upcoming EVs like a full-size three-row SUV.\n\nOn the Lincoln side, the luxury brand saw Q4 sales jump 35.4%, with 2024 sales climbing 28.1%. The Aviator (up 62.3% for the year) and much-hyped Nautilus (up 50.2%) powered the gains.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 369
  },
  {
    "title": "Nvidia stock jumps, leads 'Magnificent 7' gains to start 2025 after end-of-year tech sell-off",
    "url": "https://finance.yahoo.com/news/nvidia-stock-jumps-leads-magnificent-7-gains-to-start-2025-after-end-of-year-tech-sell-off-154139053.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Nvidia stock (NVDA) led gains among the “Magnificent Seven” tech stocks to start the new year after a group-wide sell-off in the last days of 2024. Shares of the AI chipmaker rose 4.5% Friday after gaining roughly 3% the prior day.\n\nThat upswing followed a 4% dip between Christmas Eve and New Year’s Eve as megacap tech stocks dropped across the board in the absence of a “Santa Claus\" rally, where the stock market typically enjoys a surge between Dec. 24 and Jan. 2. Tesla (TSLA) stock plunged nearly 13% over that time frame, while Amazon (AMZN) and Microsoft (MSFT) dropped more than 4%. Meanwhile, Meta (META) and Google (GOOG) fell just under 4%, and Apple (AAPL) dropped 3%.\n\nEven with its December decline, Nvidia shares still ended 2024 up more than 150%. Wall Street analysts have remained bullish on the stock, estimating shares will rise to roughly $173 over the next year from their current level of $138, according to Yahoo Finance data.\n\nBank of America’s Vivek Arya told Brian Sozzi on the Opening Bid podcast Thursday that broader market forces and company-specific issues drove the sell-off in Nvidia stock late last year.\n\n\"What we have seen in the market is a rotation of money from semiconductors to software,\" Arya said, noting that the latter was less exposed to US trade restrictions on goods to and from China. He added that for Nvidia, \"the last two quarters have not been clean, really, because they're going through growing pains from one generation of product that was Hopper to the new generation of product.\"\n\nArya was referring to concerns surrounding delays in shipments of the company's new Blackwell artificial intelligence chips.\n\n\"In our view, these are short-term issues,\" he said. That could create a buying opportunity: While its Magnificent Seven peers are trading at two times their average earnings growth estimates for 2025, Arya noted that Nvidia shares are trading at less than one times the consensus earnings growth for the company this upcoming year.\n\nArya has a Buy rating on Nvidia stock and sees shares rising to $190 over the next 12 months.\n\nShares of Nvidia and its Magnificent Seven peers have benefited from investors' massive bets on artificial intelligence, as well as earnings growth. As Yahoo Finance's Josh Schafer reported, through roughly three-quarters of reports, the combination of Apple, Alphabet, Microsoft, Amazon, Meta, Tesla, and Nvidia grew earnings year over year by 33% in 2024, compared to just 4.2% growth for the other 493 S&P 500 companies, per FactSet data.\n\nTo be sure, skeptics warn of a bubble that could burst and send AI-fueled stocks tumbling if hype over the new technology fades and Big Tech's spending on artificial intelligence infrastructure wanes. Wall Street analysts overall remain convinced the AI enthusiasm will continue, however.\n\nTesla also notched a notable gain Friday, jumping more than 8%. Alphabet, Microsoft, and Meta rose around 1%, while Amazon spiked nearly 2%. Apple shares were roughly flat.\n\nLaura Bratton is a reporter for Yahoo Finance. Follow her on X @LauraBratton5.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 532
  },
  {
    "title": "Biden blocks US Steel's $14 billion sale to Japanese giant Nippon Steel",
    "url": "https://finance.yahoo.com/news/biden-blocks-us-steels-14-billion-sale-to-japanese-giant-nippon-steel-145927959.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "President Joe Biden on Friday blocked US Steel’s (X) $14 billion sale to Japanese giant Nippon Steel on national security concerns, creating new uncertainty for an iconic American steelmaker.\n\n\"This acquisition would place one of America’s largest steel producers under foreign control and create risk for our national security and our critical supply chains,\" President Biden said in a statement.\n\nThe stock of Pittsburgh-based US Steel dropped more than 7% in morning trading.\n\nUS Steel and Nippon in a joint statement suggested they would now pursue legal action following Biden's order, which they said did not \"present any credible evidence of a national security issue, making it clear this was a political decision.\"\n\n\"We are left with no choice but to take all appropriate action to protect our legal rights,\" the companies said in their statement, which argued that Biden's move sent \"a chilling message to any company based in a U.S. allied country contemplating significant investment in the United States.\"\n\nThe 124-year-old US Steel spent much of 2024 lobbying the Biden administration to approve the tie-up, which would have allowed the world’s fourth-largest steelmaker an entry into the US market.\n\nThe Japanese buyer committed to keep the US Steel name and Pittsburgh headquarters, but it couldn’t overcome concerns about the potential effect on union workers, domestic supply chains, and US national security.\n\nThe United Steelworkers union staunchly opposed the deal, arguing it would be bad for steelworkers and harm America's ability to produce steel.\n\nBiden sided with that view in the latest example of a protectionist tilt in Washington from both parties.\n\n\"We need major US companies representing the major share of US steelmaking capacity to keep leading the fight on behalf of America’s national interests,\" Biden said Friday.\n\nBiden was public about his opposition to the deal last year while he was still running for president. President-elect Donald Trump also opposed the acquisition and also vowed to block the deal.\n\nThe Committee on Foreign Investment in the United States (CFIUS), a federal interagency panel, spent months reviewing the acquisition for national security risks and was reportedly unable to reach a consensus before sending a report about the matter to Biden.\n\nIn his new executive order issued Friday, Biden is requiring the companies to abandon the deal in 30 days unless the date is extended by CFIUS.\n\nIt’s unclear if US Steel would look to find a new buyer.\n\n\"It's been a highly politicized process,\" Josh Spoores, CRU North American steel analyst, told Yahoo Finance.\n\nUS Steel and Nippon on Friday repeated the commitments they had made previously, including new investments in US Steel plants and ensuring that key directors and executives would be US citizens.\n\n\"The record before CFIUS is abundantly clear that this transaction, with the commitments made by Nippon Steel, would strengthen, not weaken, national security\" the companies said in their joint statement.\n\n\"Yet, it is clear that the CFIUS process was deeply corrupted by politics, and the outcome was pre-determined, without an investigation on the merits, but to satisfy the political objectives of the Biden White House.\"\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\n\nRead the latest financial and business news from Yahoo Finance",
    "word_count": 538
  }
]