[
  {
    "title": "View More",
    "url": "https://finance.yahoo.com/topic/latest-news",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Nvidia stock was on track to see a 15.4% gain over the five trading sessions ending Friday as an optimistic outlook for its business abroad sent shares soaring ahead of its quarterly earnings report on May 28.\n\nOklahoma state officials announced a deal Friday with a private company in the United Arab Emirates for the construction of a $4 billion aluminum manufacturing facility in northeast Oklahoma.  Gov. Kevin Stitt and Oklahoma Department of Commerce officials say the deal with Emirates Global Aluminum would result in the first new aluminum smelting facility to be built in the U.S. in 45 years.  The annual capacity of the smelter would be about 600,000 tons (544,000 metric tons) of primary aluminum, according to a memorandum of understanding signed by Stitt and the company's CEO.\n\n(Reuters) -Michael Burry's Scion Asset Management has doubled its stake in Estee Lauder, at a time when the beauty giant's new CEO is steering the company through a transformation to overcome weak demand in key markets such as North America and China.  \"Burry's bet suggests belief in Estee Lauder's ability to reclaim its status as a beauty powerhouse in an increasingly competitive global market,\" said Angeli Gianchandani, a global brand marketing expert at New York University.  Since joining the company in January, Estee CEO Stephane de La Faverie has ramped up product launches and introduced new luxury price tiers in an attempt to revive demand after several quarters of slow growth.\n\nThree factions of Republicans have flummoxed GOP leaders and raised serious questions this week about the timing of a coming vote on Trump's 'big beautiful bill.'\n\n(Reuters) -A 90-day trade thaw between Washington and Beijing could prove to be a welcome reprieve for the U.S. freight industry, as importers rush to lock in shipments ahead of the busy back-to-school period, experts said.  The $906 billion U.S. trucking industry, in particular, has been facing a nearly three-year-long slowdown due to overcapacity, which was worsened by President Donald Trump's recent tariffs on the country's largest trading partners.  But an agreement on Monday between the world's two largest economies to slash tariffs for at least 90 days, coupled with the White House's deal with the UK and ongoing negotiations with other trade partners, have shifted expectations from fears of low freight activity to a potential import surge ahead of the peak shopping season starting late July.\n\nNvidia stock was on track to see a 15.4% gain over the five trading sessions ending Friday as an optimistic outlook for its business abroad sent shares soaring ahead of its quarterly earnings report on May 28.\n\nRelief over easing trade tensions is giving way to concern about the impact of President Trump's tariffs.\n\nThree factions of Republicans have flummoxed GOP leaders and raised serious questions this week about the timing of a coming vote on Trump's 'big beautiful bill.'\n\nConsumer sentiment continued to decline in May as Americans expect Trump's tariffs to send inflation soaring over the next year.\n\nTesla stock is on the move after the EV maker added Chipotle president Jack Hartung to its board of directors.\n\nNovo Nordisk CEO Lars Fruergaard Jørgensen steps down from the Danish drug giant.\n\nBill George, who sat on the boards of Starbucks and Target, said CEOs are eager to invest in their companies.\n\nIn the first three months of the year Tesla reported deliveries of 336,681, a drop of 13% versus a year ago, missing estimates of 390,000 units.\n\nAirlines say demand is holding steady. Summer travel isn't what it used to be, but it can still be something.\n\nJPMorgan Chase CEO Jamie Dimon's time as top boss is winding down at a time when his stature on Wall Street and in the nation's capital is arguably at an all-time high. Investors, as a result, may not be ready to let him go.\n\n(Bloomberg) -- Former Federal Reserve Chair Ben S. Bernanke urged the US central bank to provide the public a fuller explanation of its interest-rate decisions and a much richer examination of potential forecast scenarios.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Ce\n\nConsumer confidence is a key economic indicator to keep tabs on. Learn more about what the consumer confidence index is and how it impacts the economy and your wallet.\n\nPARIS (Reuters) -French shipping group CMA CGM will reorganise its global fleet to avoid U.S. port fees on Chinese-built vessels that are due to take effect from October, the company's finance director said.  The port charges are another operational headache for shipping firms wrestling with the fallout from U.S. tariffs, though adjustments made by Washington after an industry backlash have made the fee scheme less disruptive than feared, Ramon Fernandez, CMA CGM's chief financial officer, told Reuters.  U.S. President Donald Trump's administration aims to use the port fees to counter China's dominance in global shipbuilding and support a revival of U.S. maritime transport.\n\n(Bloomberg) -- President Donald Trump called on members of his party to unite behind his economic agenda in Congress, putting pressure on factions of lawmakers who are calling for last-minute changes to the legislation to drop their demands.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsP\n\n(Bloomberg) -- OpenAI is rolling out a new artificial intelligence agent for ChatGPT users that’s designed to help streamline software development as the company pushes into a crowded market of startups and large tech firms offering AI tools for coders. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit\n\noil is riding high on the euphoria of not having debilitating tariffs on US imports to China, managed to lift ICE Brent around $65 per barrel towards the end of the week\n\nThe World Bank said Friday that the $15.5 million Syria owed it has been paid off by Saudi Arabia and Qatar, clearing Damascus to take out new loans.  Saudi Arabia and Qatar had announced plans last month to clear Syria’s outstanding debts, a move that Syria hailed as paving the way for recovery and reconstruction after a 14-year conflict that killed half a million people and caused wide destruction in the country.\n\nOpenAI announced on Friday it's launching a research preview of Codex, the company's most capable AI coding agent yet. Codex is powered by codex-1, a version of the company's o3 AI reasoning model optimized for software engineering tasks. OpenAI says codex-1 produces \"cleaner\" code than o3, adheres more precisely to instructions, and will iteratively run tests on its code until passing results are achieved. The Codex agent runs in a sandboxed, virtual computer in the cloud. By connecting with Gi\n\nPutting money aside is an effective way to save for special occasions or to build a rainy day fund in case of emergencies, but earn too much interest and the taxman may come calling.\n\nBurry bought bearish put options on Chinese tech companies Alibaba, Baidu, JD.com, and PDD Holdings, He doubled his stake in Estée Lauder.\n\nVirgin Galactic results and plans for future flights sent shares of the space tourism firm soaring 35%.\n\nBahama Breeze abruptly closed more than one-third of its restaurants this week, further compounding to the problems the casual dining segment is experiencing.\n\nConsumer sentiment continued to decline in May as Americans expect Trump's tariffs to send inflation soaring over the next year.\n\n(Bloomberg) -- New Jersey Transit locomotive engineers started striking early Friday, triggering a shutdown of the agency’s rail service and disrupting travel for hundreds of thousands of commuters.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Centers Are Warming Homes\n\n(Bloomberg) -- Fifth Third Bancorp. began forging relationships with crypto companies about five years ago, but held off on major investments until regulation became clearer. That moment has arrived, according to the bank’s head of strategy. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike Looms\n\n(Bloomberg) -- Oil bounced between small gains and losses as Iran cast fresh doubts on the status of nuclear talks with the US. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Centers Are Warming Homes in the NordicsBrent traded below $65 a barrel after jumping as much as\n\nBetween collections resuming, courts blocking student loan programs and layoffs at the Education Department, borrowers might be confused about the status of their student loans.  Recently, the Education Department announced it would start involuntary collections on defaulted loans, meaning the roughly 5.3 million borrowers who are in default could have their wages garnished by the federal government.  At the center of the turmoil are the government's income-driven repayment plans, which reduce monthly payments for borrowers with lower incomes.\n\nPam Bondi sold her stock in Trump Media on April 2, the same day Trump announced a slew of new tariffs that sent the market tumbling.\n\n(Bloomberg) -- In a week that saw an epic rally in US stocks and recession calls cast aside, currency traders are just as bearish as ever on the American dollar. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Centers Are Warming Homes in the NordicsStrategists at JPMorga\n\nWASHINGTON (Reuters) -U.S. consumer sentiment slumped further in May while one-year inflation expectations surged as households remained concerned about the economic impact of President Donald Trump's aggressive and often erratic trade policy.  The University of Michigan Surveys of Consumers on Friday said its Consumer Sentiment Index dropped to 50.8 this month from a final reading of 52.2 in April.  \"Tariffs were spontaneously mentioned by nearly three-quarters of consumers, up from almost 60% in April; uncertainty over trade policy continues to dominate consumers’ thinking about the economy,\" said Surveys of Consumers Director Joanne Hsu.\n\nU.S. consumer sentiment fell slightly in May for the fifth straight month, surprising economists, as Americans increasingly worry that President Donald Trump’s trade war will worsen inflation.  The preliminary reading of the University of Michigan’s closely watched consumer sentiment index, released Friday, declined 2.7% on a monthly basis to 50.8, the second-lowest level in the nearly 75-year history of the survey.  Americans have largely taken a sour view about where the economy is headed in the wake of the Trump administration’s imposition of huge import duties, which threaten to slow growth and push up prices.\n\nShopper sentiment now hovers near its lowest level since a severe bout of inflation three years ago, University of Michigan survey data on Friday showed.  Before that, the measure of consumer attitudes hadn't ever fallen this low.  A trade agreement between the U.S. and China this week slashed tit-for-tat tariffs between the world’s two largest economies and triggered a surge in the stock market.\n\nInditex on Friday announced a new chief financial officer and chief sustainability officer in a top management reshuffle, without detailing any reason for the changes. Current Chief Financial Officer Ignacio Fernandez Fernandez will take on a new role as Chief Corporate Officer overseeing the financial, sustainability, logistics, transport and infrastructure divisions, Inditex said. Andres Sanchez Iglesias, currently chief tax officer, was appointed as the new CFO.\n\nUS consumer sentiment slides to lowest level in 3 years as trade war raises anxiety about inflation.\n\nLONDON (Reuters) -Online classifieds group Adevinta is exploring the sale of its Spanish business, two sources with knowledge of the talks said, as its private equity owners seek to break-up the company to focus on three main markets and boost returns.  Norway's Adevinta, acquired by a consortium led by Blackstone and Permira a year ago, is working with advisers on the sale of the Spanish business, which includes brands such as job-search platform Infojobs or property website Fotocasa, the sources said.  The business could fetch more than 2 billion euros ($2.2 billion), one of the two sources said.\n\nTiming big decisions like buying a house or switching jobs is tough in the Trump era. BI's series is here to help you with these life choices.\n\nNoon trading on the Chicago Mercantile Exchange Friday:\n\nPrices as of 10:00:26 AM Friday, May 16. Sugar (ICE)\n\nNoon trading on the Chicago Board of Trade Fri. :\n\nEarly Foreign Exchange, New York prices.\n\nPrices as of 10:00:21 AM Friday, May 16. Gold (COMX)\n\nPrices as of 10:00:20 AM Friday, May 16. Corn (CBOT)\n\nPrices as of 10:00:19 AM Friday, May 16. Wheat (CBOT)\n\nPrices as of 10:00:18 AM Friday, May 16.\n\nPrices as of 10:00:17 AM Friday, May 16. Copper (COMX)\n\nPrices as of 10:00:16 AM Friday, May 16. Soybeans (CBOT)\n\nPrices as of 10:00:15 AM Friday, May 16. Rice (CBOT)\n\nPrices as of 10:00:14 AM Friday, May 16. Cotton (ICE)\n\nPrices as of 10:00:12 AM Friday, May 16. Light Sweet Crude (NYMX)\n\n(Bloomberg) -- CVS Health Corp. is trying to buy stores and patient data from Rite Aid Corp., the beleaguered pharmacy chain that is going out of business after filing for bankruptcy a second time earlier this month.Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Centers\n\nThe boss of the drugs giant Novo Nordisk has been sacked after falling behind in the global race to develop weight-loss medication.\n\nCava Group beat first-quarter profit and sales estimates, but its outlook wasn't as strong as some had anticipated.\n\n(Bloomberg) -- After several months in the wilderness, Nvidia Corp. shares have found their way again as doubts about Big Tech spending subside, trade tensions with China ease, and new chip buyers emerge. Most Read from BloombergAs Coastline Erodes, One California City Considers ‘Retreat Now’How a Highway Became San Francisco’s Newest ParkMaryland’s Credit Rating Gets Downgraded as Governor Blames Trump NYC Commuters Brace for Chaos as NJ Transit Strike LoomsPower-Hungry Data Centers Are Warming\n\nEpic Games claims that Apple is blocking its Fortnite app from the U.S. and EU App Stores. After winning a decisive victory for app developers in a legal battle with Apple, forcing the tech giant to allow external payments in its U.S. App Store without charging commission, Epic Games attempted to resubmit Fortnite to the U.S. App Store on May 9, 2025. However, Apple failed to accept its submission for a week, leading Epic Games to pull its request and try again. According to Epic Games CEO Tim S\n\nHewlett Packard Enterprise (HPE) has ended its pursuit of one of Mike Lynch’s key lieutenants over claims he defrauded the tech giant in an $11bn (£8.3bn) deal struck more than a decade ago.",
    "word_count": 2586
  },
  {
    "title": "NYC congestion pricing set to take effect after years of delays",
    "url": "https://finance.yahoo.com/news/nyc-congestion-pricing-set-effect-202916097.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Maduro Rival Seeks Biden Talks Before Venezuela’s Inauguration",
    "url": "https://finance.yahoo.com/news/maduro-rival-seeks-biden-talks-202719906.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Austrian Chancellor Nehammer Quits as Coalition Talks Fail",
    "url": "https://finance.yahoo.com/news/austria-chancellor-nehammer-quits-coalition-190404155.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "How low can bond spreads go? Five numbers to watch",
    "url": "https://finance.yahoo.com/news/low-bond-spreads-five-numbers-200000480.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Biden to ban new oil drilling over vast stretch of US Atlantic, Pacific waters",
    "url": "https://finance.yahoo.com/news/biden-ban-oil-drilling-over-040842217.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Boeing ended its difficult 2024 as the biggest loser in the Dow Jones index",
    "url": "https://finance.yahoo.com/news/boeing-ended-difficult-2024-biggest-094501398.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Of the 30 companies in the Dow Jones Industrial Average, Boeing's share price fell the most in 2024.\n\nThe planemaker got off to a worrying start with January's Alaska Airlines blowout.\n\nIts new CEO also had to contend with a seven-week strike that contributed to delivery delays.\n\nBoeing's painful 2024 ended with the planemaker ranking as the biggest loser in the Dow Jones Industrial Average.\n\nIts share price dropped 31% last year — the worst of the index's 30 companies, according to Markets Insider data.\n\nThe planemaker was close to avoiding that title as Nike shares fell nearly 30% across the same period. As a whole, the Dow Jones was up 13%, led by Nvidia after its stock more than doubled.\n\nJust days into 2024 it was apparent that it was going to be a testing year for Boeing.\n\nOn January 5, an Alaska Airlines 737 Max lost a door plug in midair. The fact that the plane was delivered 66 days earlier suggested the problem originated with the manufacturer. That was later shown in the National Transportation Safety Board's preliminary report that said the plane left Boeing's factory missing key bolts.\n\nThe incident sparked an overhaul of the company's processes and culture — and a wave of criticism from airline bosses.\n\nRegulators placed Boeing under further scrutiny too. The Federal Aviation Administration limited production of the 737 Max to 38 jets a month. Its administrator, Mike Whitaker, told Reuters last month he expects Boeing to take several months to get up to that number.\n\nIn March, Dave Calhoun stepped down as CEO. He was replaced in August by Kelly Ortberg, an industry veteran who signaled a return to prioritizing engineering over profit.\n\nOrtberg announced plans to be based in Seattle, Boeing's historic home, and visited factories.\n\nStill, the embattled company couldn't stay out of the headlines.\n\nIn September, its Starliner spacecraft returned to Earth uncrewed. The astronauts it took to the International Space Station were supposed to return after eight days, but problems with Starliner meant they are instead set to spend eight months in space.\n\nLater that month, some 30,000 Boeing workers went on strike, hampering production for seven weeks amid tense union negotiations. 737 Max production didn't restart until December.\n\nLate deliveries continued to irritate airline customers. During the strike, Ortberg announced further delays to Boeing's highly anticipated but yet-to-be-certified 777X jet.\n\nThe CEO also said Boeing would lay off 10% of its 170,000 employees.\n\nBoeing's biggest rival, Airbus, has seen its stock rise 14% over the past year.\n\nBank of America analysts estimated that the European planemaker delivered as many as 760 jets thanks to a big end-of-year push — slightly below Airbus' guidance of 770 planes.\n\nAt the end of November, Boeing had delivered less than half that number, at 318 jets.\n\nOrtberg has a plan to help level the playing field, including putting Boeing leaders on factory floors to help change the company's culture.\n\n\"This is a big ship that will take some time to turn, but when it does, it has the capacity to be great again,\" he said in a memo to staff.\n\n\"With the right focus and culture, we can be an iconic company and aerospace leader once again.\"\n\n2025 is set to be a pivotal year for Ortberg's plan to help move the company forward from last year's woes.\n\nNew year, new Boeing?\n\nRead the original article on Business Insider",
    "word_count": 570
  },
  {
    "title": "These hedge funds soared amid big gains for US stocks and the dollar",
    "url": "https://finance.yahoo.com/news/hedge-funds-soared-amid-big-164000834.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Hedge funds scored hefty returns in 2024, when U.S. stocks and the dollar dominated global markets. Despite an election-fueled \"America first\" narrative in the broader market, some diversified funds still notched outsized gains.\n\nTop hedge funds put up big numbers in 2024, which was dominated by U.S. markets that got a jolt from Donald Trump's presidential election victory.\n\nDespite an \"America first\" narrative that helped boost the S&P 500 23% and the U.S. dollar index by about 7% last year, some multi-strategy funds with bets across different asset classes and geographies saw outsized gains.\n\nFor example, Discovery Capital Management soared 52%, a person familiar with the matter said, confirming other reports. The hedge fund declined to comment.\n\nThat builds on top of a 48% surge in 2023, making it one of the best hedge funds on Wall Street that year, according to Bloomberg.\n\nMeanwhile, D.E. Shaw's Oculus, a macro-oriented multi-strategy fund, returned 36.1% in 2024, and the Composite fund, its largest multi-strategy fund, returned 18%, according to a person familiar with the firm’s results. D.E. Shaw declined to comment.\n\nWhile their performance is often compared to the S&P 500's, hedge funds point out that they don't benchmark themselves to the large-cap U.S. stock index and instead seek to hedge against market downside while providing consistent, risk-adjusted gains that aren't necessarily correlated with the S&P 500.\n\nIn addition, hedge funds often employ different strategies across various offerings. Citadel's flagship Wellington multi-strategy fund returned 15.1% in 2024, a person familiar with the matter confirmed, while its Tactical Trading fund returned 22.3%, and its Equities fund scored an 18% gain. Citadel declined to comment.\n\nElsewhere, Millennium Management climbed 15%, according to reports. The hedge fund didn't immediately respond to requests for comment.\n\nWith such gains, those funds were on track to outperform their peers. Through the first 11 months of 2024, hedge funds overall averaged a 10.7% return, according to the latest data from PivotalPath cited by Reuters. That's up from a 5.7% average return in the same period in 2023.\n\nAnd among global hedge funds taking long and short bets on stocks last year, the total weighted average return came in at 12.75%, according to a private Goldman Sachs note that was seen by Reuters.\n\n\"It could be argued that 2024 was the year of the stock picker, with equity hedge funds playing dispersion well and really leaning into creative shorting strategies and a careful use of leverage to drive returns,\" said PivotalPath CEO Jon Caplis told Reuters.\n\nThis story was originally featured on Fortune.com",
    "word_count": 423
  },
  {
    "title": "AI stocks to watch, Apple TV tries free, and the Chips Act scramble: Tech roundup",
    "url": "https://finance.yahoo.com/news/ai-stocks-watch-apple-tv-140000580.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "kinjavideo-197409\n\nBig Tech stocks could have another big year in 2025.\n\nNvidia (NVDA), Amazon (AMZN), Alphabet (GOOGL), and Apple (AAPL) could continue to be some of the biggest winners of the artificial intelligence-driven stock boom, David Dietze, senior portfolio strategist at Peapack Private Wealth Management, said in the latest episode of Quartz AI Factor, a video series set at the Nasdaq MarketSite.\n\nRead More\n\nApple (AAPL) announced Monday that its video streaming service, Apple TV+, will be free worldwide this upcoming weekend, allowing anyone with an Apple ID to access the platform’s shows.\n\nRead More\n\nBig Tech is spending billions on artificial intelligence as demand grows for computing power and more advanced capabilities.\n\nMicrosoft (MSFT), Meta (META), Google (GOOGL), and Amazon (AMZN) spent a combined $125 billion on investing in and running AI data centers between January and August 2024, according to a JPMorgan (JPM) report citing New Street Research. The research shows both total AI capital expenditures and total data center operating costs, which include “cash operating expenses, software, depreciation, and electricity.”\n\nRead More\n\nApple (AAPL) is giving its Chinese customers a discount on iPhones as it competes with homegrown rivals such as Huawei.\n\nThe iPhone maker is offering a discount of up to 500 Chinese yuan, or $68.50, on its latest iPhone models when customers use “eligible payment methods,” according to the Apple website. The 500 yuan discount applies to the iPhone 16 Pro and iPhone 16 Pro Max, while the iPhone 16 and iPhone 16 Plus will be discounted by 400 yuan during the promotion, which runs from January 4 to 7.\n\nRead More\n\nTech giant Apple (AAPL) has agreed to pay $95 million to settle a proposed cash action lawsuit over allegations that it used its virtual assistant to eavesdrop on iPhone users.\n\nRead More\n\nJust when you thought your toaster couldn’t get any smarter, CES 2025 is about to prove you wrong. The world’s biggest tech show returns to Las Vegas from January 7-10, promising to stuff artificial intelligence into literally everything that has a power button.\n\nRead More\n\nAs the Biden administration prepares to pass power to President-elect Donald Trump, U.S. chipmakers are rushing to finalize federal funding.\n\nIn 2022, President Joe Biden signed the bipartisan CHIPS and Science Act to boost semiconductor manufacturing, research, and development in the U.S. The $280 billion package includes $52 billion in subsidies for chips.\n\nRead More\n\nElon Musk’s Starlink is set to give Ukraine “uninterrupted” service through its satellite network through a partnership with Kyivstar (VEON), the country’s largest mobile operator.\n\nRead More\n\nkinjavideo-197411\n\nDavid Dietze of Peapack Private Wealth Management says capital expenditures are no longer enough and AI companies must deliver tangible cash flows\n\nkinjavideo-197410\n\nDavid Dietze of Peapack Private Wealth Management on the companies powering the AI revolution — and who’s cashing in\n\nFor the latest news, Facebook, Twitter and Instagram.",
    "word_count": 477
  },
  {
    "title": "Wall Street’s Top Banks Just Abandoned a Once Popular Alliance",
    "url": "https://finance.yahoo.com/news/wall-street-top-banks-just-140000186.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "S&P Global price target lowered to $580 from $590 at Oppenheimer",
    "url": "https://finance.yahoo.com/news/p-global-price-target-lowered-130534578.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Oppenheimer lowered the firm’s price target on S&P Global to $580 from $590 and keeps an Outperform rating on the shares as part of a Q4 earnings preview. The weak Q4 issuance expectation didn’t appear to materialize, and Opco’s proprietary tracker indicates that issuance bettered expectations, the analyst tells investors in a research note. The firm forecast that S&P Global’s and Moody’s Q4 Ratings revenues grew 13% and 22% year-over-year, respectively, higher than the consensus estimates of 11% and 7%. It expects Moody’s Street estimates to rise going into the print. However, for the stocks to work on the print and in 2025, the 2025 guidance and results throughout the year have to exceed investor expectations, contends Oppenheimer.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee Insiders’ Hot Stocks on TipRanks >>\n\nRead More on SPGI:\n\nIs Amgen (NASDAQ:AMGN) a High-Quality Dividend Stock on Sale?\n\nCan Morgan Stanley (NYSE:MS) Stock Run Higher?\n\nMoody’s initiated with a Buy at Citi\n\nS&P Global initiated with a Buy at Citi\n\nMicrosoft’s Financial Strength and Growth Prospects Make It a Strong Buy for Investors",
    "word_count": 213
  },
  {
    "title": "Tractor Supply target adjusted for stock split at Evercore ISI",
    "url": "https://finance.yahoo.com/news/tractor-supply-target-adjusted-stock-125515043.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Evercore ISI lowered the firm’s price target on Tractor Supply (TSCO) to $58 from $290 and keeps an In Line rating on the shares as the firm adjusted its target to reflect the 5-for-1 stock split that occurred on December 20. The firm made no changes to any of its financial assumptions or outlook based on the adjustment to the share count, the analyst noted.\n\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks\n\nFilter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on TSCO:\n\nTractor Supply closes acquistion of Allivet\n\nTractor Supply target adjusted for stock split at Barclays\n\nVOO ETF Update, 12/30/2024\n\nSPY ETF Update, 12/27/2024\n\nSPY ETF Update, 12/24/2024",
    "word_count": 144
  },
  {
    "title": "Jobs Report, Fed Minutes, Delta Earnings: What to Watch Next Week",
    "url": "https://finance.yahoo.com/m/539777b7-ba2e-3d67-baf5-9b4f269daa4a/jobs-report-fed-minutes-.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "HTTP error: 404"
  },
  {
    "title": "Q3 Earnings Highlights: Coupang (NYSE:CPNG) Vs The Rest Of The Online Retail Stocks",
    "url": "https://finance.yahoo.com/news/q3-earnings-highlights-coupang-nyse-090904592.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "As the Q3 earnings season wraps, let’s dig into this quarter’s best and worst performers in the online retail industry, including Coupang (NYSE:CPNG) and its peers.\n\nConsumers ever rising demand for convenience, selection, and speed are secular engines underpinning ecommerce adoption. For years prior to Covid, ecommerce penetration as a percentage of overall retail would grow 1-2% annually, but in 2020 adoption accelerated by 5%, reaching 25%, as increased emphasis on convenience drove consumers to structurally buy more online. The surge in buying caused many online retailers to rapidly grow their logistics infrastructures, preparing them for further growth in the years ahead as consumer shopping habits continue to shift online.\n\nThe 6 online retail stocks we track reported a strong Q3. As a group, revenues beat analysts’ consensus estimates by 2.2% while next quarter’s revenue guidance was 0.7% below.\n\nThankfully, share prices of the companies have been resilient as they are up 5.7% on average since the latest earnings results.\n\nFounded in 2010 by Harvard Business School student Bom Kim, Coupang (NYSE:CPNG) is an e-commerce giant often referred to as the \"Amazon of South Korea\".\n\nCoupang reported revenues of $7.87 billion, up 27.2% year on year. This print exceeded analysts’ expectations by 1.4%. Overall, it was a strong quarter for the company with a solid beat of analysts’ EBITDA estimates and solid growth in its buyers.\n\n“This quarter we continued the strong momentum we’ve seen throughout this year, delivering robust growth in revenues and margins,” said Gaurav Anand, CFO of Coupang.\n\nUnsurprisingly, the stock is down 16.5% since reporting and currently trades at $22.45.\n\nWe think Coupang is a good business, but is it a buy today? Read our full report here, it’s free.\n\nKnown for its glass tower car vending machines, Carvana (NYSE:CVNA) provides a convenient automotive shopping experience by offering an online platform for buying and selling used cars.\n\nCarvana reported revenues of $3.66 billion, up 31.8% year on year, outperforming analysts’ expectations by 5.3%. The business had an exceptional quarter with an impressive beat of analysts’ EBITDA estimates.\n\nCarvana achieved the biggest analyst estimates beat and fastest revenue growth among its peers. Although it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 8.5% since reporting. It currently trades at $189.81.\n\nIs now the time to buy Carvana? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 2002 by Niraj Shah, Wayfair (NYSE:W) is a leading online retailer of mass-market home goods in the US, UK, Canada, and Germany.\n\nWayfair reported revenues of $2.88 billion, down 2% year on year, in line with analysts’ expectations. It was a slower quarter as it posted a significant miss of analysts’ number of active customers estimates and a decline in its buyers.\n\nWayfair delivered the weakest performance against analyst estimates and slowest revenue growth in the group. The company reported 21.7 million active buyers, down 2.7% year on year. Interestingly, the stock is up 7.5% since the results and currently trades at $46.06.\n\nRead our full analysis of Wayfair’s results here.\n\nFounded by Ryan Cohen, who later became known for his involvement in GameStop, Chewy (NYSE:CHWY) is an online retailer specializing in pet food, supplies, and healthcare services.\n\nChewy reported revenues of $2.88 billion, up 4.8% year on year. This result beat analysts’ expectations by 0.7%. Overall, it was a very strong quarter as it also recorded a solid beat of analysts’ EBITDA estimates.\n\nThe stock is up 4.2% since reporting and currently trades at $34.99.\n\nRead our full, actionable report on Chewy here, it’s free.\n\nLaunched in 2003 by software engineers Michael Mente and Mike Karanikolas, Revolve (NASDAQ:RVLV) is a fashion retailer leveraging social media and a community of fashion influencers to drive its merchandising strategy.\n\nRevolve reported revenues of $283.1 million, up 9.9% year on year. This number topped analysts’ expectations by 4.4%. It was a very strong quarter as it also produced an impressive beat of analysts’ EBITDA estimates and a narrow beat of analysts’ number of active customers estimates.\n\nThe company reported 2.63 million active buyers, up 4.7% year on year. The stock is up 28.6% since reporting and currently trades at $33.47.\n\nRead our full, actionable report on Revolve here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 899
  },
  {
    "title": "Unpacking Q3 Earnings: Hain Celestial (NASDAQ:HAIN) In The Context Of Other Shelf-Stable Food Stocks",
    "url": "https://finance.yahoo.com/news/unpacking-q3-earnings-hain-celestial-090849049.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "As the Q3 earnings season comes to a close, it’s time to take stock of this quarter’s best and worst performers in the shelf-stable food industry, including Hain Celestial (NASDAQ:HAIN) and its peers.\n\nAs America industrialized and moved away from an agricultural economy, people faced more demands on their time. Packaged foods emerged as a solution offering convenience to the evolving American family, whether it be canned goods or snacks. Today, Americans seek brands that are high in quality, reliable, and reasonably priced. Furthermore, there's a growing emphasis on health-conscious and sustainable food options. Packaged food stocks are considered resilient investments. People always need to eat, so these companies can enjoy consistent demand as long as they stay on top of changing consumer preferences. The industry spans from multinational corporations to smaller specialized firms and is subject to food safety and labeling regulations.\n\nThe 20 shelf-stable food stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates while next quarter’s revenue guidance was 5.7% below.\n\nWhile some shelf-stable food stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.6% since the latest earnings results.\n\nSold in over 75 countries around the world, Hain Celestial (NASDAQ:HAIN) is a natural and organic food company whose products range from snacks to teas to baby food.\n\nHain Celestial reported revenues of $394.6 million, down 7.2% year on year. This print was in line with analysts’ expectations, but overall, it was a softer quarter for the company with a significant miss of analysts’ adjusted operating income estimates.\n\n“Our performance in the first quarter built upon the momentum from our foundational year by further streamlining our portfolio and operational footprint, enabling us to deliver gross margin expansion,” said Wendy Davidson, Hain Celestial President and CEO.\n\nUnsurprisingly, the stock is down 30.9% since reporting and currently trades at $6.15.\n\nRead our full report on Hain Celestial here, it’s free.\n\nBest known for its portfolio of powerhouse breakfast cereal brands, General Mills (NYSE:GIS) is a packaged foods company that has also made a mark in cereals, baking products, and snacks.\n\nGeneral Mills reported revenues of $5.24 billion, up 2% year on year, outperforming analysts’ expectations by 1.9%. The business had a very strong quarter with a solid beat of analysts’ EBITDA estimates and an impressive beat of analysts’ gross margin estimates.\n\nAlthough it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 3.6% since reporting. It currently trades at $63.54.\n\nIs now the time to buy General Mills? Access our full analysis of the earnings results here, it’s free.\n\nBest known for its SuperPretzel soft pretzels and ICEE frozen drinks, J&J Snack Foods (NASDAQ:JJSF) produces a range of snacks and beverages and distributes them primarily to supermarket and food service customers.\n\nJ&J Snack Foods reported revenues of $426.8 million, down 3.9% year on year, in line with analysts’ expectations. It was a disappointing quarter as it posted a significant miss of analysts’ EBITDA and gross margin estimates.\n\nAs expected, the stock is down 11.3% since the results and currently trades at $153.79.\n\nRead our full analysis of J&J Snack Foods’s results here.\n\nFounded in 1919 as Nebraska Consolidated Mills in Omaha, Nebraska, Conagra Brands today (NYSE:CAG) boasts a diverse portfolio of packaged foods brands that includes everything from whipped cream to jarred pickles to frozen meals.\n\nConagra reported revenues of $3.20 billion, flat year on year. This number topped analysts’ expectations by 1.5%. Taking a step back, it was a mixed quarter as it also produced a solid beat of analysts’ organic revenue estimates but full-year EPS guidance missing analysts’ expectations.\n\nThe stock is up 2% since reporting and currently trades at $27.91.\n\nRead our full, actionable report on Conagra here, it’s free.\n\nFounded in 1895, Post (NYSE:POST) is a packaged food company known for its namesake breakfast cereal and healthier-for-you snacks.\n\nPost reported revenues of $2.01 billion, up 3.3% year on year. This result beat analysts’ expectations by 2.2%. Overall, it was a strong quarter as it also produced an impressive beat of analysts’ EPS estimates and a decent beat of analysts’ adjusted operating income estimates.\n\nThe stock is up 6.9% since reporting and currently trades at $115.36.\n\nRead our full, actionable report on Post here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 915
  },
  {
    "title": "Industrial Packaging Q3 Earnings: International Paper (NYSE:IP) is the Best in the Biz",
    "url": "https://finance.yahoo.com/news/industrial-packaging-q3-earnings-international-090822582.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Let’s dig into the relative performance of International Paper (NYSE:IP) and its peers as we unravel the now-completed Q3 industrial packaging earnings season.\n\nIndustrial packaging companies have built competitive advantages from economies of scale that lead to advantaged purchasing and capital investments that are difficult and expensive to replicate. Recently, eco-friendly packaging and conservation are driving customers preferences and innovation. For example, plastic is not as desirable a material as it once was. Despite being integral to consumer goods ranging from beer to toothpaste to laundry detergent, these companies are still at the whim of the macro, especially consumer health and consumer willingness to spend.\n\nThe 9 industrial packaging stocks we track reported a mixed Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nAmidst this news, share prices of the companies have had a rough stretch. On average, they are down 6% since the latest earnings results.\n\nEstablished in 1898, International Paper (NYSE:IP) produces containerboard, pulp, paper, and materials used in packaging and printing applications.\n\nInternational Paper reported revenues of $4.69 billion, up 1.6% year on year. This print was in line with analysts’ expectations, and overall, it was an exceptional quarter for the company with an impressive beat of analysts’ EPS and EBITDA estimates.\n\n\"Our third quarter earnings are above our outlook,\" said Chairman and CEO Andy Silvernail.\n\nInterestingly, the stock is up 8.4% since reporting and currently trades at $53.16.\n\nIs now the time to buy International Paper? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1959, Packaging Corporation of America (NYSE: PKG) produces containerboard and corrugated packaging products, also offering displays and protective packaging solutions.\n\nPackaging Corporation of America reported revenues of $2.18 billion, up 12.7% year on year, outperforming analysts’ expectations by 4.4%. The business had an exceptional quarter with a solid beat of analysts’ sales volume estimates and an impressive beat of analysts’ adjusted operating income estimates.\n\nPackaging Corporation of America scored the biggest analyst estimates beat and fastest revenue growth among its peers. The market seems content with the results as the stock is up 4% since reporting. It currently trades at $225.21.\n\nIs now the time to buy Packaging Corporation of America? Access our full analysis of the earnings results here, it’s free.\n\nEstablished in 1987, Silgan Holdings (NYSE:SLGN) is a supplier of rigid packaging for consumer goods products, specializing in metal containers, closures, and plastic packaging.\n\nSilgan Holdings reported revenues of $1.75 billion, down 3.2% year on year, falling short of analysts’ expectations by 4.6%. It was a disappointing quarter as it posted a significant miss of analysts’ adjusted operating income estimates.\n\nSilgan Holdings delivered the weakest performance against analyst estimates in the group. The stock is flat since the results and currently trades at $51.05.\n\nRead our full analysis of Silgan Holdings’s results here.\n\nFounded in 1960, Sealed Air Corporation (NYSE: SEE) specializes in the development and production of protective and food packaging solutions, serving a variety of industries.\n\nSealed Air reported revenues of $1.35 billion, down 2.7% year on year. This print met analysts’ expectations. It was a strong quarter as it also produced a solid beat of analysts’ adjusted operating income estimates and an impressive beat of analysts’ EPS estimates.\n\nThe stock is down 10.2% since reporting and currently trades at $33.29.\n\nRead our full, actionable report on Sealed Air here, it’s free.\n\nFormerly Crown Cork & Seal, Crown Holdings (NYSE:CCK) produces packaging products for consumer marketing companies, including food, beverage, household, and industrial products.\n\nCrown Holdings reported revenues of $3.07 billion, flat year on year. This number was in line with analysts’ expectations. Overall, it was a strong quarter as it also logged a solid beat of analysts’ adjusted operating income estimates and full-year EPS guidance exceeding analysts’ expectations.\n\nThe stock is down 13.5% since reporting and currently trades at $81.21.\n\nRead our full, actionable report on Crown Holdings here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Top 6 Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 841
  },
  {
    "title": "Specialty Equipment Distributors Stocks Q3 Earnings: Richardson Electronics (NASDAQ:RELL) Best of the Bunch",
    "url": "https://finance.yahoo.com/news/specialty-equipment-distributors-stocks-q3-090757503.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how specialty equipment distributors stocks fared in Q3, starting with Richardson Electronics (NASDAQ:RELL).\n\nHistorically, specialty equipment distributors have boasted deep selection and expertise in sometimes narrow areas like single-use packaging or unique lighting equipment. Additionally, the industry has evolved to include more automated industrial equipment and machinery over the last decade, driving efficiencies and enabling valuable data collection. Specialty equipment distributors whose offerings keep up with these trends can take share in a still-fragmented market, but like the broader industrials sector, this space is at the whim of economic cycles that impact the capital spending and manufacturing propelling industry volumes.\n\nThe 10 specialty equipment distributors stocks we track reported a slower Q3. As a group, revenues were in line with analysts’ consensus estimates.\n\nWhile some specialty equipment distributors stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 4.8% since the latest earnings results.\n\nFounded in 1947, Richardson Electronics (NASDAQ:RELL) is a distributor of power grid and microwave tubes as well as consumables related to those products.\n\nRichardson Electronics reported revenues of $53.73 million, up 2.2% year on year. This print exceeded analysts’ expectations by 8.7%. Overall, it was an incredible quarter for the company with a solid beat of analysts’ EPS estimates and an impressive beat of analysts’ EBITDA estimates.\n\n“Our first quarter results are encouraging and benefited from the strategies underway to drive sales growth, improve profitability, and generate positive operating cash flow,” said Edward J. Richardson, Chairman, CEO, and President.\n\nRichardson Electronics scored the biggest analyst estimates beat of the whole group. Unsurprisingly, the stock is up 10.8% since reporting and currently trades at $14.28.\n\nIs now the time to buy Richardson Electronics? Access our full analysis of the earnings results here, it’s free.\n\nFormerly a subsidiary of Hertz Corporation and with a logo that still bears some similarities to its former parent, Herc Holdings (NYSE:HRI) provides equipment rental and related services to a wide range of industries.\n\nHerc reported revenues of $965 million, up 6.3% year on year, outperforming analysts’ expectations by 3.6%. The business had a strong quarter with an impressive beat of analysts’ Equipment rentals revenue estimates and full-year EBITDA guidance slightly topping analysts’ expectations.\n\nThe market seems happy with the results as the stock is up 10.5% since reporting. It currently trades at $187.\n\nIs now the time to buy Herc? Access our full analysis of the earnings results here, it’s free.\n\nFounded in 1984, Alta Equipment Group (NYSE:ALTG) is a provider of industrial and construction equipment and services across the Midwest and Northeast United States.\n\nAlta reported revenues of $448.8 million, down 3.7% year on year, falling short of analysts’ expectations by 6.5%. It was a disappointing quarter as it posted and a significant miss of analysts’ adjusted operating income estimates.\n\nAlta delivered the weakest performance against analyst estimates in the group. As expected, the stock is down 18.4% since the results and currently trades at $6.55.\n\nRead our full analysis of Alta’s results here.\n\nFounded in 1980, Titan Machinery (NASDAQ:TITN) is a distributor of agricultural and construction equipment across the United States and Europe.\n\nTitan Machinery reported revenues of $679.8 million, down 2.1% year on year. This number surpassed analysts’ expectations by 0.7%. It was a strong quarter as it also logged a solid beat of analysts’ EBITDA and EPS estimates.\n\nThe stock is down 10.1% since reporting and currently trades at $13.85.\n\nRead our full, actionable report on Titan Machinery here, it’s free.\n\nInspired by a family gas station, Custom Truck One Source (NYSE:CTOS) is a distributor of trucks and heavy equipment.\n\nCustom Truck One Source reported revenues of $447.2 million, up 3% year on year. This result met analysts’ expectations. However, it was a softer quarter as it logged a significant miss of analysts’ adjusted operating income estimates.\n\nCustom Truck One Source pulled off the highest full-year guidance raise among its peers. The stock is up 21.6% since reporting and currently trades at $4.84.\n\nRead our full, actionable report on Custom Truck One Source here, it’s free.\n\nThanks to the Fed's series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market has thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% each in November and December), and a notable surge followed Donald Trump's presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by the pace and magnitude of future rate cuts as well as potential changes in trade policy and corporate taxes once the Trump administration takes over. The path forward is marked by uncertainty.\n\nWant to invest in winners with rock-solid fundamentals? Check out our 9 Best Market-Beating Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
    "word_count": 894
  },
  {
    "title": "Lowe's (LOW): Buy, Sell, or Hold Post Q3 Earnings?",
    "url": "https://finance.yahoo.com/news/lowes-low-buy-sell-hold-090711107.html",
    "timestamp": "2025-01-04 15:33:39",
    "text": "Lowe’s 16.7% return over the past six months has outpaced the S&P 500 by 10.4%, and its stock price has climbed to $248.99 per share. This performance may have investors wondering how to approach the situation.\n\nIs now the time to buy Lowe's, or should you be careful about including it in your portfolio? Get the full breakdown from our expert analysts, it’s free.\n\nDespite the momentum, we're swiping left on Lowe's for now. Here are three reasons why we avoid LOW and a stock we'd rather own.\n\nFounded in North Carolina as Lowe's North Wilkesboro Hardware, the company is a home improvement retailer that sells everything from paint to tools to building materials.\n\nA company’s long-term sales performance signals its overall quality. Even a bad business can shine for one or two quarters, but a top-tier one grows for years. Unfortunately, Lowe’s 3.1% annualized revenue growth over the last five years was sluggish. This fell short of our benchmark for the consumer retail sector.\n\nA retailer’s store count often determines how much revenue it can generate.\n\nLowe's operated 1,747 locations in the latest quarter. Over the last two years, the company has generally closed its stores, averaging 5.7% annual declines.\n\nWhen a retailer shutters stores, it usually means that brick-and-mortar demand is less than supply, and it is responding by closing underperforming locations to improve profitability.\n\nSame-store sales is an industry measure of whether revenue is growing at existing stores, and it is driven by customer visits (often called traffic) and the average spending per customer (ticket).\n\nLowe’s demand has been shrinking over the last two years as its same-store sales have averaged 3.9% annual declines.\n\nLowe’s business quality ultimately falls short of our standards. With its shares topping the market in recent months, the stock trades at 20.1× forward price-to-earnings (or $248.99 per share). At this valuation, there’s a lot of good news priced in - we think there are better stocks to buy right now. We’d recommend looking at CrowdStrike, the most entrenched endpoint security platform.\n\nThe Trump trade may have passed, but rates are still dropping and inflation is still cooling. Opportunities are ripe for those ready to act - and we’re here to help you pick them.\n\nGet started by checking out our Top 9 Market-Beating Stocks. This is a curated list of our High Quality stocks that have generated a market-beating return of 175% over the last five years.\n\nStocks that made our list in 2019 include now familiar names such as Nvidia (+2,691% between September 2019 and September 2024) as well as under-the-radar businesses like United Rentals (+550% five-year return). Find your next big winner with StockStory today for free.",
    "word_count": 447
  },
  {
    "title": "This is what could drive consumer spending in 2025",
    "url": "https://finance.yahoo.com/video/could-drive-consumer-spending-2025-214717345.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  },
  {
    "title": "Wall Street strategists' 2025 New Year's resolutions for investors",
    "url": "https://finance.yahoo.com/video/wall-street-strategists-2025-years-170000264.html",
    "timestamp": "2025-01-04 15:33:39",
    "error": "Skipped video URL"
  }
]